RhinoCommon SDK
Curve.DerivativeAt Method (Double, Int32)
Rhino for Mac 5.1
 Evaluate the derivatives at the specified curve parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d[] DerivativeAt(
	double t,
	int derivativeCount
)
Public Function DerivativeAt (
	t As Double,
	derivativeCount As Integer
) As Vector3d()
Parameters
t
Type: System.Double
Curve parameter to evaluate.
derivativeCount
Type: System.Int32
Number of derivatives to evaluate, must be at least 0.
Return Value
Type: Vector3d[]
An array of vectors that represents all the derivatives starting at zero.
See Also
Reference
Curve Class
DerivativeAt Overload
Rhino.Geometry Namespace