RhinoCommon SDK
ObjectEnumeratorSettings.ViewportFilter Property
Rhino for Mac 5.1
 Filter on value of object->IsActiveInViewport()
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoViewport ViewportFilter { get; set; }
Public Property ViewportFilter As RhinoViewport
	Get
	Set
Property Value
Type: RhinoViewport
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace