RhinoCommon SDK
DisplayPipeline.ObjectCulling Event
Rhino for Mac 5.1
[Missing <summary> documentation for "E:Rhino.Display.DisplayPipeline.ObjectCulling"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<CullObjectEventArgs> ObjectCulling
Public Shared Event ObjectCulling As EventHandler(Of CullObjectEventArgs)
Value
Type: System.EventHandler<CullObjectEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace