RhinoCommon SDK
Material.Reflectivity Property
Rhino for Mac 5.1
 Gets or sets how reflective a material is, 0f is no reflection 1f is 100% reflective.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Reflectivity { get; set; }
Public Property Reflectivity As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Material Class
Rhino.DocObjects Namespace