RhinoCommon SDK
DisplayModeDescription.AddDisplayMode Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayModeDescription.AddDisplayMode(Rhino.Display.DisplayModeDescription)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid AddDisplayMode(
	DisplayModeDescription displayMode
)
Public Shared Function AddDisplayMode (
	displayMode As DisplayModeDescription
) As Guid
Parameters
displayMode
Type: Rhino.Display.DisplayModeDescription
[Missing <param name="displayMode"/> documentation for "M:Rhino.Display.DisplayModeDescription.AddDisplayMode(Rhino.Display.DisplayModeDescription)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Display.DisplayModeDescription.AddDisplayMode(Rhino.Display.DisplayModeDescription)"]
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace