RhinoCommon SDK
CustomObjectGrips Properties
Rhino for Mac 5.1
The CustomObjectGrips type exposes the following members.
Properties
Name | Description
GripCount
GripsMoved
 If GripsMoved is true if some of the grips have ever been moved GripObject.NewLocation() sets GripsMoved=true.
NewLocation
 true if some of the grips have been moved. GripObject.NewLocation() sets NewLocation=true. Derived classes can set NewLocation to false after updating temporary display information.
OwnerObject
Owner of the grips.
Top
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace