RhinoCommon SDK
SimpleArrayInt Class
Rhino for Mac 5.1
 Wrapper for ON_SimpleArray<int>. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayInt
Namespace: Rhino.Runtime.InteropWrappers
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class SimpleArrayInt : IDisposable
Public Class SimpleArrayInt
	Implements IDisposable
The SimpleArrayInt type exposes the following members.
Constructors
Name | Description
SimpleArrayInt()
 Initializes a new SimpleArrayInt class.
SimpleArrayInt(IEnumerable<Int32>)
 Initializes a new SimpleArrayInt class
Top
Properties
Name | Description
Count
 Gets the amount of elements in this array.
Top
Methods
Name | Description
ConstPointer
 Gets the const (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-const pointer (for modification) of this array.
ToArray
 Returns the managed counterpart of the unmanaged array.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace