RhinoCommon SDK
Extrusion.GetMesh Method
Rhino for Mac 5.1
 Obtains a reference to a specified type of mesh for this extrusion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Mesh GetMesh(
	MeshType meshType
)
Public Function GetMesh (
	meshType As MeshType
) As Mesh
Parameters
meshType
Type: Rhino.Geometry.MeshType
The mesh type.
Return Value
Type: Mesh
A mesh.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace