RhinoCommon SDK
File3dmPlugInDataTable.GetEnumerator Method
Rhino for Mac 5.1
 Gets the enumerator that visits any File3dmPlugInData in this table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<File3dmPlugInData> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of File3dmPlugInData)
Return Value
Type: IEnumerator<File3dmPlugInData>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
File3dmPlugInDataTable Class
Rhino.FileIO Namespace