RhinoCommon SDK
MaterialRefs.Remove Method (Guid)
Rhino for Mac 5.1
 Removes the MaterialRef with the specified plug-in Id from this dictionary.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Remove(
	Guid key
)
Public Function Remove (
	key As Guid
) As Boolean
Parameters
key
Type: System.Guid
 The plug-in Id for the MaterialRef to remove.
Return Value
Type: Boolean
 true if the MaterialRef is successfully removed; otherwise, false. This method also returns false if key was not found in the original dictionary.
Implements
IDictionary<TKey, TValue>.Remove(TKey)
See Also
Reference
MaterialRefs Class
Remove Overload
Rhino.DocObjects Namespace