RhinoCommon SDK
Rectangle3d.Corner Method
Rhino for Mac 5.1
 Gets the corner at the given index.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d Corner(
	int index
)
Public Function Corner (
	index As Integer
) As Point3d
Parameters
index
Type: System.Int32
 Index of corner, valid values are:
0 = lower left (min-x, min-y)
1 = lower right (max-x, min-y)
2 = upper right (max-x, max-y)
3 = upper left (min-x, max-y)
Return Value
Type: Point3d
The point at the given corner index.
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace