RhinoCommon SDK
Curve.HasNurbsForm Method
Rhino for Mac 5.1
 Does a NURBS curve representation of this curve exist?
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int HasNurbsForm()
Public Function HasNurbsForm As Integer
Return Value
Type: Int32
 0 unable to create NURBS representation with desired accuracy. 1 success - NURBS parameterization matches the curve's to the desired accuracy 2 success - NURBS point locus matches the curve's and the domain of the NURBS curve is correct. However, This curve's parameterization and the NURBS curve parameterization may not match. This situation happens when getting NURBS representations of curves that have a transendental parameterization like circles.
See Also
Reference
Curve Class
Rhino.Geometry Namespace