RhinoCommon SDK
GetPointMouseEventArgs.MiddleButtonDown Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.MiddleButtonDown"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MiddleButtonDown { get; }
Public ReadOnly Property MiddleButtonDown As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace