RhinoCommon SDK
Matrix.ColumnCount Property
Rhino for Mac 5.1
 Gets the amount of columns.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ColumnCount { get; }
Public ReadOnly Property ColumnCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Matrix Class
Rhino.Geometry Namespace