RhinoCommon SDK
Cone.IsValid Property
Rhino for Mac 5.1
 true if plane is valid, height is not zero and radius is not zero.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Cone Structure
Rhino.Geometry Namespace