RhinoCommon SDK
OpenFileDialog.Title Property
Rhino for Mac 5.1
 Gets or sets the file dialog box title.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Title { get; set; }
Public Property Title As String
	Get
	Set
Property Value
Type: String
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace