RhinoCommon SDK
ClippingPlaneObject.ClippingPlaneGeometry Property
Rhino for Mac 5.1
 Gets the clipping plane surface.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ClippingPlaneSurface ClippingPlaneGeometry { get; }
Public ReadOnly Property ClippingPlaneGeometry As ClippingPlaneSurface
	Get
Property Value
Type: ClippingPlaneSurface
See Also
Reference
ClippingPlaneObject Class
Rhino.DocObjects Namespace