RhinoCommon SDK
BrepEdgeList Methods
Rhino for Mac 5.1
The BrepEdgeList type exposes the following members.
Methods
Name | Description
Add(Int32)
 Create and add a new edge to this list
Add(Int32, Int32, Int32, Double)
 Create and add a new edge to this list
Add(BrepVertex, BrepVertex, Int32, Double)
 Create and add a new edge to this list
Add(Int32, Int32, Int32, Interval, Double)
 Create and add a new edge to this list
Add(BrepVertex, BrepVertex, Int32, Interval, Double)
 Create and add a new edge to this list
GetEnumerator
 Gets an enumerator that visits all edges.
SplitEdgeAtParameters
 Splits an edge at the specified parameters.
SplitKinkyEdge
Splits the edge into G1 pieces.
Top
See Also
Reference
BrepEdgeList Class
Rhino.Geometry.Collections Namespace