RhinoCommon SDK
BrepEdgeList.SplitEdgeAtParameters Method
Rhino for Mac 5.1
 Splits an edge at the specified parameters.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int SplitEdgeAtParameters(
	int edgeIndex,
	IEnumerable<double> edgeParameters
)
Public Function SplitEdgeAtParameters (
	edgeIndex As Integer,
	edgeParameters As IEnumerable(Of Double)
) As Integer
Parameters
edgeIndex
Type: System.Int32
The index of the edge to be addressed.
edgeParameters
Type: System.Collections.Generic.IEnumerable<Double>
The parameter along that edge.
Return Value
Type: Int32
 Number of splits applied to the edge.
Remarks
 This function leaves deleted stuff in the brep. Call Brep.Compact() to remove deleted stuff.
See Also
Reference
BrepEdgeList Class
Rhino.Geometry.Collections Namespace