RhinoCommon SDK
InstanceDefinitionTable Methods
Rhino for Mac 5.1
The InstanceDefinitionTable type exposes the following members.
Methods
Name | Description
Add(String, String, Point3d, IEnumerable<GeometryBase>)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, GeometryBase, ObjectAttributes)
 Adds an instance definition to the instance definition table.
Add(String, String, Point3d, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Adds an instance definition to the instance definition table.
Compact
 Purge deleted instance definition information that is not in use. This function is time consuming and should be used in a thoughtful manner.
Delete
 Deletes the instance definition.
Find(Guid, Boolean)
Finds the instance definition with a given id.
Find(String, Boolean)
Finds the instance definition with a given name.
GetEnumerator
GetList
 Gets an array of instance definitions.
GetUnusedInstanceDefinitionName()
 Gets unsed instance definition name used as default when creating new instance definitions.
GetUnusedInstanceDefinitionName(String)
 Gets unsed instance definition name used as default when creating new instance definitions.
GetUnusedInstanceDefinitionName(String, UInt32)
 Gets unsed instance definition name used as default when creating new instance definitions.
MakeSourcePathRelative
 Marks the source path for a linked instance definition as relative or absolute.
Modify(Int32, String, String, Boolean)
 Modifies the instance definition name and description. Does not change instance definition ID or geometry.
Modify(InstanceDefinition, String, String, Boolean)
 Modifies the instance definition name and description. Does not change instance definition ID or geometry.
ModifyGeometry(Int32, IEnumerable<GeometryBase>)
ModifyGeometry(Int32, GeometryBase, ObjectAttributes)
ModifyGeometry(Int32, IEnumerable<GeometryBase>, IEnumerable<ObjectAttributes>)
 Modifies the instance definition geometry and replaces all references to the current definition with references to the new definition.
Purge
 Purges an instance definition and its definition geometry.
Undelete
 Undeletes an instance definition that has been deleted by Delete()
UndoModify
 Restores the instance definition to its previous state, if the instance definition has been modified and the modification can be undone.
UpdateLinkedInstanceDefinition
 Read the objects from a file and use them as the instance's definition geometry.
Top
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace