RhinoCommon SDK
File3dmTypeCodes.TCODE_COMPRESSED_MESH_GEOMETRY Field
Rhino for Mac 5.1
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_COMPRESSED_MESH_GEOMETRY"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_COMPRESSED_MESH_GEOMETRY
Public Const TCODE_COMPRESSED_MESH_GEOMETRY As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace