RhinoCommon SDK
Panels.ClosePanel Method (Type)
Rhino for Mac 5.1
 Will close or hide the specified panel type, in Windows Rhino, if it is the only visible tab the tab dock bar will be closed as well. In Mac Rhino it will always close the modeless dialog hosting the panel.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void ClosePanel(
	Type panelType
)
Public Shared Sub ClosePanel (
	panelType As Type
)
Parameters
panelType
Type: System.Type
 Class type of the panel to close.
See Also
Reference
Panels Class
ClosePanel Overload
Rhino.UI Namespace