RhinoCommon SDK
GroupTable.ChangeGroupName Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.GroupTable.ChangeGroupName(System.Int32,System.String)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ChangeGroupName(
	int groupIndex,
	string newName
)
Public Function ChangeGroupName (
	groupIndex As Integer,
	newName As String
) As Boolean
Parameters
groupIndex
Type: System.Int32
[Missing <param name="groupIndex"/> documentation for "M:Rhino.DocObjects.Tables.GroupTable.ChangeGroupName(System.Int32,System.String)"]
newName
Type: System.String
[Missing <param name="newName"/> documentation for "M:Rhino.DocObjects.Tables.GroupTable.ChangeGroupName(System.Int32,System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.GroupTable.ChangeGroupName(System.Int32,System.String)"]
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace