RhinoCommon SDK
Mesh.CreateFromPlane Method
Rhino for Mac 5.1
 Constructs a planar mesh grid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Mesh CreateFromPlane(
	Plane plane,
	Interval xInterval,
	Interval yInterval,
	int xCount,
	int yCount
)
Public Shared Function CreateFromPlane (
	plane As Plane,
	xInterval As Interval,
	yInterval As Interval,
	xCount As Integer,
	yCount As Integer
) As Mesh
Parameters
plane
Type: Rhino.Geometry.Plane
Plane of mesh.
xInterval
Type: Rhino.Geometry.Interval
Interval describing size and extends of mesh along plane x-direction.
yInterval
Type: Rhino.Geometry.Interval
Interval describing size and extends of mesh along plane y-direction.
xCount
Type: System.Int32
Number of faces in x-direction.
yCount
Type: System.Int32
Number of faces in y-direction.
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.CreateFromPlane(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval,System.Int32,System.Int32)"]
Exceptions
Exception | Condition
ArgumentException | Thrown when plane is a null reference.
ArgumentException | Thrown when xInterval is a null reference.
ArgumentException | Thrown when yInterval is a null reference.
ArgumentOutOfRangeException | Thrown when xCount is less than or equal to zero.
ArgumentOutOfRangeException | Thrown when yCount is less than or equal to zero.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace