RhinoCommon SDK
Command.EndCommand Event
Rhino for Mac 5.1
 Called immediately after command.RunCommand().
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<CommandEventArgs> EndCommand
Public Shared Event EndCommand As EventHandler(Of CommandEventArgs)
Value
Type: System.EventHandler<CommandEventArgs>
See Also
Reference
Command Class
Rhino.Commands Namespace