RhinoCommon SDK
Matrix.Duplicate Method
Rhino for Mac 5.1
 Create a duplicate of this matrix.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Matrix Duplicate()
Public Function Duplicate As Matrix
Return Value
Type: Matrix
An exact duplicate of this matrix.
See Also
Reference
Matrix Class
Rhino.Geometry Namespace