RhinoCommon SDK
BinaryArchiveReader.Read3dmStartSection Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.FileIO.BinaryArchiveReader.Read3dmStartSection(System.Int32@,System.String@)"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Read3dmStartSection(
	out int version,
	out string comment
)
Public Function Read3dmStartSection (
	<OutAttribute> ByRef version As Integer,
	<OutAttribute> ByRef comment As String
) As Boolean
Parameters
version
Type: System.Int32
.3dm file version (2, 3, 4, 5 or 50)
comment
Type: System.String
 String with application name, et cetera. This information is primarily used when debugging files that contain problems. McNeel and Associates stores application name, application version, compile date, and the OS in use when file was written.
Return Value
Type: Boolean
true on success
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace