RhinoCommon SDK
LeaderObject Class
Rhino for Mac 5.1
 Represents a Leader that is picked in a document
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.AnnotationObjectBase
 Rhino.DocObjects.LeaderObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class LeaderObject : AnnotationObjectBase
Public Class LeaderObject
	Inherits AnnotationObjectBase
The LeaderObject type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace