RhinoCommon SDK
CullFaceMode Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.CullFaceMode"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum CullFaceMode
Public Enumeration CullFaceMode
Members
Member name | Value | Description
DrawFrontAndBack | 0
DrawFrontFaces | 1
DrawBackFaces | 2
See Also
Reference
Rhino.Display Namespace