RhinoCommon SDK
StatusBar Methods
Rhino for Mac 5.1
The StatusBar type exposes the following members.
Methods
Name | Description
ClearMessagePane
 Removes the message from the message pane.
HideProgressMeter
 Ends, or hides, Rhino's status bar progress meter.
SetDistancePane
 Sets the distance pane to a distance value.
SetMessagePane
 Sets the message pane to a message.
SetPointPane
 Sets the point pane to a point value.
ShowProgressMeter
 Starts, or shows, Rhino's status bar progress meter.
UpdateProgressMeter
 Sets the current position of Rhino's status bar progress meter.
Top
See Also
Reference
StatusBar Class
Rhino.UI Namespace