RhinoCommon SDK
Linetype.PatternLength Property
Rhino for Mac 5.1
Total length of one repeat of the pattern.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double PatternLength { get; }
Public ReadOnly Property PatternLength As Double
	Get
Property Value
Type: Double
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace