RhinoCommon SDK
ArcCurve Constructor
Rhino for Mac 5.1
 Initializes a new ArcCurve instance.
Radius is set to 1, position to Origin and Domain to full span (circle).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ArcCurve()
Public Sub New
See Also
Reference
ArcCurve Class
ArcCurve Overload
Rhino.Geometry Namespace