RhinoCommon SDK
ObjRef Constructor (RhinoObject, PickContext)
Rhino for Mac 5.1
 Initialized a new object reference from a Rhino object and pick context
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjRef(
	RhinoObject rhinoObject,
	PickContext pickContext
)
Public Sub New (
	rhinoObject As RhinoObject,
	pickContext As PickContext
)
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhinoObject"/> documentation for "M:Rhino.DocObjects.ObjRef.#ctor(Rhino.DocObjects.RhinoObject,Rhino.Input.Custom.PickContext)"]
pickContext
Type: Rhino.Input.Custom.PickContext
[Missing <param name="pickContext"/> documentation for "M:Rhino.DocObjects.ObjRef.#ctor(Rhino.DocObjects.RhinoObject,Rhino.Input.Custom.PickContext)"]
See Also
Reference
ObjRef Class
ObjRef Overload
Rhino.DocObjects Namespace