RhinoCommon SDK
Brep.GetArea Method
Rhino for Mac 5.1
Overload List
Name | Description
GetArea()
 Compute the Area of the Brep. If you want proper Area data with moments and error information, use the AreaMassProperties class.
GetArea(Double, Double)
 Compute the Area of the Brep. If you want proper Area data with moments and error information, use the AreaMassProperties class.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace