RhinoCommon SDK
ObjectTable.Delete Method (ObjRef, Boolean)
Rhino for Mac 5.1
 Deletes objref.Object(). The deletion can be undone by calling UndeleteObject().
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Delete(
	ObjRef objref,
	bool quiet
)
Public Function Delete (
	objref As ObjRef,
	quiet As Boolean
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
objref.Object() will be deleted.
quiet
Type: System.Boolean
If false, a message box will appear when an object cannot be deleted.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
ObjectTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace