RhinoCommon SDK
Curve.IsClosable Method (Double)
Rhino for Mac 5.1
 Decide if it makes sense to close off this curve by moving the endpoint to the start based on start-end gap size and length of curve as approximated by chord defined by 6 points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsClosable(
	double tolerance
)
Public Function IsClosable (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
 Maximum allowable distance between start and end. If start - end gap is greater than tolerance, this function will return false.
Return Value
Type: Boolean
true if start and end points are close enough based on above conditions.
See Also
Reference
Curve Class
IsClosable Overload
Rhino.Geometry Namespace