RhinoCommon SDK
CurveList.Insert Method (Int32, IEnumerable<Point3d>)
Rhino for Mac 5.1
 Inserts a polyline at a given index of this list.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Insert(
	int index,
	IEnumerable<Point3d> polyline
)
Public Sub Insert (
	index As Integer,
	polyline As IEnumerable(Of Point3d)
)
Parameters
index
Type: System.Int32
A 0-based position in the list.
polyline
Type: System.Collections.Generic.IEnumerable<Point3d>
The polyline enumerable from which to construct a copy curve.
This argument can be null, an array, a list or any enumerable set of Point3d.
See Also
Reference
CurveList Class
Insert Overload
Rhino.Collections Namespace