RhinoCommon SDK
Layer.UnsetPersistentLocking Method
Rhino for Mac 5.1
 Remove any explicity persistent locking settings from this layer
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void UnsetPersistentLocking()
Public Sub UnsetPersistentLocking
See Also
Reference
Layer Class
Rhino.DocObjects Namespace