RhinoCommon SDK
Transform.GetHashCode Method
Rhino for Mac 5.1
 Gets a non-unique hashing code for this transform.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A number that can be used to hash this transform in a dictionary.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace