RhinoCommon SDK
LayerTable Methods
Rhino for Mac 5.1
The LayerTable type exposes the following members.
Methods
Name | Description
Add()
 Adds a new layer with default definition to the layer table.
Add(Layer)
 Adds a new layer with specified definition to the layer table.
Add(String, Color)
 Adds a new layer with specified definition to the layer table.
AddReferenceLayer()
 Adds a new reference layer with default definition to the layer table. Reference layers are not saved in files.
AddReferenceLayer(Layer)
 Adds a new reference layer with specified definition to the layer table Reference layers are not saved in files.
Delete
Deletes layer.
Find(Guid, Boolean)
Finds a layer with a matching ID.
Find(String, Boolean)
 Finds the layer with a given name. If multiple layers exist that have the same name, the first match layer index will be returned.
FindByFullPath
FindNext
ForceLayerVisible(Guid)
 Makes a layer and all of its parent layers visible.
ForceLayerVisible(Int32)
 Makes a layer and all of its parent layers visible.
GetEnumerator
GetUnusedLayerName
 Gets the next unused layer name used as default when creating new layers.
Modify
Modifies layer settings.
Purge
 Delete layer and all geometry objects on a layer
SetCurrentLayerIndex
 At all times, there is a "current" layer. Unless otherwise specified, new objects are assigned to the current layer. The current layer is never locked, hidden, or deleted.
Undelete
 Undeletes a layer that has been deleted by DeleteLayer().
UndoModify(Int32)
UndoModify(Int32, UInt32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
Top
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace