RhinoCommon SDK
GripObject.GetGripDirections Method
Rhino for Mac 5.1
 Sometimes grips have directions. These directions can have any length and do not have to be orthoganal.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetGripDirections(
	out Vector3d u,
	out Vector3d v,
	out Vector3d normal
)
Public Function GetGripDirections (
	<OutAttribute> ByRef u As Vector3d,
	<OutAttribute> ByRef v As Vector3d,
	<OutAttribute> ByRef normal As Vector3d
) As Boolean
Parameters
u
Type: Rhino.Geometry.Vector3d
 u direction
v
Type: Rhino.Geometry.Vector3d
 v direction
normal
Type: Rhino.Geometry.Vector3d
 normal direction
Return Value
Type: Boolean
True if the grip has directions.
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace