RhinoCommon SDK
ObjectAttributes.LinetypeIndex Property
Rhino for Mac 5.1
 Gets or sets the linetype index.
Linetype definitions in an OpenNURBS model are stored in a linetype table. The linetype table is conceptually an array of ON_Linetype classes. Every OpenNURBS object in a model references some linetype. The object's linetype is specified by zero based indicies into the ON_Linetype array.
Index 0 is reserved for continuous linetype (no pattern).
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int LinetypeIndex { get; set; }
Public Property LinetypeIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace