RhinoCommon SDK
LocalizeStringPair Constructor
Rhino for Mac 5.1
Initializes a new instance of the LocalizeStringPair class
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public LocalizeStringPair(
	string english,
	string local
)
Public Sub New (
	english As String,
	local As String
)
Parameters
english
Type: System.String
[Missing <param name="english"/> documentation for "M:Rhino.UI.LocalizeStringPair.#ctor(System.String,System.String)"]
local
Type: System.String
[Missing <param name="local"/> documentation for "M:Rhino.UI.LocalizeStringPair.#ctor(System.String,System.String)"]
See Also
Reference
LocalizeStringPair Class
Rhino.UI Namespace