RhinoCommon SDK
BezierCurve.GetBoundingBox Method
Rhino for Mac 5.1
 Boundingbox solver. Gets the world axis aligned boundingbox for the curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox GetBoundingBox(
	bool accurate
)
Public Function GetBoundingBox (
	accurate As Boolean
) As BoundingBox
Parameters
accurate
Type: System.Boolean
If true, a physically accurate boundingbox will be computed. If not, a boundingbox estimate will be computed. For some geometry types there is no difference between the estimate and the accurate boundingbox. Estimated boundingboxes can be computed much (much) faster than accurate (or "tight") bounding boxes. Estimated bounding boxes are always similar to or larger than accurate bounding boxes.
Return Value
Type: BoundingBox
 The boundingbox of the geometry in world coordinates or BoundingBox.Empty if not bounding box could be found.
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace