RhinoCommon SDK
GeometryBase.Rotate Method
Rhino for Mac 5.1
 Rotates the object about the specified axis. A positive rotation angle results in a counter-clockwise rotation about the axis (right hand rule).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Rotate(
	double angleRadians,
	Vector3d rotationAxis,
	Point3d rotationCenter
)
Public Function Rotate (
	angleRadians As Double,
	rotationAxis As Vector3d,
	rotationCenter As Point3d
) As Boolean
Parameters
angleRadians
Type: System.Double
Angle of rotation in radians.
rotationAxis
Type: Rhino.Geometry.Vector3d
Direction of the axis of rotation.
rotationCenter
Type: Rhino.Geometry.Point3d
Point on the axis of rotation.
Return Value
Type: Boolean
true if geometry successfully rotated.
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace