RhinoCommon SDK
RhinoObject.GroupCount Property
Rhino for Mac 5.1
Number of groups object belongs to.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int GroupCount { get; }
Public ReadOnly Property GroupCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace