RhinoCommon SDK
Material.DiffuseColor Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.DiffuseColor"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color DiffuseColor { get; set; }
Public Property DiffuseColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Material Class
Rhino.DocObjects Namespace