RhinoCommon SDK
Mesh.Offset Method
Rhino for Mac 5.1
Overload List
Name | Description
Offset(Double)
 Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals. Same as Mesh.Offset(distance, false)
Offset(Double, Boolean)
 Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals. Optionally, based on the value of solidify, adds the input mesh and a ribbon of faces along any naked edges. If solidify is false it acts exactly as the Offset(distance) function.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace