RhinoCommon SDK
UserDictionary.Write Method
Rhino for Mac 5.1
 Is called to write this entity.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected override bool Write(
	BinaryArchiveWriter archive
)
Protected Overrides Function Write (
	archive As BinaryArchiveWriter
) As Boolean
Parameters
archive
Type: Rhino.FileIO.BinaryArchiveWriter
An archive.
Return Value
Type: Boolean
Always returns true.
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace