RhinoCommon SDK
Vector3d.Reverse Method
Rhino for Mac 5.1
 Reverses (inverts) this vector in place.
If this vector is Invalid, no changes will occur and false will be returned.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Reverse()
Public Function Reverse As Boolean
Return Value
Type: Boolean
true on success or false if the vector is invalid.
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace