RhinoCommon SDK
Interval.NormalizedIntervalAt Method
Rhino for Mac 5.1
Converts interval value, or pair of values, to normalized parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interval NormalizedIntervalAt(
	Interval intervalParameter
)
Public Function NormalizedIntervalAt (
	intervalParameter As Interval
) As Interval
Parameters
intervalParameter
Type: Rhino.Geometry.Interval
[Missing <param name="intervalParameter"/> documentation for "M:Rhino.Geometry.Interval.NormalizedIntervalAt(Rhino.Geometry.Interval)"]
Return Value
Type: Interval
Normalized parameter x so that min*(1.0-x) + max*x = intervalParameter.
See Also
Reference
Interval Structure
Rhino.Geometry Namespace
ParameterAt