RhinoCommon SDK
DisplayPipeline.RenderPass Property
Rhino for Mac 5.1
 Gets the current pass that the pipeline is in for drawing a frame. Typically drawing a frame requires a single pass through the DrawFrameBuffer function, but some special display effects can be achieved through drawing with multiple passes.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int RenderPass { get; }
Public ReadOnly Property RenderPass As Integer
	Get
Property Value
Type: Int32
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace