RhinoCommon SDK
MeshClash.MeshB Property
Rhino for Mac 5.1
 Gets the second mesh.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Mesh MeshB { get; }
Public ReadOnly Property MeshB As Mesh
	Get
Property Value
Type: Mesh
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace