RhinoCommon SDK
Mesh.IsClosed Property
Rhino for Mac 5.1
 Gets a value indicating whether a mesh is considered to be closed (solid). A mesh is considered solid when every mesh edge borders two or more faces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsClosed { get; }
Public ReadOnly Property IsClosed As Boolean
	Get
Return Value
Type: Boolean
true if the mesh is closed, false if it is not.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace