RhinoCommon SDK
CachedTextureCoordinates Class
Rhino for Mac 5.1
 Used for cached texture coordinates
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Render.CachedTextureCoordinates
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class CachedTextureCoordinates : CommonObject,
	IList<Point3d>, ICollection<Point3d>, IEnumerable<Point3d>,
	IEnumerable
Public Class CachedTextureCoordinates
	Inherits CommonObject
	Implements IList(Of Point3d), ICollection(Of Point3d),
	IEnumerable(Of Point3d), IEnumerable
The CachedTextureCoordinates type exposes the following members.
Properties
Name | Description
Count
 Number of cached coordinates.
Dim
 Coordinate dimension: 2 = UV, 3 = UVW
IsReadOnly
 This collection is always read-only
Item
 Gets the element at the specified index. Never call the set method, it will always throw a NotSupportedException because this list is read-only.
MappingId
 The texture mapping Id.
Top
Methods
Name | Description
Add
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
Clear
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
Contains
 Determines whether this collection contains a specific value.
CopyTo
 Copies the elements of the this collection to an System.Array, starting at a particular System.Array index.
GetEnumerator
 Returns an enumerator that iterates through this collection.
IndexOf
 Determines the index of a specific point in this collection.
Insert
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
Remove
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
RemoveAt
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
TryGetAt
 Use this method to iterate the cached texture coordinate array.
Top
See Also
Reference
Rhino.Render Namespace