RhinoCommon SDK
Surface.IsSingular Method
Rhino for Mac 5.1
 true if surface side is collapsed to a point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSingular(
	int side
)
Public Function IsSingular (
	side As Integer
) As Boolean
Parameters
side
Type: System.Int32
 side of parameter space to test 0 = south, 1 = east, 2 = north, 3 = west.
Return Value
Type: Boolean
True if this specific side of the surface is singular; otherwise, false.
See Also
Reference
Surface Class
Rhino.Geometry Namespace