RhinoCommon SDK
Unroller Class
Rhino for Mac 5.1
 Represents the operation of unrolling a single surface.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Unroller
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class Unroller
Public Class Unroller
The Unroller type exposes the following members.
Constructors
Name | Description
Unroller(Brep)
 Initializes a new instance of the Unroller class with a brep.
Unroller(Surface)
 Initializes a new instance of the Unroller class with surface.
Top
Properties
Name | Description
AbsoluteTolerance
 Gets or sets the absolute tolerance for the unrolling operation.
Absolute tolerance is used in the evaluation of new entities, such as intersections, reprojections and splits.
In the current implementation, absolute tolerance is used in tessellating rails, fitting curves and pulling back trims.
ExplodeOutput
 Gets or sets a value determining whether geometry should be exploded.
ExplodeSpacing
 Gets or sets a value determining whether spacing should be exploded.
RelativeTolerance
 Gets or sets the relative tolerance for the unrolling operation.
Relative tolerance is used in the evaluation of intrinsic properties, such as computations "along" the surface or brep.
In the current implementation, relative tolerance is used to decide if a surface is flat enough to try to unroll. That helps ease the scale dependency. The surface has to be linear in one direction within (length * RelativeTolerance) to be considered linear for that purpose. Otherwise smash will ignore that tolerance and unroll anything.
Top
Methods
Name | Description
AddFollowingGeometry(Curve)
 Adds a curve that should be unrolled along with the surface/brep.
AddFollowingGeometry(IEnumerable<Curve>)
 Adds curves that should be unrolled along with the surface/brep.
AddFollowingGeometry(Point)
 Adds a point that should be unrolled along with the surface/brep.
AddFollowingGeometry(Point3d)
 Adds a point that should be unrolled along with the surface/brep.
AddFollowingGeometry(IEnumerable<Point3d>)
 Adds points that should be unrolled along with the surface/brep.
AddFollowingGeometry(TextDot)
 Adds a text dot that should be unrolled along with the surface/brep.
AddFollowingGeometry(IEnumerable<TextDot>)
 Adds text dots that should be unrolled along with the surface/brep.
AddFollowingGeometry(Point3d, String)
 Adds a text dot that should be unrolled along with the surface/brep.
AddFollowingGeometry(IEnumerable<Point3d>, IEnumerable<String>)
 Adds text dots that should be unrolled along with the surface/brep.
PerformUnroll
 Executes unrolling operations.
Top
See Also
Reference
Rhino.Geometry Namespace