RhinoCommon SDK
HatchPattern Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.HatchPattern"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.HatchPattern
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class HatchPattern : CommonObject
<SerializableAttribute>
Public Class HatchPattern
	Inherits CommonObject
The HatchPattern type exposes the following members.
Constructors
Name | Description
HatchPattern()
Initializes a new instance of the HatchPattern class
HatchPattern(SerializationInfo, StreamingContext)
Initializes a new instance of the HatchPattern class
Top
Properties
Name | Description
Description
FillType
Index
 Index in the hatch pattern table for this pattern. -1 if not in the table.
IsDeleted
 Deleted hatch patterns are kept in the runtime hatch pattern table so that undo will work with hatch patterns. Call IsDeleted to determine to determine if a hatch pattern is deleted.
IsReference
 Rhino allows multiple files to be viewed simultaneously. Hatch patterns in the document are "normal" or "reference". Reference hatch patterns are not saved.
Name
Top
Methods
Name | Description
ReadFromFile
 Reads hatch pattern definitions from a file.
Top
See Also
Reference
Rhino.DocObjects Namespace