RhinoCommon SDK
ColorCMYK.CreateFromXYZ Method
Rhino for Mac 5.1
 Constructs the nearest CMYK equivalent of an XYZ color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorCMYK CreateFromXYZ(
	ColorXYZ xyz
)
Public Shared Function CreateFromXYZ (
	xyz As ColorXYZ
) As ColorCMYK
Parameters
xyz
Type: Rhino.Display.ColorXYZ
Target color in XYZ space.
Return Value
Type: ColorCMYK
The CMYK equivalent of the XYZ color.
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace