RhinoCommon SDK
Layer.SortIndex Property
Rhino for Mac 5.1
 Runtime index used to sort layers in layer dialog.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int SortIndex { get; }
Public ReadOnly Property SortIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Layer Class
Rhino.DocObjects Namespace