RhinoCommon SDK
RhinoObject.OnSelectionChanged Method
Rhino for Mac 5.1
 Called when the selection state of this object has changed
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnSelectionChanged()
Protected Overridable Sub OnSelectionChanged
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace