RhinoCommon SDK
ViewportInfo.GetDollyCameraVector Method (Int32, Int32, Int32, Int32, Double)
Rhino for Mac 5.1
 Gets a world coordinate dolly vector that can be passed to DollyCamera().
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d GetDollyCameraVector(
	int screenX0,
	int screenY0,
	int screenX1,
	int screenY1,
	double projectionPlaneDistance
)
Public Function GetDollyCameraVector (
	screenX0 As Integer,
	screenY0 As Integer,
	screenX1 As Integer,
	screenY1 As Integer,
	projectionPlaneDistance As Double
) As Vector3d
Parameters
screenX0
Type: System.Int32
Screen coords of start point.
screenY0
Type: System.Int32
Screen coords of start point.
screenX1
Type: System.Int32
Screen coords of end point.
screenY1
Type: System.Int32
Screen coords of end point.
projectionPlaneDistance
Type: System.Double
Distance of projection plane from camera. When in doubt, use 0.5*(frus_near+frus_far).
Return Value
Type: Vector3d
The world coordinate dolly vector.
See Also
Reference
ViewportInfo Class
GetDollyCameraVector Overload
Rhino.DocObjects Namespace