RhinoCommon SDK
DisplayBitmapDrawList.SortAngleTolerance Property
Rhino for Mac 5.1
 Angle in radians used to determine if an index list is "parallel enough" to a viewports camera angle. Default is 0.0873 radians (5 degrees)
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double SortAngleTolerance { get; set; }
Public Property SortAngleTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace