RhinoCommon SDK
NurbsCurve Constructor (NurbsCurve)
Rhino for Mac 5.1
 Initializes a NURBS curve by copying its values from another NURBS curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsCurve(
	NurbsCurve other
)
Public Sub New (
	other As NurbsCurve
)
Parameters
other
Type: Rhino.Geometry.NurbsCurve
The other curve. This value can be null.
See Also
Reference
NurbsCurve Class
NurbsCurve Overload
Rhino.Geometry Namespace