RhinoCommon SDK
Curve.GetCurveParameterFromNurbsFormParameter Method
Rhino for Mac 5.1
 Convert a NURBS curve parameter to a curve parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetCurveParameterFromNurbsFormParameter(
	double nurbsParameter,
	out double curveParameter
)
Public Function GetCurveParameterFromNurbsFormParameter (
	nurbsParameter As Double,
	<OutAttribute> ByRef curveParameter As Double
) As Boolean
Parameters
nurbsParameter
Type: System.Double
Nurbs form parameter.
curveParameter
Type: System.Double
Curve parameter.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
 If HasNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.
See Also
Reference
Curve Class
Rhino.Geometry Namespace