RhinoCommon SDK
DrawObjectEventArgs Properties
Rhino for Mac 5.1
The DrawObjectEventArgs type exposes the following members.
Properties
Name | Description
DrawObject
RhinoObject
Top
See Also
Reference
DrawObjectEventArgs Class
Rhino.Display Namespace