RhinoCommon SDK
RhinoObject.MeshCount Method
Rhino for Mac 5.1
 RhinoObjects can have several different types of meshes and different numbers of meshes. A b-rep can have a render and an analysis mesh on each face. A mesh object has a single render mesh and no analysis mesh. Curve, point, and annotation objects have no meshes.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual int MeshCount(
	MeshType meshType,
	MeshingParameters parameters
)
Public Overridable Function MeshCount (
	meshType As MeshType,
	parameters As MeshingParameters
) As Integer
Parameters
meshType
Type: Rhino.Geometry.MeshType
type of mesh to count
parameters
Type: Rhino.Geometry.MeshingParameters
 if not null and if the object can change its mesh (like a brep), then only meshes that were created with these mesh parameters are counted.
Return Value
Type: Int32
number of meshes
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace