RhinoCommon SDK
Transform.Scale Method (Plane, Double, Double, Double)
Rhino for Mac 5.1
 Constructs a new non-uniform scaling transformation with a specified scaling anchor point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform Scale(
	Plane plane,
	double xScaleFactor,
	double yScaleFactor,
	double zScaleFactor
)
Public Shared Function Scale (
	plane As Plane,
	xScaleFactor As Double,
	yScaleFactor As Double,
	zScaleFactor As Double
) As Transform
Parameters
plane
Type: Rhino.Geometry.Plane
Defines the center and orientation of the scaling operation.
xScaleFactor
Type: System.Double
Scaling factor along the anchor plane X-Axis direction.
yScaleFactor
Type: System.Double
Scaling factor along the anchor plane Y-Axis direction.
zScaleFactor
Type: System.Double
Scaling factor along the anchor plane Z-Axis direction.
Return Value
Type: Transform
A transformation matrix which scales geometry non-uniformly.
See Also
Reference
Transform Structure
Scale Overload
Rhino.Geometry Namespace