RhinoCommon SDK
ObjectTable.AddLeader Method
Rhino for Mac 5.1
Overload List
Name | Description
AddLeader(IEnumerable<Point3d>)
AddLeader(String, IEnumerable<Point3d>)
AddLeader(Plane, IEnumerable<Point2d>)
AddLeader(String, Plane, IEnumerable<Point2d>)
AddLeader(Plane, IEnumerable<Point2d>, ObjectAttributes)
AddLeader(String, Plane, IEnumerable<Point2d>, ObjectAttributes)
AddLeader(String, Plane, IEnumerable<Point2d>, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace