RhinoCommon SDK
DimStyleTable.DeleteDimensionStyle Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.DeleteDimensionStyle(System.Int32,System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DeleteDimensionStyle(
	int index,
	bool quiet
)
Public Function DeleteDimensionStyle (
	index As Integer,
	quiet As Boolean
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.DeleteDimensionStyle(System.Int32,System.Boolean)"]
quiet
Type: System.Boolean
[Missing <param name="quiet"/> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.DeleteDimensionStyle(System.Int32,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.DeleteDimensionStyle(System.Int32,System.Boolean)"]
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace