RhinoCommon SDK
ObjectAttributes.RemoveFromAllGroups Method
Rhino for Mac 5.1
Removes object from all groups.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void RemoveFromAllGroups()
Public Sub RemoveFromAllGroups
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace