RhinoCommon SDK
MaterialRefs.Remove Method (KeyValuePair<Guid, MaterialRef>)
Rhino for Mac 5.1
 Removes the element with the specified plug-in id from the this dictionary.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Remove(
	KeyValuePair<Guid, MaterialRef> item
)
Public Function Remove (
	item As KeyValuePair(Of Guid, MaterialRef)
) As Boolean
Parameters
item
Type: System.Collections.Generic.KeyValuePair<Guid, MaterialRef>
 The object to remove from this dictionary
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.MaterialRefs.Remove(System.Collections.Generic.KeyValuePair{System.Guid,Rhino.DocObjects.MaterialRef})"]
Implements
ICollection<T>.Remove(T)
See Also
Reference
MaterialRefs Class
Remove Overload
Rhino.DocObjects Namespace