RhinoCommon SDK
File3dm.LastEditedBy Property
Rhino for Mac 5.1
 Gets a string that names the user who last edited the file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string LastEditedBy { get; }
Public ReadOnly Property LastEditedBy As String
	Get
Property Value
Type: String
See Also
Reference
File3dm Class
Rhino.FileIO Namespace