RhinoCommon SDK
SpaceMorph Constructor
Rhino for Mac 5.1
Initializes a new instance of the SpaceMorph class
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected SpaceMorph()
Protected Sub New
See Also
Reference
SpaceMorph Class
Rhino.Geometry Namespace