RhinoCommon SDK
PlugIn.OptionsDialogPages Method
Rhino for Mac 5.1
 Override this function if you want to extend the options dialog. This function is called whenever the user brings up the Options dialog.
Namespace: Rhino.PlugIns
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OptionsDialogPages(
	List<OptionsDialogPage> pages
)
Protected Overridable Sub OptionsDialogPages (
	pages As List(Of OptionsDialogPage)
)
Parameters
pages
Type: System.Collections.Generic.List<OptionsDialogPage>
list of pages to add your custom options dialog page(s) to.
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace