RhinoCommon SDK
TransformCommand Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Commands.TransformCommand"]
Inheritance Hierarchy
System.Object
 Rhino.Commands.Command
 Rhino.Commands.TransformCommand
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class TransformCommand : Command
Public MustInherit Class TransformCommand
	Inherits Command
The TransformCommand type exposes the following members.
Constructors
Name | Description
TransformCommand
Initializes a new instance of the TransformCommand class
Top
Properties
Name | Description
Top
Methods
Name | Description
DuplicateObjects
ResetGrips
 Sets dynamic grip locations back to starting grip locations. This makes things like the Copy command work when grips are "copied".
SelectObjects(String, TransformObjectList)
 Selects objects within the command.
SelectObjects(String, ObjectType, TransformObjectList)
 Selects objects within the command.
TransformObjects
Top
See Also
Reference
Rhino.Commands Namespace