RhinoCommon SDK
Curve.PerpendicularFrameAt Method
Rhino for Mac 5.1
 Return a 3d frame at a parameter. This is slightly different than FrameAt in that the frame is computed in a way so there is minimal rotation from one frame to the next.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PerpendicularFrameAt(
	double t,
	out Plane plane
)
Public Function PerpendicularFrameAt (
	t As Double,
	<OutAttribute> ByRef plane As Plane
) As Boolean
Parameters
t
Type: System.Double
Evaluation parameter.
plane
Type: Rhino.Geometry.Plane
The frame is returned here.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace