RhinoCommon SDK
DisplayPipelineAttributes.ShadingEnabled Property
Rhino for Mac 5.1
Draw shaded meshes and surfaces
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ShadingEnabled { get; set; }
Public Property ShadingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace