RhinoCommon SDK
DrawFrameStages Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.DrawFrameStages"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[FlagsAttribute]
public enum DrawFrameStages
<FlagsAttribute>
Public Enumeration DrawFrameStages
Members
Member name | Value | Description
InitializeFrameBuffer | 1
SetupFrustum | 2
ObjectCulling | 4
CalculateBoundingBox | 8
CalculateClippingPlanes | 16
SetupLighting | 32
DrawBackground | 64
PreDrawObjects | 128
DrawObject | 256
PostDrawObjects | 512
DrawForeGround | 1024
DrawOverlay | 2048
PostProcessFrameBuffer | 4096
MeshingParameters | 8192
ObjectDisplayAttributes | 16384
PreObjectDraw | 32768
PostObjectDraw | 65536
ViewExtents | 131072
DrawMiddleGround | 896
ObjectBasedChannel | 114948
All | 4294836223
See Also
Reference
Rhino.Display Namespace