RhinoCommon SDK
ViewEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.ViewEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.ViewEventArgs
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class ViewEventArgs : EventArgs
Public Class ViewEventArgs
	Inherits EventArgs
The ViewEventArgs type exposes the following members.
Properties
Name | Description
View
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace