RhinoCommon SDK
Arc.Length Property
Rhino for Mac 5.1
 Gets the length of the arc. (Length = Radius * (subtended angle in radians)).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
See Also
Reference
Arc Structure
Rhino.Geometry Namespace