RhinoCommon SDK
CustomObjectGrips.NewGeometry Method
Rhino for Mac 5.1
 If the grips control just one object, then override NewGeometry(). When NewGeometry() is called, return new geometry calculated from the current grip locations. This happens once at the end of a grip drag.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual GeometryBase NewGeometry()
Protected Overridable Function NewGeometry As GeometryBase
Return Value
Type: GeometryBase
The new geometry. The default implementation returns null.
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace