RhinoCommon SDK
ClassIdAttribute Class
Rhino for Mac 5.1
 Useful for legacy UserData
Inheritance Hierarchy
System.Object
 System.Attribute
 Rhino.DocObjects.Custom.ClassIdAttribute
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class ClassIdAttribute : Attribute
Public NotInheritable Class ClassIdAttribute
	Inherits Attribute
The ClassIdAttribute type exposes the following members.
Constructors
Name | Description
ClassIdAttribute
Initializes a class id attrbute.
Top
Properties
Name | Description
Id
 Gets the associated style.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace