RhinoCommon SDK
ColorLCH.CreateFromHSL Method
Rhino for Mac 5.1
 Create the nearest LCH equivalent of an HSL color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorLCH CreateFromHSL(
	ColorHSL hsl
)
Public Shared Function CreateFromHSL (
	hsl As ColorHSL
) As ColorLCH
Parameters
hsl
Type: Rhino.Display.ColorHSL
Target color in HSL space.
Return Value
Type: ColorLCH
The LCH equivalent of the HSL color.
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace