RhinoCommon SDK
ColorLAB.CreateFromXYZ Method
Rhino for Mac 5.1
 Create the nearest LAB equivalent of an XYZ color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorLAB CreateFromXYZ(
	ColorXYZ xyz
)
Public Shared Function CreateFromXYZ (
	xyz As ColorXYZ
) As ColorLAB
Parameters
xyz
Type: Rhino.Display.ColorXYZ
Target color in XYZ space.
Return Value
Type: ColorLAB
The LAB equivalent of the XYZ color.
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace