RhinoCommon SDK
RTreeEventArgs.Tag Property
Rhino for Mac 5.1
 Gets or sets an arbitrary object that can be attached to this event args. This object will "stick" through a single search and can represent user-defined state.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Object Tag { get; set; }
Public Property Tag As Object
	Get
	Set
Property Value
Type: Object
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace