RhinoCommon SDK
Ellipse Properties
Rhino for Mac 5.1
The Ellipse type exposes the following members.
Properties
Name | Description
Plane
 Gets or sets the base plane of the ellipse.
Radius1
 Gets or sets the radius of the ellipse along the base plane X semiaxis.
Radius2
 Gets or sets the radius of the ellipse along the base plane Y semiaxis.
Top
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace