RhinoCommon SDK
DisplayConduit.PreDrawObject Method
Rhino for Mac 5.1
 Called before every object in the scene is drawn.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void PreDrawObject(
	DrawObjectEventArgs e
)
Protected Overridable Sub PreDrawObject (
	e As DrawObjectEventArgs
)
Parameters
e
Type: Rhino.Display.DrawObjectEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.Display.DisplayConduit.PreDrawObject(Rhino.Display.DrawObjectEventArgs)"]
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace