RhinoCommon SDK
BrepLoop Methods
Rhino for Mac 5.1
The BrepLoop type exposes the following members.
Methods
Name | Description
To2dCurve
 Create a 2d curve that traces the entire loop
To3dCurve
 Create a 3D curve that approximates the loop geometry.
Top
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace