RhinoCommon SDK
InstanceDefinitionGeometry.Name Property
Rhino for Mac 5.1
 Gets or sets the name of the definition.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace