RhinoCommon SDK
ObjRef Constructor (RhinoObject)
Rhino for Mac 5.1
 Initializes a new object reference from a Rhino object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjRef(
	RhinoObject rhinoObject
)
Public Sub New (
	rhinoObject As RhinoObject
)
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
The Rhino object.
See Also
Reference
ObjRef Class
ObjRef Overload
Rhino.DocObjects Namespace