RhinoCommon SDK
TextureMapping Methods
Rhino for Mac 5.1
The TextureMapping type exposes the following members.
Methods
Name | Description
CreateBoxMapping
Create a box projection texture mapping.
CreateCylinderMapping
Create a cylindrical projection texture mapping.
CreatePlaneMapping
Create a planar projection texture mapping
CreateSphereMapping
 Create a spherical projection texture mapping.
TryGetMappingBox
 Get a box projection from the texture mapping.
TryGetMappingCylinder
 Get a cylindrical projection parameters from this texture mapping.
TryGetMappingPlane
 Get plane mapping parameters from this texture mapping.
TryGetMappingSphere
 Get a spherical projection parameters from this texture mapping.
Top
See Also
Reference
TextureMapping Class
Rhino.Render Namespace