RhinoCommon SDK
Dialogs.ShowTextDialog Method
Rhino for Mac 5.1
 Display a text dialog similar to the dialog used for the "What" command.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void ShowTextDialog(
	string message,
	string title
)
Public Shared Sub ShowTextDialog (
	message As String,
	title As String
)
Parameters
message
Type: System.String
Text to display as the message content.
title
Type: System.String
Test to display as the form title.
See Also
Reference
Dialogs Class
Rhino.UI Namespace