RhinoCommon SDK
ObjectMode Enumeration
Rhino for Mac 5.1
 Defines enumerated values for the display and behavior of single objects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum ObjectMode
Public Enumeration ObjectMode
Members
Member name | Value | Description
Normal | 0 | Object mode comes from layer.
Hidden | 1 | Not visible, object cannot be selected or changed.
Locked | 2 | Visible, object cannot be selected or changed.
InstanceDefinitionObject | 3 |  Object is part of an InstanceDefinition. The InstanceDefinition m_object_uuid[] array will contain this object attribute's uuid.
See Also
Reference
Rhino.DocObjects Namespace