RhinoCommon SDK
Rectangle3d.Contains Method
Rhino for Mac 5.1
Overload List
Name | Description
Contains(Point3d)
 Determines if a point is included in this rectangle.
Contains(Double, Double)
 Determines if two plane parameters are included in this rectangle.
Top
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace