RhinoCommon SDK
File3dm.ReadNotes Method
Rhino for Mac 5.1
Reads only the notes from an existing 3dm file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string ReadNotes(
	string path
)
Public Shared Function ReadNotes (
	path As String
) As String
Parameters
path
Type: System.String
The file from which to read the notes.
Return Value
Type: String
The 3dm file notes.
Exceptions
Exception | Condition
FileNotFoundException | If path does not exist, is null or cannot be accessed because of permissions.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace