RhinoCommon SDK
File3dmObjectTable.AddPoint Method (Point3d)
Rhino for Mac 5.1
Adds a point object to the table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddPoint(
	Point3d point
)
Public Function AddPoint (
	point As Point3d
) As Guid
Parameters
point
Type: Rhino.Geometry.Point3d
A location for point.
Return Value
Type: Guid
Id of new object.
See Also
Reference
File3dmObjectTable Class
AddPoint Overload
Rhino.FileIO Namespace