RhinoCommon SDK
Point2d Constructor (Double, Double)
Rhino for Mac 5.1
 Initializes a new instance of Point2d from coordinates.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2d(
	double x,
	double y
)
Public Sub New (
	x As Double,
	y As Double
)
Parameters
x
Type: System.Double
The X (first) coordinate.
y
Type: System.Double
The Y (second) coordinate.
See Also
Reference
Point2d Structure
Point2d Overload
Rhino.Geometry Namespace