RhinoCommon SDK
BrepEdge.GetEdgeParameter Method
Rhino for Mac 5.1
 Get corresponding edge parameter for given trim at given trim parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetEdgeParameter(
	int trimIndex,
	double trimParameter,
	out double edgeParameter
)
Public Function GetEdgeParameter (
	trimIndex As Integer,
	trimParameter As Double,
	<OutAttribute> ByRef edgeParameter As Double
) As Boolean
Parameters
trimIndex
Type: System.Int32
[Missing <param name="trimIndex"/> documentation for "M:Rhino.Geometry.BrepEdge.GetEdgeParameter(System.Int32,System.Double,System.Double@)"]
trimParameter
Type: System.Double
[Missing <param name="trimParameter"/> documentation for "M:Rhino.Geometry.BrepEdge.GetEdgeParameter(System.Int32,System.Double,System.Double@)"]
edgeParameter
Type: System.Double
[Missing <param name="edgeParameter"/> documentation for "M:Rhino.Geometry.BrepEdge.GetEdgeParameter(System.Int32,System.Double,System.Double@)"]
Return Value
Type: Boolean
true on success
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace