RhinoCommon SDK
MorphControl.Surface Property
Rhino for Mac 5.1
 Returns the morph control's surface. While this should never be null, the calling function should check.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsSurface Surface { get; }
Public ReadOnly Property Surface As NurbsSurface
	Get
Property Value
Type: NurbsSurface
See Also
Reference
MorphControl Class
Rhino.Geometry Namespace