RhinoCommon SDK
RhinoViewport.Dispose Method
Rhino for Mac 5.1
Releases all resources used by the RhinoViewport
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RhinoViewport Class
Dispose Overload
Rhino.Display Namespace