RhinoCommon SDK
TextLog.ToString Method
Rhino for Mac 5.1
 If the TextLog was constructed using the empty constructor, then the text information is stored in a runtime string. The contents of this string is retrieved using ToString for this case
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.FileIO.TextLog.ToString"]
See Also
Reference
TextLog Class
Rhino.FileIO Namespace