RhinoCommon SDK
AnnotationBase Constructor
Rhino for Mac 5.1
Overload List
Name | Description
AnnotationBase()
 Protected constructor for internal use.
AnnotationBase(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace