RhinoCommon SDK
BrepLoop.LoopType Property
Rhino for Mac 5.1
 type of loop.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepLoopType LoopType { get; }
Public ReadOnly Property LoopType As BrepLoopType
	Get
Property Value
Type: BrepLoopType
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace