RhinoCommon SDK
ShowPanelEventArgs.Show Property
Rhino for Mac 5.1
 Will be true if showing or false if hiding
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Show { get; }
Public ReadOnly Property Show As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ShowPanelEventArgs Class
Rhino.UI Namespace