RhinoCommon SDK
TransformCommand.DuplicateObjects Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Commands.TransformCommand.DuplicateObjects(Rhino.Collections.TransformObjectList)"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected void DuplicateObjects(
	TransformObjectList list
)
Protected Sub DuplicateObjects (
	list As TransformObjectList
)
Parameters
list
Type: Rhino.Collections.TransformObjectList
[Missing <param name="list"/> documentation for "M:Rhino.Commands.TransformCommand.DuplicateObjects(Rhino.Collections.TransformObjectList)"]
See Also
Reference
TransformCommand Class
Rhino.Commands Namespace