RhinoCommon SDK
Curve.Split Method (Surface, Double)
Rhino for Mac 5.1
 Splits a curve into pieces using a surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] Split(
	Surface cutter,
	double tolerance
)
Public Function Split (
	cutter As Surface,
	tolerance As Double
) As Curve()
Parameters
cutter
Type: Rhino.Geometry.Surface
A cutting surface or polysurface.
tolerance
Type: System.Double
A tolerance for computing intersections.
Return Value
Type: Curve[]
An array of curves. This array can be empty.
See Also
Reference
Curve Class
Split Overload
Rhino.Geometry Namespace