RhinoCommon SDK
PointCloud.Add Method (Point3d, Vector3d, Color)
Rhino for Mac 5.1
 Append a new point to the end of the list.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Add(
	Point3d point,
	Vector3d normal,
	Color color
)
Public Sub Add (
	point As Point3d,
	normal As Vector3d,
	color As Color
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to append.
normal
Type: Rhino.Geometry.Vector3d
Normal vector of new point.
color
Type: System.Drawing.Color
Color of new point.
See Also
Reference
PointCloud Class
Add Overload
Rhino.Geometry Namespace