RhinoCommon SDK
LinetypeTable.ContinuousLinetypeName Property
Rhino for Mac 5.1
 Returns the text name of the continuous linetype.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string ContinuousLinetypeName { get; }
Public ReadOnly Property ContinuousLinetypeName As String
	Get
Property Value
Type: String
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace