RhinoCommon SDK
Sphere.ToNurbsSurface Method
Rhino for Mac 5.1
 Converts this sphere to its NurbsSurface representation. This is synonymous with calling NurbsSurface.CreateFromSphere().
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsSurface ToNurbsSurface()
Public Function ToNurbsSurface As NurbsSurface
Return Value
Type: NurbsSurface
A nurbs surface representation of this sphere or null.
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace