RhinoCommon SDK
CachedTextureCoordinates.Insert Method
Rhino for Mac 5.1
 IList implementation, this list is always read-only so calling this will cause a NotSupportedException to be thrown.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Insert(
	int index,
	Point3d item
)
Public Sub Insert (
	index As Integer,
	item As Point3d
)
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Render.CachedTextureCoordinates.Insert(System.Int32,Rhino.Geometry.Point3d)"]
item
Type: Rhino.Geometry.Point3d
[Missing <param name="item"/> documentation for "M:Rhino.Render.CachedTextureCoordinates.Insert(System.Int32,Rhino.Geometry.Point3d)"]
Implements
IList<T>.Insert(Int32, T)
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace