RhinoCommon SDK
RhinoReplaceObjectEventArgs Properties
Rhino for Mac 5.1
The RhinoReplaceObjectEventArgs type exposes the following members.
Properties
Name | Description
Document
NewRhinoObject
ObjectId
OldRhinoObject
Top
See Also
Reference
RhinoReplaceObjectEventArgs Class
Rhino.DocObjects Namespace