RhinoCommon SDK
DisplayConduit.ObjectCulling Method
Rhino for Mac 5.1
The default implementation does nothing.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void ObjectCulling(
	CullObjectEventArgs e
)
Protected Overridable Sub ObjectCulling (
	e As CullObjectEventArgs
)
Parameters
e
Type: Rhino.Display.CullObjectEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.Display.DisplayConduit.ObjectCulling(Rhino.Display.CullObjectEventArgs)"]
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace