RhinoCommon SDK
OptionColor Constructor
Rhino for Mac 5.1
Initializes a new instance of the OptionColor class
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public OptionColor(
	Color initialValue
)
Public Sub New (
	initialValue As Color
)
Parameters
initialValue
Type: System.Drawing.Color
[Missing <param name="initialValue"/> documentation for "M:Rhino.Input.Custom.OptionColor.#ctor(System.Drawing.Color)"]
See Also
Reference
OptionColor Class
Rhino.Input.Custom Namespace