RhinoCommon SDK
GripObject.Move Method (Point3d)
Rhino for Mac 5.1
 Moves the grip to a new location.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Move(
	Point3d newLocation
)
Public Sub Move (
	newLocation As Point3d
)
Parameters
newLocation
Type: Rhino.Geometry.Point3d
 New location for grip.
See Also
Reference
GripObject Class
Move Overload
Rhino.DocObjects Namespace