RhinoCommon SDK
Intersection.CurveSelf Method
Rhino for Mac 5.1
 Finds the places where a curve intersects itself.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static CurveIntersections CurveSelf(
	Curve curve,
	double tolerance
)
Public Shared Function CurveSelf (
	curve As Curve,
	tolerance As Double
) As CurveIntersections
Parameters
curve
Type: Rhino.Geometry.Curve
Curve for self-intersections.
tolerance
Type: System.Double
Intersection tolerance. If the curve approaches itself to within tolerance, an intersection is assumed.
Return Value
Type: CurveIntersections
A collection of intersection events.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace