RhinoCommon SDK
BrepFaceList.StandardizeFaceSurface Method
Rhino for Mac 5.1
 Standardizes the relationship between a BrepFace and the 3d surface it uses. When done, the face will be the only face that references its 3d surface, and the orientations of the face and 3d surface will be the same.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool StandardizeFaceSurface(
	int faceIndex
)
Public Function StandardizeFaceSurface (
	faceIndex As Integer
) As Boolean
Parameters
faceIndex
Type: System.Int32
The index of the face.
Return Value
Type: Boolean
true if successful.
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace