RhinoCommon SDK
CachedTextureCoordinates.Dim Property
Rhino for Mac 5.1
 Coordinate dimension: 2 = UV, 3 = UVW
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Dim { get; }
Public ReadOnly Property Dim As Integer
	Get
Property Value
Type: Int32
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace