RhinoCommon SDK
Brep.Trim Method (Plane, Double)
Rhino for Mac 5.1
 Trims a Brep with an oriented cutter. The parts of Brep that lie inside (opposite the normal) of the cutter are retained while the parts to the outside ( in the direction of the normal ) are discarded. A connected component of Brep that does not intersect the cutter is kept if and only if it is contained in the inside of Cutter. That is the region bounded by cutter opposite from the normal of cutter, or in the case of a Plane cutter the halfspace opposite from the plane normal.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] Trim(
	Plane cutter,
	double intersectionTolerance
)
Public Function Trim (
	cutter As Plane,
	intersectionTolerance As Double
) As Brep()
Parameters
cutter
Type: Rhino.Geometry.Plane
A cutting plane.
intersectionTolerance
Type: System.Double
A tolerance value with which to compute intersections.
Return Value
Type: Brep[]
This Brep is not modified, the trim results are returned in an array.
See Also
Reference
Brep Class
Trim Overload
Rhino.Geometry Namespace