RhinoCommon SDK
Interop.CreateFromNativePointer Method
Rhino for Mac 5.1
 Constructs a RhinoCommon Geometry class from a given ON_Geomety*. The ON_Geometry* must be declared on the heap and its lifetime becomes controlled by RhinoCommon.
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static GeometryBase CreateFromNativePointer(
	IntPtr pGeometry
)
Public Shared Function CreateFromNativePointer (
	pGeometry As IntPtr
) As GeometryBase
Parameters
pGeometry
Type: System.IntPtr
ON_Geometry*
Return Value
Type: GeometryBase
The appropriate geometry class in RhinoCommon on success.
See Also
Reference
Interop Class
Rhino.Runtime Namespace