RhinoCommon SDK
File3dmTypeCodes.TCODE_ENDOFFILE_GOO Field
Rhino for Mac 5.1
 (0x00007FFE) this typecode is returned when a rogue eof marker is found Some v1 3dm file writers put these markers in a "goo". Simply skip these chunks and continue.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_ENDOFFILE_GOO
Public Const TCODE_ENDOFFILE_GOO As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace