RhinoCommon SDK
LayerTable.Modify Method
Rhino for Mac 5.1
Modifies layer settings.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Modify(
	Layer newSettings,
	int layerIndex,
	bool quiet
)
Public Function Modify (
	newSettings As Layer,
	layerIndex As Integer,
	quiet As Boolean
) As Boolean
Parameters
newSettings
Type: Rhino.DocObjects.Layer
This information is copied.
layerIndex
Type: System.Int32
 zero based index of layer to set. This must be in the range 0 <= layerIndex < LayerTable.Count.
quiet
Type: System.Boolean
if true, information message boxes pop up when illegal changes are attempted.
Return Value
Type: Boolean
 true if successful. false if layerIndex is out of range or the settings attempt to lock or hide the current layer.
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace