RhinoCommon SDK
RhinoViewport.SetConstructionPlane Method
Rhino for Mac 5.1
Overload List
Name | Description
SetConstructionPlane(ConstructionPlane)
 Sets the construction plane to cplane.
SetConstructionPlane(Plane)
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace