RhinoCommon SDK
LocalizeStringPair.Local Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.LocalizeStringPair.Local"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Local { get; }
Public ReadOnly Property Local As String
	Get
Property Value
Type: String
See Also
Reference
LocalizeStringPair Class
Rhino.UI Namespace