RhinoCommon SDK
PolyCurve.DuplicatePolyCurve Method
Rhino for Mac 5.1
 Duplicates this polycurve.
This is the same as Duplicate().
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PolyCurve DuplicatePolyCurve()
Public Function DuplicatePolyCurve As PolyCurve
Return Value
Type: PolyCurve
An exact duplicate of this curve.
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace