RhinoCommon SDK
UserData Class
Rhino for Mac 5.1
 Provides a base class for custom classes of information which may be attached to geometry or attribute classes.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Custom.UserData
 Rhino.DocObjects.Custom.UnknownUserData
 Rhino.DocObjects.Custom.UserDictionary
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class UserData : IDisposable
Public MustInherit Class UserData
	Implements IDisposable
The UserData type exposes the following members.
Constructors
Name | Description
UserData
Initializes a new instance of the UserData class
Top
Properties
Name | Description
Description
Descriptive name of the user data.
ShouldWrite
 If you want to save this user data in a 3dm file, override ShouldWrite and return true. If you do support serialization, you must also override the Read and Write functions.
Transform
 Updated if user data is attached to a piece of geometry that is transformed and the virtual OnTransform() is not overridden. If you override OnTransform() and want Transform to be updated, then call the base class OnTransform() in your override. The default constructor sets Transform to the identity.
Top
Methods
Name | Description
Copy
 Expert user tool that copies user data that has a positive CopyCount from the source object to a destination object. Generally speaking you don't need to use Copy(). Simply rely on things like the copy constructors to do the right thing.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
MoveUserDataFrom
 Moves the user data from objectWithUserData to a temporary data storage identifierd by the return Guid. When MoveUserDataFrom returns, the objectWithUserData will not have any user data.
MoveUserDataTo
 Moves the user data.
See MoveUserDataFrom(CommonObject) for more information.
OnDuplicate
 Is called when the object is being duplicated.
OnTransform
 Is called when the object associated with this data is transformed. If you override this function, make sure to call the base class if you want the stored Transform to be updated.
Read
Reads the content of this data from a stream archive.
Write
Writes the content of this data to a stream archive.
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace