RhinoCommon SDK
RhinoView.ScreenToClient Method
Rhino for Mac 5.1
Overload List
Name | Description
ScreenToClient(Point)
 Converts a point in screen coordinates to client coordinates for this view.
ScreenToClient(Point2d)
Top
See Also
Reference
RhinoView Class
Rhino.Display Namespace