RhinoCommon SDK
RhinoGet.GetHelix Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetHelix(Rhino.Geometry.NurbsCurve@)"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetHelix(
	out NurbsCurve helix
)
Public Shared Function GetHelix (
	<OutAttribute> ByRef helix As NurbsCurve
) As Result
Parameters
helix
Type: Rhino.Geometry.NurbsCurve
[Missing <param name="helix"/> documentation for "M:Rhino.Input.RhinoGet.GetHelix(Rhino.Geometry.NurbsCurve@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetHelix(Rhino.Geometry.NurbsCurve@)"]
See Also
Reference
RhinoGet Class
Rhino.Input Namespace