RhinoCommon SDK
CommandLineOption.IsValidOptionName Method
Rhino for Mac 5.1
 Test a string to see if it can be used as an option name in any of the RhinoGet::AddCommandOption...() functions.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool IsValidOptionName(
	string optionName
)
Public Shared Function IsValidOptionName (
	optionName As String
) As Boolean
Parameters
optionName
Type: System.String
The string to be tested.
Return Value
Type: Boolean
true if string can be used as an option name.
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace