RhinoCommon SDK
CustomObjectGrips.GripCount Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.CustomObjectGrips.GripCount"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int GripCount { get; }
Public ReadOnly Property GripCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace