RhinoCommon SDK
Unroller Methods
Rhino for Mac 5.1
The Unroller type exposes the following members.
Methods
Name | Description
AddFollowingGeometry(Curve)
 Adds a curve that should be unrolled along with the surface/brep.
AddFollowingGeometry(IEnumerable<Curve>)
 Adds curves that should be unrolled along with the surface/brep.
AddFollowingGeometry(Point)
 Adds a point that should be unrolled along with the surface/brep.
AddFollowingGeometry(Point3d)
 Adds a point that should be unrolled along with the surface/brep.
AddFollowingGeometry(IEnumerable<Point3d>)
 Adds points that should be unrolled along with the surface/brep.
AddFollowingGeometry(TextDot)
 Adds a text dot that should be unrolled along with the surface/brep.
AddFollowingGeometry(IEnumerable<TextDot>)
 Adds text dots that should be unrolled along with the surface/brep.
AddFollowingGeometry(Point3d, String)
 Adds a text dot that should be unrolled along with the surface/brep.
AddFollowingGeometry(IEnumerable<Point3d>, IEnumerable<String>)
 Adds text dots that should be unrolled along with the surface/brep.
PerformUnroll
 Executes unrolling operations.
Top
See Also
Reference
Unroller Class
Rhino.Geometry Namespace