RhinoCommon SDK
MeshingParameters.GridMaxCount Property
Rhino for Mac 5.1
 Gets or sets the maximum number of grid quads in the initial sampling grid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int GridMaxCount { get; set; }
Public Property GridMaxCount As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace