RhinoCommon SDK
MeshTextureCoordinateList.TransposeTextureCoordinates Method
Rhino for Mac 5.1
 Transposes texture coordinates.
The region of the bitmap the texture uses does not change. All texture coordinates rows (Us) become columns (Vs), and vice versa.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TransposeTextureCoordinates()
Public Function TransposeTextureCoordinates As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace