RhinoCommon SDK
GeometryBase.ObjectType Property
Rhino for Mac 5.1
 Useful for switch statements that need to differentiate between basic object types like points, curves, surfaces, and so on.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectType ObjectType { get; }
Public ReadOnly Property ObjectType As ObjectType
	Get
Property Value
Type: ObjectType
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace