RhinoCommon SDK
MeshFaceList.GetFaceCenter Method
Rhino for Mac 5.1
 Gets the center point of a face.
For a triangular face, this is considered the centroid or barycenter.
For a quad, this is considered the bimedians intersection (the avarage of four points).
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d GetFaceCenter(
	int faceIndex
)
Public Function GetFaceCenter (
	faceIndex As Integer
) As Point3d
Parameters
faceIndex
Type: System.Int32
A face index.
Return Value
Type: Point3d
The center point.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace