RhinoCommon SDK
DisplayMaterial.SetBitmapTexture Method (Texture, Boolean)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayMaterial.SetBitmapTexture(Rhino.DocObjects.Texture,System.Boolean)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetBitmapTexture(
	Texture texture,
	bool front
)
Public Function SetBitmapTexture (
	texture As Texture,
	front As Boolean
) As Boolean
Parameters
texture
Type: Rhino.DocObjects.Texture
[Missing <param name="texture"/> documentation for "M:Rhino.Display.DisplayMaterial.SetBitmapTexture(Rhino.DocObjects.Texture,System.Boolean)"]
front
Type: System.Boolean
[Missing <param name="front"/> documentation for "M:Rhino.Display.DisplayMaterial.SetBitmapTexture(Rhino.DocObjects.Texture,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.DisplayMaterial.SetBitmapTexture(Rhino.DocObjects.Texture,System.Boolean)"]
See Also
Reference
DisplayMaterial Class
SetBitmapTexture Overload
Rhino.Display Namespace