RhinoCommon SDK
File3dm.TableTypeFilter Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.FileIO.File3dm.TableTypeFilter"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[FlagsAttribute]
public enum TableTypeFilter
<FlagsAttribute>
Public Enumeration TableTypeFilter
Members
Member name | Value | Description
None | 0
Properties | 1
Settings | 2
Bitmap | 4
TextureMapping | 8
Material | 16
Linetype | 32
Layer | 64
Group | 128
Font | 256
FutureFont | 512
Dimstyle | 1024
Light | 2048
Hatchpattern | 4096
InstanceDefinition | 8192
ObjectTable | 16384
Historyrecord | 32768
UserTable | 65536
See Also
Reference
Rhino.FileIO Namespace