RhinoCommon SDK
Interval.T1 Property
Rhino for Mac 5.1
 Gets or sets the upper bound of the Interval.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double T1 { get; set; }
Public Property T1 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Interval Structure
Rhino.Geometry Namespace