RhinoCommon SDK
InstanceDefinitionTable.Item Property
Rhino for Mac 5.1
 Conceptually, the InstanceDefinition table is an array of Instance definitions. The operator[] can be used to get individual instance definition. An instance definition is either active or deleted and this state is reported by IsDeleted or will be null if it has been purged from the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public InstanceDefinition this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As InstanceDefinition
	Get
Parameters
index
Type: System.Int32
zero based array index.
Return Value
Type: InstanceDefinition
The instance definition at the specified index.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace