RhinoCommon SDK
Layer.IsVisible Property
Rhino for Mac 5.1
 Gets or sets the visibility of this layer.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsVisible { get; set; }
Public Property IsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
Remarks
If you are modifying a layer inside a Rhino document, you must call CommitChanges for the modifications to take effect.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace