RhinoCommon SDK
DimensionStyle Methods
Rhino for Mac 5.1
The DimensionStyle type exposes the following members.
Methods
Name | Description
CommitChanges
Top
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace