RhinoCommon SDK
InstanceDefinitionTable.Find Method (Guid, Boolean)
Rhino for Mac 5.1
Finds the instance definition with a given id.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public InstanceDefinition Find(
	Guid instanceId,
	bool ignoreDeletedInstanceDefinitions
)
Public Function Find (
	instanceId As Guid,
	ignoreDeletedInstanceDefinitions As Boolean
) As InstanceDefinition
Parameters
instanceId
Type: System.Guid
Unique id of the instance definition to search for.
ignoreDeletedInstanceDefinitions
Type: System.Boolean
true means don't search deleted instance definitions.
Return Value
Type: InstanceDefinition
The specified instance definition, or null if nothing matching was found.
See Also
Reference
InstanceDefinitionTable Class
Find Overload
Rhino.DocObjects.Tables Namespace