RhinoCommon SDK
BendSpaceMorph Constructor
Rhino for Mac 5.1
Overload List
Name | Description
BendSpaceMorph(Point3d, Point3d, Point3d, Boolean, Boolean)
 Constructs a bend space morph.
BendSpaceMorph(Point3d, Point3d, Point3d, Double, Boolean, Boolean)
 Constructs a bend space morph.
Top
See Also
Reference
BendSpaceMorph Class
Rhino.Geometry.Morphs Namespace