RhinoCommon SDK
NurbsSurfaceKnotList.CreatePeriodicKnots Method
Rhino for Mac 5.1
 Compute a clamped, uniform, periodic knot vector based on the current degree and control point count. Does not change values of control vertices.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool CreatePeriodicKnots(
	double knotSpacing
)
Public Function CreatePeriodicKnots (
	knotSpacing As Double
) As Boolean
Parameters
knotSpacing
Type: System.Double
Spacing of subsequent knots.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace