RhinoCommon SDK
RhinoTransformObjectsEventArgs.Transform Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoTransformObjectsEventArgs.Transform"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform Transform { get; }
Public ReadOnly Property Transform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace