RhinoCommon SDK
NamedConstructionPlaneTable.Item Property
Rhino for Mac 5.1
 Conceptually, the named construction plane table is an array of ConstructionPlanes and their associated names. The operator[] can be used to get individual ConstructionPlanes.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ConstructionPlane this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As ConstructionPlane
	Get
Parameters
index
Type: System.Int32
Zero based array index.
Return Value
Type: ConstructionPlane
 A construction plane at the index, or null on error.
See Also
Reference
NamedConstructionPlaneTable Class
Rhino.DocObjects.Tables Namespace