RhinoCommon SDK
Matrix.IsRowOrthoNormal Property
Rhino for Mac 5.1
 Gets a value indicating whether the matrix is row orthonormal.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsRowOrthoNormal { get; }
Public ReadOnly Property IsRowOrthoNormal As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Matrix Class
Rhino.Geometry Namespace