RhinoCommon SDK
ViewportInfo.ScreenPortAspect Property
Rhino for Mac 5.1
 Gets the sceen aspect ratio.
This is width / height.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ScreenPortAspect { get; }
Public ReadOnly Property ScreenPortAspect As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace