RhinoCommon SDK
Point3d Constructor (Vector3d)
Rhino for Mac 5.1
 Initializes a new point by copying coordinates from the components of a vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d(
	Vector3d vector
)
Public Sub New (
	vector As Vector3d
)
Parameters
vector
Type: Rhino.Geometry.Vector3d
A vector.
See Also
Reference
Point3d Structure
Point3d Overload
Rhino.Geometry Namespace