RhinoCommon SDK
DisplayBitmap Methods
Rhino for Mac 5.1
The DisplayBitmap type exposes the following members.
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetBlendModes
 Gets the source and destination blend modes.
Load
 Load a DisplayBitmap from and image file on disk.
SetBlendFunction
 Sets blending function used to determine how this bitmap is blended with the current framebuffer color. The default setting is SourceAlpha for source and OneMinusSourceAlpha for destination. See OpenGL's glBlendFunc for details.
http://www.opengl.org/sdk/docs/man/xhtml/glBlendFunc.xml
Top
See Also
Reference
DisplayBitmap Class
Rhino.Display Namespace