RhinoCommon SDK
CustomUndoEventArgs Class
Rhino for Mac 5.1
 Argument package that is passed to a custom undo delegate
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Commands.CustomUndoEventArgs
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class CustomUndoEventArgs : EventArgs
Public Class CustomUndoEventArgs
	Inherits EventArgs
The CustomUndoEventArgs type exposes the following members.
Properties
Name | Description
ActionDescription
CommandId
CreatedByRedo
Document
Tag
UndoSerialNumber
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Commands Namespace