RhinoCommon SDK
BinaryArchiveWriter.WriteByte Method
Rhino for Mac 5.1
 Writes a Byte value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteByte(
	byte value
)
Public Sub WriteByte (
	value As Byte
)
Parameters
value
Type: System.Byte
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace