RhinoCommon SDK
BrepCurveList.Item Property
Rhino for Mac 5.1
 Gets the Curve at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As Curve
	Get
Parameters
index
Type: System.Int32
Index of Curve to access.
Return Value
Type: Curve
The Curve at [index].
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
See Also
Reference
BrepCurveList Class
Rhino.Geometry.Collections Namespace