RhinoCommon SDK
MostRecentCommandDescription Properties
Rhino for Mac 5.1
The MostRecentCommandDescription type exposes the following members.
Properties
Name | Description
DisplayString
Macro
Top
See Also
Reference
MostRecentCommandDescription Class
Rhino.Commands Namespace