RhinoCommon SDK
BitmapTable.AddBitmap Method
Rhino for Mac 5.1
Adds a new bitmap with specified name to the bitmap table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddBitmap(
	string bitmapFilename,
	bool replaceExisting
)
Public Function AddBitmap (
	bitmapFilename As String,
	replaceExisting As Boolean
) As Integer
Parameters
bitmapFilename
Type: System.String
 If NULL or empty, then a unique name of the form "Bitmap 01" will be automatically created.
replaceExisting
Type: System.Boolean
 If true and the there is alread a bitmap using the specified name, then that bitmap is replaced. If false and there is already a bitmap using the specified name, then -1 is returned.
Return Value
Type: Int32
 index of new bitmap in table on success. -1 on error.
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace