RhinoCommon SDK
MeshFaceNormalList.SetFaceNormal Method (Int32, Vector3d)
Rhino for Mac 5.1
 Sets a face normal vector at an index using a single-precision vector.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFaceNormal(
	int index,
	Vector3d normal
)
Public Function SetFaceNormal (
	index As Integer,
	normal As Vector3d
) As Boolean
Parameters
index
Type: System.Int32
An index.
normal
Type: Rhino.Geometry.Vector3d
A normal vector.
Return Value
Type: Boolean
true on success; false on error.
See Also
Reference
MeshFaceNormalList Class
SetFaceNormal Overload
Rhino.Geometry.Collections Namespace