RhinoCommon SDK
BrepFace.SetDomain Method
Rhino for Mac 5.1
 Sets the surface domain of this face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override bool SetDomain(
	int direction,
	Interval domain
)
Public Overrides Function SetDomain (
	direction As Integer,
	domain As Interval
) As Boolean
Parameters
direction
Type: System.Int32
Direction of face to set (0 = U, 1 = V).
domain
Type: Rhino.Geometry.Interval
Domain to apply.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace