RhinoCommon SDK
RhinoObjectSelectionEventArgs.Selected Property
Rhino for Mac 5.1
 Returns true if objects are being selected. Returns false if objects are being deseleced.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Selected { get; }
Public ReadOnly Property Selected As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoObjectSelectionEventArgs Class
Rhino.DocObjects Namespace