RhinoCommon SDK
StringTable.GetSectionNames Method
Rhino for Mac 5.1
 Returns a list of all the section names for user data strings in the document.
By default a section name is a key that is prefixed with a string separated by a backslash.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string[] GetSectionNames()
Public Function GetSectionNames As String()
Return Value
Type: String[]
An array of section names. This can be empty, but not null.
See Also
Reference
StringTable Class
Rhino.DocObjects.Tables Namespace