RhinoCommon SDK
CustomGripObject.Weight Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.CustomGripObject.Weight"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override double Weight { get; set; }
Public Overrides Property Weight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace