RhinoCommon SDK
Point2d.Add Method (Vector2d, Point2d)
Rhino for Mac 5.1
 Adds a vector with a point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point2d Add(
	Vector2d vector,
	Point2d point
)
Public Shared Function Add (
	vector As Vector2d,
	point As Point2d
) As Point2d
Parameters
vector
Type: Rhino.Geometry.Vector2d
A vector.
point
Type: Rhino.Geometry.Point2d
A point.
Return Value
Type: Point2d
A new point that is coordinatewise summed with the vector.
See Also
Reference
Point2d Structure
Add Overload
Rhino.Geometry Namespace