RhinoCommon SDK
Brep.CreateSolid Method
Rhino for Mac 5.1
 Constructs closed polysurfaces from surfaces and polysurfaces that bound a region in space.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep[] CreateSolid(
	IEnumerable<Brep> breps,
	double tolerance
)
Public Shared Function CreateSolid (
	breps As IEnumerable(Of Brep),
	tolerance As Double
) As Brep()
Parameters
breps
Type: System.Collections.Generic.IEnumerable<Brep>
 The intersecting surfaces and polysurfaces to automatically trim and join into closed polysurfaces.
tolerance
Type: System.Double
 The trim and join tolerance. If set to RhinoMath.UnsetValue, Rhino's global absolute tolerance is used.
Return Value
Type: Brep[]
The resulting polysurfaces on success or null on failure.
See Also
Reference
Brep Class
Rhino.Geometry Namespace