RhinoCommon SDK
GumballPickResult.Mode Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballPickResult.Mode"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GumballMode Mode { get; }
Public ReadOnly Property Mode As GumballMode
	Get
Property Value
Type: GumballMode
See Also
Reference
GumballPickResult Class
Rhino.UI.Gumball Namespace