RhinoCommon SDK
Extrusion.GetProfileTransformation Method
Rhino for Mac 5.1
 Gets the transformation that maps the xy profile curve to its 3d location.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform GetProfileTransformation(
	double s
)
Public Function GetProfileTransformation (
	s As Double
) As Transform
Parameters
s
Type: System.Double
 0.0 = starting profile 1.0 = ending profile.
Return Value
Type: Transform
A Transformation. The transform is Invalid on failure.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace