RhinoCommon SDK
PickContext.PickMode Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.PickContext.PickMode"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PickMode PickMode { get; set; }
Public Property PickMode As PickMode
	Get
	Set
Property Value
Type: PickMode
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace