RhinoCommon SDK
UserDictionary.Description Property
Rhino for Mac 5.1
 Gets the text "RhinoCommon UserDictionary".
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override string Description { get; }
Public Overrides ReadOnly Property Description As String
	Get
Property Value
Type: String
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace