RhinoCommon SDK
CustomPointObject Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.CustomPointObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.PointObject
 Rhino.DocObjects.Custom.CustomPointObject
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class CustomPointObject : PointObject,
	IDisposable
Public MustInherit Class CustomPointObject
	Inherits PointObject
	Implements IDisposable
The CustomPointObject type exposes the following members.
Constructors
Name | Description
CustomPointObject()
Initializes a new instance of the CustomPointObject class
CustomPointObject(Point)
Initializes a new instance of the CustomPointObject class
Top
Properties
Name | Description
Top
Methods
Name | Description
Dispose()
Releases all resources used by the CustomPointObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomPointObject and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace