RhinoCommon SDK
Transform.Multiply Operator (Transform, Point3d)
Rhino for Mac 5.1
 Multiplies a transformation by a point and gets a new point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d operator *(
	Transform m,
	Point3d p
)
Public Shared Operator * (
	m As Transform,
	p As Point3d
) As Point3d
Parameters
m
Type: Rhino.Geometry.Transform
A transformation.
p
Type: Rhino.Geometry.Point3d
A point.
Return Value
Type: Point3d
The tranformed point.
See Also
Reference
Transform Structure
Multiply Overload
Rhino.Geometry Namespace