RhinoCommon SDK
Curve.JoinCurves Method
Rhino for Mac 5.1
Overload List
Name | Description
JoinCurves(IEnumerable<Curve>)
 Joins a collection of curve segments together.
JoinCurves(IEnumerable<Curve>, Double)
 Joins a collection of curve segments together.
JoinCurves(IEnumerable<Curve>, Double, Boolean)
 Joins a collection of curve segments together.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace