RhinoCommon SDK
File3dmObjectTable.AddPolyline Method (IEnumerable<Point3d>)
Rhino for Mac 5.1
Adds a polyline object to Rhino.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddPolyline(
	IEnumerable<Point3d> points
)
Public Function AddPolyline (
	points As IEnumerable(Of Point3d)
) As Guid
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable set of Point3d.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddPolyline Overload
Rhino.FileIO Namespace