RhinoCommon SDK
GumballDisplayConduit.Gumball Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballDisplayConduit.Gumball"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GumballObject Gumball { get; }
Public ReadOnly Property Gumball As GumballObject
	Get
Property Value
Type: GumballObject
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace