RhinoCommon SDK
RhinoObject.OnTransform Method
Rhino for Mac 5.1
 Called when a transformation has been applied to the geometry
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnTransform(
	Transform transform
)
Protected Overridable Sub OnTransform (
	transform As Transform
)
Parameters
transform
Type: Rhino.Geometry.Transform
[Missing <param name="transform"/> documentation for "M:Rhino.DocObjects.RhinoObject.OnTransform(Rhino.Geometry.Transform)"]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace