RhinoCommon SDK
PageViewSpaceChangeEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.PageViewSpaceChangeEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.PageViewSpaceChangeEventArgs
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class PageViewSpaceChangeEventArgs : EventArgs
Public Class PageViewSpaceChangeEventArgs
	Inherits EventArgs
The PageViewSpaceChangeEventArgs type exposes the following members.
Properties
Name | Description
NewActiveDetailId
 The id of the detail object was set active. Note, if this id is equal to Guid.Empty, then the active detail object is the page view itself.
OldActiveDetailId
 The id of the previously active detail object. Note, if this id is equal to Guid.Empty, then the active detail object was the page view itself.
PageView
 The page view on which a different detail object was set active.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace