RhinoCommon SDK
Dialogs.ShowColorDialog Method
Rhino for Mac 5.1
Overload List
Name | Description
ShowColorDialog(Color)
 Display Rhino's color selection dialog.
ShowColorDialog(Color, Boolean, String)
 Display Rhino's color selection dialog.
Top
See Also
Reference
Dialogs Class
Rhino.UI Namespace