RhinoCommon SDK
ReplayHistoryResult.UpdateToRadialDimension Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToRadialDimension(
	RadialDimension dimension,
	ObjectAttributes attributes
)
Public Function UpdateToRadialDimension (
	dimension As RadialDimension,
	attributes As ObjectAttributes
) As Boolean
Parameters
dimension
Type: Rhino.Geometry.RadialDimension
[Missing <param name="dimension"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace