RhinoCommon SDK
Torus.MinorRadius Property
Rhino for Mac 5.1
 Gets or sets the radius of the torus section.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double MinorRadius { get; set; }
Public Property MinorRadius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Torus Structure
Rhino.Geometry Namespace