RhinoCommon SDK
Panels.PanelDockBar Method
Rhino for Mac 5.1
Overload List
Name | Description
PanelDockBar(Guid)
 Will always return Guid.Emty in Mac Rhino. In Windows Rhino it will look for the dock bar which contains the specified panel class Id and return the dock bar Id.
PanelDockBar(Type)
 Will always return Guid.Emty in Mac Rhino. In Windows Rhino it will look for the dock bar which contains the specified panel class Id and return the dock bar Id.
Top
See Also
Reference
Panels Class
Rhino.UI Namespace