RhinoCommon SDK
ViewportInfo.FrustumHeight Property
Rhino for Mac 5.1
 Gets the frustum height. This is FrustumTop - FrustumBottom.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double FrustumHeight { get; }
Public ReadOnly Property FrustumHeight As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace