RhinoCommon SDK
NurbsCurve.GrevillePoints Method
Rhino for Mac 5.1
 Gets all Greville (Edit) points for this curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3dList GrevillePoints()
Public Function GrevillePoints As Point3dList
Return Value
Type: Point3dList
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurve.GrevillePoints"]
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace