RhinoCommon SDK
MouseCallback.Enabled Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.MouseCallback.Enabled"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MouseCallback Class
Rhino.UI Namespace