RhinoCommon SDK
Curve.DoDirectionsMatch Method
Rhino for Mac 5.1
 Determines whether two curves travel more or less in the same direction.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool DoDirectionsMatch(
	Curve curveA,
	Curve curveB
)
Public Shared Function DoDirectionsMatch (
	curveA As Curve,
	curveB As Curve
) As Boolean
Parameters
curveA
Type: Rhino.Geometry.Curve
First curve to test.
curveB
Type: Rhino.Geometry.Curve
Second curve to test.
Return Value
Type: Boolean
true if both curves more or less point in the same direction, false if they point in the opposite directions.
See Also
Reference
Curve Class
Rhino.Geometry Namespace