RhinoCommon SDK
DisplayPipelineAttributes.ViewDisplayAttributes.VerticalViewportScale Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ViewDisplayAttributes.VerticalViewportScale"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double VerticalViewportScale { get; set; }
Public Property VerticalViewportScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DisplayPipelineAttributes.ViewDisplayAttributes Class
Rhino.Display Namespace