RhinoCommon SDK
DisplayPipeline.DrawingGrips Property
Rhino for Mac 5.1
 Gets a value that indicates whether the pipeline is currently in a grip drawing operation.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DrawingGrips { get; }
Public ReadOnly Property DrawingGrips As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace