RhinoCommon SDK
MaterialRefs.CopyTo Method
Rhino for Mac 5.1
 Copies the elements of this dictionary to an System.Array, starting at a particular System.Array index.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void CopyTo(
	KeyValuePair<Guid, MaterialRef>[] array,
	int arrayIndex
)
Public Sub CopyTo (
	array As KeyValuePair(Of Guid, MaterialRef)(),
	arrayIndex As Integer
)
Parameters
array
Type: System.Collections.Generic.KeyValuePair<Guid, MaterialRef>[]
 The one-dimensional System.Array that is the destination of the elements copied from this dictionary. The System.Array must have zero-based indexing.
arrayIndex
Type: System.Int32
 The zero-based index in array at which copying begins.
Implements
ICollection<T>.CopyTo(T[], Int32)
Exceptions
Exception | Condition
ArgumentNullException |  array is null
ArgumentOutOfRangeException |  arrayIndex is less than 0.
ArgumentOutOfRangeException |  The number of elements in the source dictionary is greater than the available space from arrayIndex to the end of the destination array.
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace