RhinoCommon SDK
Cone.BasePoint Property
Rhino for Mac 5.1
Center of base circle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d BasePoint { get; }
Public ReadOnly Property BasePoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Cone Structure
Rhino.Geometry Namespace