RhinoCommon SDK
Interop.ToOnXform Method
Rhino for Mac 5.1
 Constructs a Rhino_DotNet OnXform from a given RhinoCommon Transform.
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Object ToOnXform(
	Transform source
)
Public Shared Function ToOnXform (
	source As Transform
) As Object
Parameters
source
Type: Rhino.Geometry.Transform
A RhinoCommon source transform.
Return Value
Type: Object
 Rhino_DotNet object on success. This will be an independent copy.
See Also
Reference
Interop Class
Rhino.Runtime Namespace