RhinoCommon SDK
PolylineCurve Class
Rhino for Mac 5.1
 Represents the geometry of a set of linked line segments.
This is fundamentally a class that derives from Curve and internally contains a Polyline.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Curve
 Rhino.Geometry.PolylineCurve
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class PolylineCurve : Curve
<SerializableAttribute>
Public Class PolylineCurve
	Inherits Curve
The PolylineCurve type exposes the following members.
Constructors
Name | Description
PolylineCurve()
 Initializes a new empty polyline curve.
PolylineCurve(IEnumerable<Point3d>)
 Initializes a new polyline curve by copying its content from another set of points.
PolylineCurve(PolylineCurve)
 Initializes a new polyline curve by copying its content from another polyline curve.
PolylineCurve(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
PointCount
 Gets the number of points in this polyline.
Top
Methods
Name | Description
Point
 Gets a point at a specified index in the polyline curve.
SetPoint
 Sets a point at a specified index in the polyline curve.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The Nurbs Curves segments do not have fully multiple interior knots.
 3. Rational Nurbs curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent Colinear or Cocircular segments are combined.
Top
See Also
Reference
Rhino.Geometry Namespace