RhinoCommon SDK
ControlPoint.Location Property
Rhino for Mac 5.1
 Gets or sets the location of the control point. Internally, Rhino stores the location of a weighted control-point as a pre-multiplied coordinate, but RhinoCommon always provides Euclidean coordinates for control-points, regardless of weight.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d Location { get; set; }
Public Property Location As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace