RhinoCommon SDK
Surface.TryGetCylinder Method (Cylinder)
Rhino for Mac 5.1
Tests a surface to see if it is a portion of a cylinder within RhinoMath.ZeroTolerance and return the cylinder.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetCylinder(
	out Cylinder cylinder
)
Public Function TryGetCylinder (
	<OutAttribute> ByRef cylinder As Cylinder
) As Boolean
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
On success, the cylinder parameters are filled in.
Return Value
Type: Boolean
true if the surface is a portion of a cylinder.
See Also
Reference
Surface Class
TryGetCylinder Overload
Rhino.Geometry Namespace