RhinoCommon SDK
CustomPointObject Constructor
Rhino for Mac 5.1
Initializes a new instance of the CustomPointObject class
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected CustomPointObject()
Protected Sub New
See Also
Reference
CustomPointObject Class
CustomPointObject Overload
Rhino.DocObjects.Custom Namespace