RhinoCommon SDK
RhinoViewport.CameraTarget Property
Rhino for Mac 5.1
 Viewport target point.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d CameraTarget { get; }
Public ReadOnly Property CameraTarget As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace