RhinoCommon SDK
SurfaceObject Properties
Rhino for Mac 5.1
The SurfaceObject type exposes the following members.
Properties
Name | Description
SurfaceGeometry
 Gets the surface geometry linked with this object.
Top
See Also
Reference
SurfaceObject Class
Rhino.DocObjects Namespace