RhinoCommon SDK
Light Constructor
Rhino for Mac 5.1
 Initializes a new light.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Light()
Public Sub New
See Also
Reference
Light Class
Light Overload
Rhino.Geometry Namespace