RhinoCommon SDK
Surface.Transpose Method
Rhino for Mac 5.1
Overload List
Name | Description
Transpose()
 Transposes surface parameterization (swap U and V)
Transpose(Boolean)
 Transposes surface parameterization (swap U and V)
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace