RhinoCommon SDK
VisualAnalysisMode.SetUpDisplayAttributes Method
Rhino for Mac 5.1
 If an analysis mode needs to modify display attributes, this is the place to do it. In particular, Style==Texture, then this function must be overridden.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void SetUpDisplayAttributes(
	RhinoObject obj,
	DisplayPipelineAttributes attributes
)
Protected Overridable Sub SetUpDisplayAttributes (
	obj As RhinoObject,
	attributes As DisplayPipelineAttributes
)
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
The object for which to set up attributes.
attributes
Type: Rhino.Display.DisplayPipelineAttributes
The linked attributes.
Remarks
 Shaded analysis modes that use texture mapping, like zebra and emap, override this function set the tex, diffuse_color, and EnableLighting parameter.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace