RhinoCommon SDK
InstanceDefinitionTable.Modify Method (InstanceDefinition, String, String, Boolean)
Rhino for Mac 5.1
 Modifies the instance definition name and description. Does not change instance definition ID or geometry.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Modify(
	InstanceDefinition idef,
	string newName,
	string newDescription,
	bool quiet
)
Public Function Modify (
	idef As InstanceDefinition,
	newName As String,
	newDescription As String,
	quiet As Boolean
) As Boolean
Parameters
idef
Type: Rhino.DocObjects.InstanceDefinition
The instance definition to be modified.
newName
Type: System.String
The new name.
newDescription
Type: System.String
The new description string.
quiet
Type: System.Boolean
 If true, information message boxes pop up when illegal changes are attempted.
Return Value
Type: Boolean
 true if successful.
See Also
Reference
InstanceDefinitionTable Class
Modify Overload
Rhino.DocObjects.Tables Namespace