RhinoCommon SDK
GumballAppearanceSettings.MenuEnabled Property
Rhino for Mac 5.1
 When MenuEnabled is true, the menu "button" is drawn on the gumball. The default setting is true.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MenuEnabled { get; set; }
Public Property MenuEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace