RhinoCommon SDK
BinaryArchiveReader.AtEnd Method
Rhino for Mac 5.1
 true if at end of a file
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool AtEnd()
Public Function AtEnd As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveReader.AtEnd"]
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace