RhinoCommon SDK
TransformObjectList.Add Method (RhinoObject)
Rhino for Mac 5.1
 Add a RhinoObject to this list
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Add(
	RhinoObject rhinoObject
)
Public Sub Add (
	rhinoObject As RhinoObject
)
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhinoObject"/> documentation for "M:Rhino.Collections.TransformObjectList.Add(Rhino.DocObjects.RhinoObject)"]
See Also
Reference
TransformObjectList Class
Add Overload
Rhino.Collections Namespace