RhinoCommon SDK
RhinoViewport.GetCameraExtents Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.GetCameraExtents(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox GetCameraExtents(
	IEnumerable<Point3d> points
)
Public Function GetCameraExtents (
	points As IEnumerable(Of Point3d)
) As BoundingBox
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
[Missing <param name="points"/> documentation for "M:Rhino.Display.RhinoViewport.GetCameraExtents(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
Return Value
Type: BoundingBox
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.GetCameraExtents(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace