RhinoCommon SDK
CullObjectEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.CullObjectEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.DrawEventArgs
 Rhino.Display.CullObjectEventArgs
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class CullObjectEventArgs : DrawEventArgs
Public Class CullObjectEventArgs
	Inherits DrawEventArgs
The CullObjectEventArgs type exposes the following members.
Properties
Name | Description
CullObject
RhinoObject
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace