RhinoCommon SDK
Intersection.SphereSphere Method
Rhino for Mac 5.1
 Intersects two spheres using exact calculations.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static SphereSphereIntersection SphereSphere(
	Sphere sphereA,
	Sphere sphereB,
	out Circle intersectionCircle
)
Public Shared Function SphereSphere (
	sphereA As Sphere,
	sphereB As Sphere,
	<OutAttribute> ByRef intersectionCircle As Circle
) As SphereSphereIntersection
Parameters
sphereA
Type: Rhino.Geometry.Sphere
First sphere to intersect.
sphereB
Type: Rhino.Geometry.Sphere
Second sphere to intersect.
intersectionCircle
Type: Rhino.Geometry.Circle
 If intersection is a point, then that point will be the center, radius 0.
Return Value
Type: SphereSphereIntersection
 The intersection type.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace