RhinoCommon SDK
Mesh Properties
Rhino for Mac 5.1
The Mesh type exposes the following members.
Properties
Name | Description
DisjointMeshCount
 Gets the number of disjoint (topologically unconnected) pieces in this mesh.
FaceNormals
 Gets access to the face normal collection in this mesh.
Faces
 Gets access to the faces collection in this mesh.
HasCachedTextureCoordinates
 Will return true if SetCachedTextureCoordinates has been called; otherwise will return false.
IsClosed
 Gets a value indicating whether a mesh is considered to be closed (solid). A mesh is considered solid when every mesh edge borders two or more faces.
Normals
 Gets access to the vertex normal collection in this mesh.
PartitionCount
 Number of partition information chunks stored on this mesh based on the last call to CreatePartitions
TextureCoordinates
 Gets access to the vertex texture coordinate collection in this mesh.
TopologyEdges
 Gets the MeshTopologyEdgeList object associated with this mesh.
This object stores edge connectivity.
TopologyVertices
 Gets the MeshTopologyVertexList object associated with this mesh.
This object stores vertex connectivity and the indices of vertices that were unified while computing the edge topology.
VertexColors
 Gets access to the (optional) vertex color collection in this mesh.
Vertices
 Gets access to the vertices set of this mesh.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace