RhinoCommon SDK
HistoryRecord.SetColor Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetColor(System.Int32,System.Drawing.Color)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetColor(
	int id,
	Color value
)
Public Function SetColor (
	id As Integer,
	value As Color
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetColor(System.Int32,System.Drawing.Color)"]
value
Type: System.Drawing.Color
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetColor(System.Int32,System.Drawing.Color)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetColor(System.Int32,System.Drawing.Color)"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace