RhinoCommon SDK
LineCylinderIntersection Enumeration
Rhino for Mac 5.1
 Represents all possible cases of a Line|Cylinder intersection event.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum LineCylinderIntersection
Public Enumeration LineCylinderIntersection
Members
Member name | Value | Description
None | 0 |  No intersections.
Single | 1 |  One intersection.
Multiple | 2 |  Two intersections.
Overlap | 3 |  Line lies on cylinder.
See Also
Reference
Rhino.Geometry.Intersect Namespace