RhinoCommon SDK
Rectangle3d.Contains Method (Point3d)
Rhino for Mac 5.1
 Determines if a point is included in this rectangle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PointContainment Contains(
	Point3d pt
)
Public Function Contains (
	pt As Point3d
) As PointContainment
Parameters
pt
Type: Rhino.Geometry.Point3d
Point to test. The point will be projected onto the Rectangle plane before inclusion is determined.
Return Value
Type: PointContainment
Point Rectangle relationship.
See Also
Reference
Rectangle3d Structure
Contains Overload
Rhino.Geometry Namespace