RhinoCommon SDK
DimStyleTable.Document Property
Rhino for Mac 5.1
Document that owns this dimstyle table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace