RhinoCommon SDK
NurbsSurface.MakeNonRational Method
Rhino for Mac 5.1
 Makes this surface non-rational.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MakeNonRational()
Public Function MakeNonRational As Boolean
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace