RhinoCommon SDK
ObjectTable.Duplicate Method (RhinoObject)
Rhino for Mac 5.1
 Duplicates the object that is referenced by obj.
Same as TransformObject(obj, Transform.Identityy, false)
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Duplicate(
	RhinoObject obj
)
Public Function Duplicate (
	obj As RhinoObject
) As Guid
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
A Rhino object to duplicate.
Return Value
Type: Guid
The new object ID.
See Also
Reference
ObjectTable Class
Duplicate Overload
Rhino.DocObjects.Tables Namespace