RhinoCommon SDK
ObjectTable.Duplicate Method (Guid)
Rhino for Mac 5.1
 Same as TransformObject(objref, ON_Xform.Identity, false)
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Duplicate(
	Guid objectId
)
Public Function Duplicate (
	objectId As Guid
) As Guid
Parameters
objectId
Type: System.Guid
An ID to an object in the document that needs to be duplicated.
Return Value
Type: Guid
The new object ID.
See Also
Reference
ObjectTable Class
Duplicate Overload
Rhino.DocObjects.Tables Namespace