RhinoCommon SDK
Plane.Equals Method (Plane)
Rhino for Mac 5.1
 Determines if another plane has the same components as this plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Equals(
	Plane plane
)
Public Function Equals (
	plane As Plane
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
A plane.
Return Value
Type: Boolean
true if plane has the same components as this plane; false otherwise.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Plane Structure
Equals Overload
Rhino.Geometry Namespace