RhinoCommon SDK
GetBaseClass.Vector Method
Rhino for Mac 5.1
 Gets a direction if Get*() returns GetResult.Point (Set by some digitizers, but in general it's (0,0,0).
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d Vector()
Public Function Vector As Vector3d
Return Value
Type: Vector3d
The vector chosen by the user.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace