RhinoCommon SDK
Vector3f Constructor
Rhino for Mac 5.1
 Constructs a new vector from 3 single precision numbers.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3f(
	float x,
	float y,
	float z
)
Public Sub New (
	x As Single,
	y As Single,
	z As Single
)
Parameters
x
Type: System.Single
X component of vector.
y
Type: System.Single
Y component of vector.
z
Type: System.Single
Z component of vector.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace