RhinoCommon SDK
Vector3d Constructor (Point3d)
Rhino for Mac 5.1
 Initializes a new instance of a vector, copying the three components from the three coordinates of a point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d(
	Point3d point
)
Public Sub New (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
The point to copy from.
See Also
Reference
Vector3d Structure
Vector3d Overload
Rhino.Geometry Namespace