RhinoCommon SDK
PageViewSpaceChangeEventArgs.NewActiveDetailId Property
Rhino for Mac 5.1
 The id of the detail object was set active. Note, if this id is equal to Guid.Empty, then the active detail object is the page view itself.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid NewActiveDetailId { get; }
Public ReadOnly Property NewActiveDetailId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PageViewSpaceChangeEventArgs Class
Rhino.Display Namespace