RhinoCommon SDK
RhinoObject.OnDuplicate Method
Rhino for Mac 5.1
 Called when this a new instance of this object is created and copied from an existing object
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnDuplicate(
	RhinoObject source
)
Protected Overridable Sub OnDuplicate (
	source As RhinoObject
)
Parameters
source
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="source"/> documentation for "M:Rhino.DocObjects.RhinoObject.OnDuplicate(Rhino.DocObjects.RhinoObject)"]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace