RhinoCommon SDK
UserData.Description Property
Rhino for Mac 5.1
Descriptive name of the user data.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual string Description { get; }
Public Overridable ReadOnly Property Description As String
	Get
Property Value
Type: String
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace