RhinoCommon SDK
GroupTable.Add Method (String)
Rhino for Mac 5.1
Adds a new empty group to the group table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	string groupName
)
Public Function Add (
	groupName As String
) As Integer
Parameters
groupName
Type: System.String
name of new group.
Return Value
Type: Int32
 >=0 index of new group. -1 group not added because a group with that name already exists.
Remarks
 In some cases, calling Add() can cause the group indices to become invalid.
See Also
Reference
GroupTable Class
Add Overload
Rhino.DocObjects.Tables Namespace