RhinoCommon SDK
CurveObject.DuplicateCurveGeometry Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.CurveObject.DuplicateCurveGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve DuplicateCurveGeometry()
Public Function DuplicateCurveGeometry As Curve
Return Value
Type: Curve
[Missing <returns> documentation for "M:Rhino.DocObjects.CurveObject.DuplicateCurveGeometry"]
See Also
Reference
CurveObject Class
Rhino.DocObjects Namespace