RhinoCommon SDK
ColorLCH.CreateFromXYZ Method
Rhino for Mac 5.1
 Create the nearest LCH equivalent of an XYZ color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorLCH CreateFromXYZ(
	ColorXYZ xyz
)
Public Shared Function CreateFromXYZ (
	xyz As ColorXYZ
) As ColorLCH
Parameters
xyz
Type: Rhino.Display.ColorXYZ
Target color in XYZ space.
Return Value
Type: ColorLCH
The LCH equivalent of the XYZ color.
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace