RhinoCommon SDK
Command Constructor
Rhino for Mac 5.1
 Default protected constructor. It only allows instantiation through subclassing.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected Command()
Protected Sub New
See Also
Reference
Command Class
Rhino.Commands Namespace