RhinoCommon SDK
PointObject.PointGeometry Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.PointObject.PointGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point PointGeometry { get; }
Public ReadOnly Property PointGeometry As Point
	Get
Property Value
Type: Point
See Also
Reference
PointObject Class
Rhino.DocObjects Namespace