RhinoCommon SDK
RhinoView.ClientToScreen Method (Point)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.RhinoView.ClientToScreen(System.Drawing.Point)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point ClientToScreen(
	Point clientPoint
)
Public Function ClientToScreen (
	clientPoint As Point
) As Point
Parameters
clientPoint
Type: System.Drawing.Point
[Missing <param name="clientPoint"/> documentation for "M:Rhino.Display.RhinoView.ClientToScreen(System.Drawing.Point)"]
Return Value
Type: Point
[Missing <returns> documentation for "M:Rhino.Display.RhinoView.ClientToScreen(System.Drawing.Point)"]
See Also
Reference
RhinoView Class
ClientToScreen Overload
Rhino.Display Namespace