RhinoCommon SDK
SimpleArrayLine Class
Rhino for Mac 5.1
 Wrapper for ON_SimpleArray<ON_Line>. If you are not writing C++ code then this class is not for you.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.SimpleArrayLine
Namespace: Rhino.Runtime.InteropWrappers
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class SimpleArrayLine : IDisposable
Public Class SimpleArrayLine
	Implements IDisposable
The SimpleArrayLine type exposes the following members.
Constructors
Name | Description
SimpleArrayLine
 Initializes a new SimpleArrayLine instance.
Top
Properties
Name | Description
Count
 Gets the amount of lines in this array.
Top
Methods
Name | Description
ConstPointer
 Gets the const (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
NonConstPointer
 Gets the non-const pointer (for modification) of this array.
ToArray
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace