RhinoCommon SDK
ViewportInfo.ChangeToParallelProjection Method
Rhino for Mac 5.1
 Use this function to change projections of valid viewports from parallel to perspective. It will make common additional adjustments to the frustum and camera location so the resulting views are similar. The camera direction and target point are not be changed. If the current projection is parallel and symmetricFrustum, FrustumIsLeftRightSymmetric() and FrustumIsTopBottomSymmetric() are all equal, then no changes are made and true is returned.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ChangeToParallelProjection(
	bool symmetricFrustum
)
Public Function ChangeToParallelProjection (
	symmetricFrustum As Boolean
) As Boolean
Parameters
symmetricFrustum
Type: System.Boolean
true if you want the resulting frustum to be symmetric.
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace