RhinoCommon SDK
Vector3f.Multiply Operator (Vector3f, Single)
Rhino for Mac 5.1
 Multiplies a vector by a number, having the effect of scaling it.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Vector3f operator *(
	Vector3f vector,
	float t
)
Public Shared Operator * (
	vector As Vector3f,
	t As Single
) As Vector3f
Parameters
vector
Type: Rhino.Geometry.Vector3f
A vector.
t
Type: System.Single
A number.
Return Value
Type: Vector3f
A new vector that is the original vector coordinatewise multiplied by t.
See Also
Reference
Vector3f Structure
Multiply Overload
Rhino.Geometry Namespace