RhinoCommon SDK
Vector3f.Multiply Operator (Single, Vector3f)
Rhino for Mac 5.1
 Multiplies a vector by a number, having the effect of scaling it.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Vector3f operator *(
	float t,
	Vector3f vector
)
Public Shared Operator * (
	t As Single,
	vector As Vector3f
) As Vector3f
Parameters
t
Type: System.Single
A number.
vector
Type: Rhino.Geometry.Vector3f
A vector.
Return Value
Type: Vector3f
A new vector that is the original vector coordinatewise multiplied by t.
See Also
Reference
Vector3f Structure
Multiply Overload
Rhino.Geometry Namespace