RhinoCommon SDK
RhinoViewport.ClientToWorld Method (Point)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.ClientToWorld(System.Drawing.Point)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line ClientToWorld(
	Point clientPoint
)
Public Function ClientToWorld (
	clientPoint As Point
) As Line
Parameters
clientPoint
Type: System.Drawing.Point
[Missing <param name="clientPoint"/> documentation for "M:Rhino.Display.RhinoViewport.ClientToWorld(System.Drawing.Point)"]
Return Value
Type: Line
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.ClientToWorld(System.Drawing.Point)"]
See Also
Reference
RhinoViewport Class
ClientToWorld Overload
Rhino.Display Namespace