RhinoCommon SDK
CustomGripObject.NewLocation Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.CustomGripObject.NewLocation"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual void NewLocation()
Public Overridable Sub NewLocation
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace