RhinoCommon SDK
Font.Bold Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Bold"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Bold { get; }
Public ReadOnly Property Bold As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Font Class
Rhino.DocObjects Namespace