RhinoCommon SDK
Mesh.ClosestPoint Method
Rhino for Mac 5.1
Overload List
Name | Description
ClosestPoint(Point3d)
 Gets the point on the mesh that is closest to a given test point.
ClosestPoint(Point3d, Point3d, Double)
 Gets the point on the mesh that is closest to a given test point.
ClosestPoint(Point3d, Point3d, Vector3d, Double)
 Gets the point on the mesh that is closest to a given test point.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace