RhinoCommon SDK
TransformCommand Constructor
Rhino for Mac 5.1
Initializes a new instance of the TransformCommand class
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected TransformCommand()
Protected Sub New
See Also
Reference
TransformCommand Class
Rhino.Commands Namespace