RhinoCommon SDK
RhinoObject.GripsSelected Property
Rhino for Mac 5.1
 true if grips are turned on and at least one is selected.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GripsSelected { get; }
Public ReadOnly Property GripsSelected As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace