RhinoCommon SDK
RhinoViewport.Bounds Property
Rhino for Mac 5.1
 Gets the size and location of the viewport, in pixels, relative to the parent view.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Rectangle Bounds { get; }
Public ReadOnly Property Bounds As Rectangle
	Get
Property Value
Type: Rectangle
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace