RhinoCommon SDK
ObjectAttributes.IsInstanceDefinitionObject Property
Rhino for Mac 5.1
 Use this query to determine if an object is part of an instance definition.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsInstanceDefinitionObject { get; }
Public ReadOnly Property IsInstanceDefinitionObject As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace