RhinoCommon SDK
Continuity Enumeration
Rhino for Mac 5.1
 Provides enumerated values for continuity along geometry, such as continuous first derivative or continuous unit tangent and curvature.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum Continuity
Public Enumeration Continuity
Members
Member name | Value | Description
None | 0 |  There is no continuity.
C0_continuous | 1 |  Continuous Function : Test for parametric continuity. In particular, all types of curves are considered infinitely continuous at the start/end of the evaluation domain.
C1_continuous | 2 |  Continuous first derivative : Test for parametric continuity. In particular, all types of curves are considered infinitely continuous at the start/end of the evaluation domain.
C2_continuous | 3 |  Continuous first derivative and second derivative : Test for parametric continuity. In particular, all types of curves are considered infinitely continuous at the start/end of the evaluation domain.
G1_continuous | 4 |  Continuous unit tangent : Test for parametric continuity. In particular, all types of curves are considered infinitely continuous at the start/end of the evaluation domain.
G2_continuous | 5 |  Continuous unit tangent and curvature : Test for parametric continuity. In particular, all types of curves are considered infinitely continuous at the start/end of the evaluation domain.
C0_locus_continuous | 6 |  Locus continuous function : Continuity tests using the following enum values are identical to tests using the preceding enum values on the INTERIOR of a curve's domain. At the END of a curve a "locus" test is performed in place of a parametric test. In particular, at the END of a domain, all open curves are locus discontinuous. At the END of a domain, all closed curves are at least C0_locus_continuous. By convention all Curves are considered locus continuous at the START of the evaluation domain. This convention is not strictly correct, but it was adopted to make iterative kink finding tools easier to use and so that locus discontinuities are reported once at the end parameter of a curve rather than twice.
C1_locus_continuous | 7 |  Locus continuous first derivative : Continuity tests using the following enum values are identical to tests using the preceding enum values on the INTERIOR of a curve's domain. At the END of a curve a "locus" test is performed in place of a parametric test. In particular, at the END of a domain, all open curves are locus discontinuous. At the END of a domain, all closed curves are at least C0_locus_continuous. By convention all Curves are considered locus continuous at the START of the evaluation domain. This convention is not strictly correct, but it was adopted to make iterative kink finding tools easier to use and so that locus discontinuities are reported once at the end parameter of a curve rather than twice.
C2_locus_continuous | 8 |  Locus continuous first and second derivative : Continuity tests using the following enum values are identical to tests using the preceding enum values on the INTERIOR of a curve's domain. At the END of a curve a "locus" test is performed in place of a parametric test. In particular, at the END of a domain, all open curves are locus discontinuous. At the END of a domain, all closed curves are at least C0_locus_continuous. By convention all Curves are considered locus continuous at the START of the evaluation domain. This convention is not strictly correct, but it was adopted to make iterative kink finding tools easier to use and so that locus discontinuities are reported once at the end parameter of a curve rather than twice.
G1_locus_continuous | 9 |  Locus continuous unit tangent : Continuity tests using the following enum values are identical to tests using the preceding enum values on the INTERIOR of a curve's domain. At the END of a curve a "locus" test is performed in place of a parametric test. In particular, at the END of a domain, all open curves are locus discontinuous. At the END of a domain, all closed curves are at least C0_locus_continuous. By convention all Curves are considered locus continuous at the START of the evaluation domain. This convention is not strictly correct, but it was adopted to make iterative kink finding tools easier to use and so that locus discontinuities are reported once at the end parameter of a curve rather than twice.
G2_locus_continuous | 10 |  Locus continuous unit tangent and curvature : Continuity tests using the following enum values are identical to tests using the preceding enum values on the INTERIOR of a curve's domain. At the END of a curve a "locus" test is performed in place of a parametric test. In particular, at the END of a domain, all open curves are locus discontinuous. At the END of a domain, all closed curves are at least C0_locus_continuous. By convention all Curves are considered locus continuous at the START of the evaluation domain. This convention is not strictly correct, but it was adopted to make iterative kink finding tools easier to use and so that locus discontinuities are reported once at the end parameter of a curve rather than twice.
Cinfinity_continuous | 11 |  Analytic discontinuity.
See Also
Reference
Rhino.Geometry Namespace