RhinoCommon SDK
NamedViewTable.Delete Method
Rhino for Mac 5.1
Overload List
Name | Description
Delete(Int32)
Remove named view from the document.
Delete(String)
Remove named view from the document.
Top
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace