RhinoCommon SDK
Point2d Constructor (Vector2d)
Rhino for Mac 5.1
 Initializes a new instance of Point2d by converting a vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2d(
	Vector2d vector
)
Public Sub New (
	vector As Vector2d
)
Parameters
vector
Type: Rhino.Geometry.Vector2d
The vector that will be copied.
See Also
Reference
Point2d Structure
Point2d Overload
Rhino.Geometry Namespace