RhinoCommon SDK
SurfaceProxy Class
Rhino for Mac 5.1
 Provides a base class to brep faces and other surface proxies.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.SurfaceProxy
 Rhino.Geometry.BrepFace
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class SurfaceProxy : Surface
Public Class SurfaceProxy
	Inherits Surface
The SurfaceProxy type exposes the following members.
Constructors
Name | Description
SurfaceProxy
 Protected constructor for internal use.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace