RhinoCommon SDK
Point3d Constructor (Point4d)
Rhino for Mac 5.1
 Initializes a new point by copying coordinates from a four-dimensional point. The first three coordinates are divided by the last one. If the W (fourth) dimension of the input point is zero, then it will be just discarded.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d(
	Point4d point
)
Public Sub New (
	point As Point4d
)
Parameters
point
Type: Rhino.Geometry.Point4d
A point.
See Also
Reference
Point3d Structure
Point3d Overload
Rhino.Geometry Namespace