RhinoCommon SDK
CurveIntersections.Count Property
Rhino for Mac 5.1
 Gets the number of recorded intersection events.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
CurveIntersections Class
Rhino.Geometry.Intersect Namespace