RhinoCommon SDK
ViewTable.AddPageView Method (String)
Rhino for Mac 5.1
 Constructs a new page view with a given title and, at the same time, adds it to the list.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoPageView AddPageView(
	string title
)
Public Function AddPageView (
	title As String
) As RhinoPageView
Parameters
title
Type: System.String
 If null or empty, a name will be generated as "Page #" where # is the largest page number.
Return Value
Type: RhinoPageView
The newly created page view on success; or null on error.
See Also
Reference
ViewTable Class
AddPageView Overload
Rhino.DocObjects.Tables Namespace