RhinoCommon SDK
DimStyleTable Properties
Rhino for Mac 5.1
The DimStyleTable type exposes the following members.
Properties
Name | Description
Count
Number of dimstyles in the table.
CurrentDimensionStyle
CurrentDimensionStyleIndex
Document
Document that owns this dimstyle table.
Item
Top
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace