RhinoCommon SDK
Line.IsValid Property
Rhino for Mac 5.1
 Gets a value indicating whether or not this line is valid. Valid lines must have valid start and end points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Line Structure
Rhino.Geometry Namespace