RhinoCommon SDK
CullObjectEventArgs Properties
Rhino for Mac 5.1
The CullObjectEventArgs type exposes the following members.
Properties
Name | Description
CullObject
RhinoObject
Top
See Also
Reference
CullObjectEventArgs Class
Rhino.Display Namespace