RhinoCommon SDK
Quaternion.IsZero Property
Rhino for Mac 5.1
 true if a, b, c, and d are all zero.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsZero { get; }
Public ReadOnly Property IsZero As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace