RhinoCommon SDK
BinaryArchiveWriter.WriteColor Method
Rhino for Mac 5.1
 Writes a Color value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteColor(
	Color value
)
Public Sub WriteColor (
	value As Color
)
Parameters
value
Type: System.Drawing.Color
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace