RhinoCommon SDK
GetLine.AcceptZeroLengthLine Property
Rhino for Mac 5.1
 Controls whether or not a zero length line is acceptable. The default is to require the user to keep picking the end point until we get a point different than the start point.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool AcceptZeroLengthLine { get; set; }
Public Property AcceptZeroLengthLine As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace