RhinoCommon SDK
Unroller.AbsoluteTolerance Property
Rhino for Mac 5.1
 Gets or sets the absolute tolerance for the unrolling operation.
Absolute tolerance is used in the evaluation of new entities, such as intersections, reprojections and splits.
In the current implementation, absolute tolerance is used in tessellating rails, fitting curves and pulling back trims.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double AbsoluteTolerance { get; set; }
Public Property AbsoluteTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Unroller Class
Rhino.Geometry Namespace