RhinoCommon SDK
DisplayModeDescription.FindByName Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayModeDescription.FindByName(System.String)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static DisplayModeDescription FindByName(
	string englishName
)
Public Shared Function FindByName (
	englishName As String
) As DisplayModeDescription
Parameters
englishName
Type: System.String
[Missing <param name="englishName"/> documentation for "M:Rhino.Display.DisplayModeDescription.FindByName(System.String)"]
Return Value
Type: DisplayModeDescription
[Missing <returns> documentation for "M:Rhino.Display.DisplayModeDescription.FindByName(System.String)"]
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace