RhinoCommon SDK
Curve.NormalizedLengthParameters Method (Double[], Double, Double)
Rhino for Mac 5.1
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double[] NormalizedLengthParameters(
	double[] s,
	double absoluteTolerance,
	double fractionalTolerance
)
Public Function NormalizedLengthParameters (
	s As Double(),
	absoluteTolerance As Double,
	fractionalTolerance As Double
) As Double()
Parameters
s
Type: System.Double[]
 Array of normalized arc length parameters. E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
absoluteTolerance
Type: System.Double
 If absoluteTolerance > 0, then the difference between (s[i+1]-s[i])*curve_length and the length of the curve segment from t[i] to t[i+1] will be <= absoluteTolerance.
fractionalTolerance
Type: System.Double
 Desired fractional precision for each segment. fabs("true" length - actual length)/(actual length) <= fractionalTolerance.
Return Value
Type: Double[]
 If successful, array of curve parameters such that the length of the curve from its start to t[i] is s[i]*curve_length. Null on failure.
See Also
Reference
Curve Class
NormalizedLengthParameters Overload
Rhino.Geometry Namespace