RhinoCommon SDK
Curve.NormalizedLengthParameters Method (Double[], Double, Interval)
Rhino for Mac 5.1
 Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve. A fractional tolerance of 1e-8 is used in this version of the function.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double[] NormalizedLengthParameters(
	double[] s,
	double absoluteTolerance,
	Interval subdomain
)
Public Function NormalizedLengthParameters (
	s As Double(),
	absoluteTolerance As Double,
	subdomain As Interval
) As Double()
Parameters
s
Type: System.Double[]
 Array of normalized arc length parameters. E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
absoluteTolerance
Type: System.Double
 If absoluteTolerance > 0, then the difference between (s[i+1]-s[i])*curve_length and the length of the curve segment from t[i] to t[i+1] will be <= absoluteTolerance.
subdomain
Type: Rhino.Geometry.Interval
 The calculation is performed on the specified sub-domain of the curve. A 0.0 s value corresponds to subdomain->Min() and a 1.0 s value corresponds to subdomain->Max().
Return Value
Type: Double[]
 If successful, array of curve parameters such that the length of the curve from its start to t[i] is s[i]*curve_length. Null on failure.
See Also
Reference
Curve Class
NormalizedLengthParameters Overload
Rhino.Geometry Namespace