RhinoCommon SDK
Point2f Structure
Rhino for Mac 5.1
 Represents the two coordinates of a point in two-dimensional space, using Single-precision floating point numbers.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct Point2f : IEquatable<Point2f>,
	IComparable<Point2f>, IComparable, IEpsilonFComparable<Point2f>
<SerializableAttribute>
Public Structure Point2f
	Implements IEquatable(Of Point2f), IComparable(Of Point2f),
	IComparable, IEpsilonFComparable(Of Point2f)
The Point2f type exposes the following members.
Constructors
Name | Description
Point2f(Double, Double)
 Initializes a new two-dimensional point from two double-precision floating point numbers as coordinates.
Coordinates will be internally converted to floating point numbers. This might cause precision loss.
Point2f(Single, Single)
 Initializes a new two-dimensional point from two components.
Top
Properties
Name | Description
IsValid
 Gets a value indicating whether this point is considered valid.
Unset
 Gets the standard unset point.
X
 Gets or sets the X (first) component of the vector.
Y
 Gets or sets the Y (second) component of the vector.
Top
Methods
Name | Description
CompareTo
 Compares this Point2f with another Point2f.
Coordinates evaluation priority is first X, then Y.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Point2f and has the same values as the present point.
 (Overrides ValueType.Equals(Object).)
Equals(Point2f)
 Determines whether the specified Point2f has the same values as the present point.
GetHashCode
 Computes a hash number that represents the current point.
 (Overrides ValueType.GetHashCode().)
ToString
 Constructs the string representation for the current point.
 (Overrides ValueType.ToString().)
Top
Operators
Name | Description
Equality
 Determines whether two Point2f have equal values.
GreaterThan
 Determines whether the first specified Point2f comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
GreaterThanOrEqual
 Determines whether the first specified Point2f comes after (has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
Inequality
 Determines whether two Point2f have different values.
LessThan
 Determines whether the first specified Point2f comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
LessThanOrEqual
 Determines whether the first specified Point2f comes before (has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
Top
See Also
Reference
Rhino.Geometry Namespace