RhinoCommon SDK
Mesh.TopologyVertices Property
Rhino for Mac 5.1
 Gets the MeshTopologyVertexList object associated with this mesh.
This object stores vertex connectivity and the indices of vertices that were unified while computing the edge topology.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MeshTopologyVertexList TopologyVertices { get; }
Public ReadOnly Property TopologyVertices As MeshTopologyVertexList
	Get
Property Value
Type: MeshTopologyVertexList
See Also
Reference
Mesh Class
Rhino.Geometry Namespace