RhinoCommon SDK
Extrusion.PathTangent Property
Rhino for Mac 5.1
 Gets the up vector of the path.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d PathTangent { get; }
Public ReadOnly Property PathTangent As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace