RhinoCommon SDK
BinaryArchiveWriter.WriteUShort Method
Rhino for Mac 5.1
 Writes a UInt16 value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteUShort(
	ushort value
)
Public Sub WriteUShort (
	value As UShort
)
Parameters
value
Type: System.UInt16
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace