RhinoCommon SDK
GetBaseClass.AddOptionColor Method (String, OptionColor, String)
Rhino for Mac 5.1
 Add a command line option to get colors and automatically save the value.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddOptionColor(
	string englishName,
	ref OptionColor colorValue,
	string prompt
)
Public Function AddOptionColor (
	englishName As String,
	ByRef colorValue As OptionColor,
	prompt As String
) As Integer
Parameters
englishName
Type: System.String
option description
colorValue
Type: Rhino.Input.Custom.OptionColor
The current color value.
prompt
Type: System.String
The command prompt will show this during picking.
Return Value
Type: Int32
option index value (>0) or 0 if option cannot be added.
See Also
Reference
GetBaseClass Class
AddOptionColor Overload
Rhino.Input.Custom Namespace