RhinoCommon SDK
MeshFaceList.SetFace Method (Int32, MeshFace)
Rhino for Mac 5.1
 Sets a face at a specific index of the mesh.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFace(
	int index,
	MeshFace face
)
Public Function SetFace (
	index As Integer,
	face As MeshFace
) As Boolean
Parameters
index
Type: System.Int32
A position in the list.
face
Type: Rhino.Geometry.MeshFace
A face.
Return Value
Type: Boolean
true if the operation succeeded, otherwise false.
See Also
Reference
MeshFaceList Class
SetFace Overload
Rhino.Geometry.Collections Namespace