RhinoCommon SDK
GetPoint.OnMouseDown Method
Rhino for Mac 5.1
Default calls the MouseDown event.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnMouseDown(
	GetPointMouseEventArgs e
)
Protected Overridable Sub OnMouseDown (
	e As GetPointMouseEventArgs
)
Parameters
e
Type: Rhino.Input.Custom.GetPointMouseEventArgs
Current argument for the event.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace