RhinoCommon SDK
RadialDimension Class
Rhino for Mac 5.1
 Represents a dimension of a circular entity that can be measured with radius or diameter.
This entity refers to the geometric element that is independent from the document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.RadialDimension
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class RadialDimension : AnnotationBase
<SerializableAttribute>
Public Class RadialDimension
	Inherits AnnotationBase
The RadialDimension type exposes the following members.
Constructors
Name | Description
RadialDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
RadialDimension(Circle, Point3d, Double)
 Construct a radial dimension from 3d input
RadialDimension(Point3d, Point3d, Vector3d, Vector3d, Double)
 Construct a radial dimension from 3d input
Top
Properties
Name | Description
IsDiameterDimension
 Gets a value indicating whether the value refers to the diameter, rather than the radius.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace