RhinoCommon SDK
Polyline.CenterPoint Method
Rhino for Mac 5.1
 Compute the center point of the polyline as the weighted average of all segments.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d CenterPoint()
Public Function CenterPoint As Point3d
Return Value
Type: Point3d
The weighted average of all segments.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace