RhinoCommon SDK
CustomGripObject.OriginalLocation Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.CustomGripObject.OriginalLocation"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d OriginalLocation { get; set; }
Public Property OriginalLocation As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace