RhinoCommon SDK
GumballMode Enumeration
Rhino for Mac 5.1
 Transformation modes for gumballs.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum GumballMode
Public Enumeration GumballMode
Members
Member name | Value | Description
None | 0
Menu | 1 | gumball menu button was picked.
TranslateFree | 2 | Unconstrained translation.
TranslateX | 3 | Translation along a single axis.
TranslateY | 4 | Translation along a single axis.
TranslateZ | 5 | Translation along a single axis.
TranslateXY | 6 | Translation in a plane.
TranslateYZ | 7 | Translation in a plane.
TranslateZX | 8 | Translation in a plane.
ScaleX | 9 |  GumballFrame.ScaleMode is used to enable multi-axis scaling. This indicates which control is being dragged.
ScaleY | 10 |  GumballFrame.ScaleMode is used to enable multi-axis scaling. This indicates which control is being dragged.
ScaleZ | 11 |  GumballFrame.ScaleMode is used to enable multi-axis scaling. This indicates which control is being dragged.
RotateX | 12
RotateY | 13
RotateZ | 14
See Also
Reference
Rhino.UI.Gumball Namespace