RhinoCommon SDK
DisplayPipeline.DrawParticles Method (ParticleSystem)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawParticles(Rhino.Geometry.ParticleSystem)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawParticles(
	ParticleSystem particles
)
Public Sub DrawParticles (
	particles As ParticleSystem
)
Parameters
particles
Type: Rhino.Geometry.ParticleSystem
[Missing <param name="particles"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawParticles(Rhino.Geometry.ParticleSystem)"]
See Also
Reference
DisplayPipeline Class
DrawParticles Overload
Rhino.Display Namespace