RhinoCommon SDK
LightTableEventArgs.NewState Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.LightTableEventArgs.NewState"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public LightObject NewState { get; }
Public ReadOnly Property NewState As LightObject
	Get
Property Value
Type: LightObject
See Also
Reference
LightTableEventArgs Class
Rhino.DocObjects.Tables Namespace