RhinoCommon SDK
File3dmObjectTable.AddExtrusion Method (Extrusion)
Rhino for Mac 5.1
Adds an extrusion object to Rhino.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddExtrusion(
	Extrusion extrusion
)
Public Function AddExtrusion (
	extrusion As Extrusion
) As Guid
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
A duplicate of this extrusion is added to Rhino.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddExtrusion Overload
Rhino.FileIO Namespace