RhinoCommon SDK
Mesh.ClosestPoint Method (Point3d)
Rhino for Mac 5.1
 Gets the point on the mesh that is closest to a given test point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d ClosestPoint(
	Point3d testPoint
)
Public Function ClosestPoint (
	testPoint As Point3d
) As Point3d
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to seach for.
Return Value
Type: Point3d
The point on the mesh closest to testPoint, or Point3d.Unset on failure.
See Also
Reference
Mesh Class
ClosestPoint Overload
Rhino.Geometry Namespace