RhinoCommon SDK
Brep.JoinNakedEdges Method
Rhino for Mac 5.1
 Joins naked edge pairs within the same brep that overlap within tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int JoinNakedEdges(
	double tolerance
)
Public Function JoinNakedEdges (
	tolerance As Double
) As Integer
Parameters
tolerance
Type: System.Double
The tolerance value.
Return Value
Type: Int32
number of joins made.
See Also
Reference
Brep Class
Rhino.Geometry Namespace