RhinoCommon SDK
ViewTable.FlashObjects Method
Rhino for Mac 5.1
 Cause objects selection state to change momentarily so the object appears to flash on the screen.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void FlashObjects(
	IEnumerable<RhinoObject> list,
	bool useSelectionColor
)
Public Sub FlashObjects (
	list As IEnumerable(Of RhinoObject),
	useSelectionColor As Boolean
)
Parameters
list
Type: System.Collections.Generic.IEnumerable<RhinoObject>
An array, a list or any enumerable set of Rhino objects.
useSelectionColor
Type: System.Boolean
 If true, flash between object color and selection color. If false, flash between visible and invisible.
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace