RhinoCommon SDK
RhinoViewport.GetFrustum Method
Rhino for Mac 5.1
 Gets the view frustum.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetFrustum(
	out double left,
	out double right,
	out double bottom,
	out double top,
	out double nearDistance,
	out double farDistance
)
Public Function GetFrustum (
	<OutAttribute> ByRef left As Double,
	<OutAttribute> ByRef right As Double,
	<OutAttribute> ByRef bottom As Double,
	<OutAttribute> ByRef top As Double,
	<OutAttribute> ByRef nearDistance As Double,
	<OutAttribute> ByRef farDistance As Double
) As Boolean
Parameters
left
Type: System.Double
left < right.
right
Type: System.Double
left < right.
bottom
Type: System.Double
bottom < top.
top
Type: System.Double
bottom < top.
nearDistance
Type: System.Double
0 < nearDistance < farDistance.
farDistance
Type: System.Double
0 < nearDistance < farDistance.
Return Value
Type: Boolean
true if operation succeeded.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace