RhinoCommon SDK
Surface.Degree Method
Rhino for Mac 5.1
 Returns the maximum algebraic degree of any span (or a good estimate if curve spans are not algebraic).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Degree(
	int direction
)
Public Function Degree (
	direction As Integer
) As Integer
Parameters
direction
Type: System.Int32
 0 gets first parameter's domain, 1 gets second parameter's domain.
Return Value
Type: Int32
The maximum degree.
See Also
Reference
Surface Class
Rhino.Geometry Namespace