RhinoCommon SDK
InstanceDefinitionGeometry Class
Rhino for Mac 5.1
 Represents the geometry in a block definition.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.InstanceDefinitionGeometry
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class InstanceDefinitionGeometry : GeometryBase
Public Class InstanceDefinitionGeometry
	Inherits GeometryBase
The InstanceDefinitionGeometry type exposes the following members.
Constructors
Name | Description
InstanceDefinitionGeometry
 Initializes a new block definition.
Top
Properties
Name | Description
Description
 Gets or sets the description of the definition.
Id
 unique id for this instance definition
Name
 Gets or sets the name of the definition.
Top
Methods
Name | Description
GetObjectIds
 list of object ids in the instance geometry table
Top
See Also
Reference
Rhino.Geometry Namespace