RhinoCommon SDK
BinaryArchiveReader.ReadPoint2d Method
Rhino for Mac 5.1
 Reads a Point2d from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2d ReadPoint2d()
Public Function ReadPoint2d As Point2d
Return Value
Type: Point2d
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace