RhinoCommon SDK
BinaryArchiveReader.ReadPoint3d Method
Rhino for Mac 5.1
 Reads a Point3d from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d ReadPoint3d()
Public Function ReadPoint3d As Point3d
Return Value
Type: Point3d
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace