RhinoCommon SDK
BinaryArchiveReader.ReadPoint4d Method
Rhino for Mac 5.1
 Reads a Point4d from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point4d ReadPoint4d()
Public Function ReadPoint4d As Point4d
Return Value
Type: Point4d
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace