RhinoCommon SDK
BackgroundStyle Enumeration
Rhino for Mac 5.1
 Contains enumerated constants that define how the background of a viewport should be filled.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum BackgroundStyle
Public Enumeration BackgroundStyle
Members
Member name | Value | Description
SolidColor | 0 | Single solid color fill.
WallpaperImage | 1 | Simple image background wallpaper.
Gradient | 2 | Two color top/bottom color gradient.
Environment | 3 | Using a special environment.
See Also
Reference
Rhino.Display Namespace