RhinoCommon SDK
InstanceDefinitionTableEventArgs.EventType Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs.EventType"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public InstanceDefinitionTableEventType EventType { get; }
Public ReadOnly Property EventType As InstanceDefinitionTableEventType
	Get
Property Value
Type: InstanceDefinitionTableEventType
See Also
Reference
InstanceDefinitionTableEventArgs Class
Rhino.DocObjects.Tables Namespace