RhinoCommon SDK
Text3d.TextPlane Property
Rhino for Mac 5.1
 Gets or sets the 3D aligned plane for this Text3d object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Plane TextPlane { get; set; }
Public Property TextPlane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
Text3d Class
Rhino.Display Namespace