RhinoCommon SDK
NurbsSurfaceKnotList.EpsilonEquals Method
Rhino for Mac 5.1
 Check that all values in other are within epsilon of the values in this
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool EpsilonEquals(
	NurbsSurfaceKnotList other,
	double epsilon
)
Public Function EpsilonEquals (
	other As NurbsSurfaceKnotList,
	epsilon As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.Collections.NurbsSurfaceKnotList
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.Collections.NurbsSurfaceKnotList.EpsilonEquals(Rhino.Geometry.Collections.NurbsSurfaceKnotList,System.Double)"]
epsilon
Type: System.Double
[Missing <param name="epsilon"/> documentation for "M:Rhino.Geometry.Collections.NurbsSurfaceKnotList.EpsilonEquals(Rhino.Geometry.Collections.NurbsSurfaceKnotList,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.NurbsSurfaceKnotList.EpsilonEquals(Rhino.Geometry.Collections.NurbsSurfaceKnotList,System.Double)"]
Implements
IEpsilonComparable<T>.EpsilonEquals(T, Double)
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace