RhinoCommon SDK
Command.UndoRedo Event
Rhino for Mac 5.1
 Used to monitor Rhino's built in undo/redo support.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<UndoRedoEventArgs> UndoRedo
Public Shared Event UndoRedo As EventHandler(Of UndoRedoEventArgs)
Value
Type: System.EventHandler<UndoRedoEventArgs>
See Also
Reference
Command Class
Rhino.Commands Namespace