RhinoCommon SDK
Ray3d.Direction Property
Rhino for Mac 5.1
 Gets the direction vector of this ray.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d Direction { get; }
Public ReadOnly Property Direction As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace