RhinoCommon SDK
MeshFaceNormalList.Item Property
Rhino for Mac 5.1
 Gets or sets the face normal at the given face index. The index must be valid or an IndexOutOfRangeException will be thrown.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3f this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Vector3f
	Get
	Set
Parameters
index
Type: System.Int32
Index of face normal to access.
Return Value
Type: Vector3f
The face normal at [index].
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace