RhinoCommon SDK
RevSurface.Create Method (Polyline, Line)
Rhino for Mac 5.1
 Constructs a new surface of revolution from a generatrix polyline and an axis.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static RevSurface Create(
	Polyline revolutePolyline,
	Line axisOfRevolution
)
Public Shared Function Create (
	revolutePolyline As Polyline,
	axisOfRevolution As Line
) As RevSurface
Parameters
revolutePolyline
Type: Rhino.Geometry.Polyline
A generatrix.
axisOfRevolution
Type: Rhino.Geometry.Line
An axis.
Return Value
Type: RevSurface
A new surface of revolution, or null if any of the inputs is invalid or on error.
See Also
Reference
RevSurface Class
Create Overload
Rhino.Geometry Namespace