RhinoCommon SDK
Vector3d.IsParallelTo Method
Rhino for Mac 5.1
Overload List
Name | Description
IsParallelTo(Vector3d)
 Determines whether this vector is parallel to another vector, within one degree (within Pi / 180).
IsParallelTo(Vector3d, Double)
 Determines whether this vector is parallel to another vector, within a provided tolerance.
Top
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace