RhinoCommon SDK
IntersectionEvent Class
Rhino for Mac 5.1
 Provides all the information for a single Curve Intersection event.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Intersect.IntersectionEvent
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class IntersectionEvent
Public Class IntersectionEvent
The IntersectionEvent type exposes the following members.
Constructors
Name | Description
IntersectionEvent
Initializes a new instance of the IntersectionEvent class
Top
Properties
Name | Description
IsOverlap
 All curve intersection events are either a single point or an overlap.
IsPoint
 All curve intersection events are either a single point or an overlap.
OverlapA
 Gets the interval on curve A where the overlap occurs. If the intersection type is not overlap, this value is meaningless.
OverlapB
 Gets the interval on curve B where the overlap occurs. If the intersection type is not overlap, this value is meaningless.
ParameterA
 Gets the parameter on Curve A where the intersection occured. If the intersection type is overlap, then this will return the start of the overlap region.
ParameterB
 Gets the parameter on Curve A where the intersection occured. If the intersection type is overlap, then this will return the start of the overlap region.
PointA
 Gets the point on Curve A where the intersection occured. If the intersection type is overlap, then this will return the start of the overlap region.
PointA2
 Gets the end point of the overlap on Curve A. If the intersection type is not overlap, this value is meaningless.
PointB
 Gets the point on Curve B (or Surface B) where the intersection occured. If the intersection type is overlap, then this will return the start of the overlap region.
PointB2
 Gets the end point of the overlap on Curve B (or Surface B). If the intersection type is not overlap, this value is meaningless.
Top
Methods
Name | Description
SurfaceOverlapParameter
 If this instance records a Curve|Surface intersection event, and the intersection type if overlap, then use this function to get the U and V domains on the surface where the overlap occurs.
SurfacePointParameter
 If this instance records a Curve|Surface intersection event, and the intersection type is point, then use this function to get the U and V parameters on the surface where the intersection occurs.
Top
See Also
Reference
Rhino.Geometry.Intersect Namespace