RhinoCommon SDK
FileReadOptions.ImportReferenceMode Property
Rhino for Mac 5.1
 true means we are reading information for a work session reference model or a linked instance definition.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ImportReferenceMode { get; set; }
Public Property ImportReferenceMode As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace