RhinoCommon SDK
BrepFaceList.Add Method (Int32)
Rhino for Mac 5.1
 Create and add a new face to this list. An incomplete face is added. The caller must create and fill in the loops used by the face.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepFace Add(
	int surfaceIndex
)
Public Function Add (
	surfaceIndex As Integer
) As BrepFace
Parameters
surfaceIndex
Type: System.Int32
index of surface in brep's Surfaces list
Return Value
Type: BrepFace
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.BrepFaceList.Add(System.Int32)"]
See Also
Reference
BrepFaceList Class
Add Overload
Rhino.Geometry.Collections Namespace