RhinoCommon SDK
GumballAppearanceSettings.TranslateYZEnabled Property
Rhino for Mac 5.1
 When TranslateYZ is true, the YZ plane translation control is available in appropriate views. The default setting is true.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TranslateYZEnabled { get; set; }
Public Property TranslateYZEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace