RhinoCommon SDK
DetailViewObject.CommitViewportChanges Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.DetailViewObject.CommitViewportChanges"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool CommitViewportChanges()
Public Function CommitViewportChanges As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.DetailViewObject.CommitViewportChanges"]
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace