RhinoCommon SDK
Material.SetBitmapTexture Method (Texture)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.SetBitmapTexture(Rhino.DocObjects.Texture)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetBitmapTexture(
	Texture texture
)
Public Function SetBitmapTexture (
	texture As Texture
) As Boolean
Parameters
texture
Type: Rhino.DocObjects.Texture
[Missing <param name="texture"/> documentation for "M:Rhino.DocObjects.Material.SetBitmapTexture(Rhino.DocObjects.Texture)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.SetBitmapTexture(Rhino.DocObjects.Texture)"]
See Also
Reference
Material Class
SetBitmapTexture Overload
Rhino.DocObjects Namespace