RhinoCommon SDK
Layer.IsReference Property
Rhino for Mac 5.1
 Gets a value indicting whether this layer is a referenced layer. Referenced layers are part of referenced documents.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsReference { get; }
Public ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Layer Class
Rhino.DocObjects Namespace