RhinoCommon SDK
UserDictionary Class
Rhino for Mac 5.1
 Defines the storage data class for a user dictionary.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Custom.UserData
 Rhino.DocObjects.Custom.UserDictionary
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class UserDictionary : UserData
Public Class UserDictionary
	Inherits UserData
The UserDictionary type exposes the following members.
Constructors
Name | Description
UserDictionary
Initializes a new instance of the UserDictionary class
Top
Properties
Name | Description
Description
 Gets the text "RhinoCommon UserDictionary".
 (Overrides UserData.Description.)
Dictionary
 Gets the dictionary that is associated with this class.
This dictionary is unique.
ShouldWrite
 Writes this entity if the count is larger than 0.
 (Overrides UserData.ShouldWrite.)
Top
Methods
Name | Description
OnDuplicate
 Clones the user data.
 (Overrides UserData.OnDuplicate(UserData).)
Read
 Is called to read this entity.
 (Overrides UserData.Read(BinaryArchiveReader).)
Write
 Is called to write this entity.
 (Overrides UserData.Write(BinaryArchiveWriter).)
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace