RhinoCommon SDK
BinaryArchiveWriter.WriteVector3f Method
Rhino for Mac 5.1
 Writes a Vector3f value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteVector3f(
	Vector3f value
)
Public Sub WriteVector3f (
	value As Vector3f
)
Parameters
value
Type: Rhino.Geometry.Vector3f
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace