RhinoCommon SDK
Brep.CreateFromSweep Method
Rhino for Mac 5.1
Overload List
Name | Description
CreateFromSweep(Curve, Curve, Boolean, Double)
 General 1 rail sweep. If you are not producing the sweep results that you are after, then use the SweepOneRail class with options to generate the swept geometry
CreateFromSweep(Curve, IEnumerable<Curve>, Boolean, Double)
 General 1 rail sweep. If you are not producing the sweep results that you are after, then use the SweepOneRail class with options to generate the swept geometry
CreateFromSweep(Curve, Curve, Curve, Boolean, Double)
 General 2 rail sweep. If you are not producing the sweep results that you are after, then use the SweepTwoRail class with options to generate the swept geometry
CreateFromSweep(Curve, Curve, IEnumerable<Curve>, Boolean, Double)
 General 2 rail sweep. If you are not producing the sweep results that you are after, then use the SweepTwoRail class with options to generate the swept geometry
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace