RhinoCommon SDK
Brep.Flip Method
Rhino for Mac 5.1
 Reverses entire brep orientation of all faces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Flip()
Public Sub Flip
See Also
Reference
Brep Class
Rhino.Geometry Namespace