RhinoCommon SDK
Mesh.GetCachedTextureCoordinates Method
Rhino for Mac 5.1
 Call this method to get cached texture coordinates for a texture mapping with the specified Id.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public CachedTextureCoordinates GetCachedTextureCoordinates(
	Guid textureMappingId
)
Public Function GetCachedTextureCoordinates (
	textureMappingId As Guid
) As CachedTextureCoordinates
Parameters
textureMappingId
Type: System.Guid
 Texture mapping Id
Return Value
Type: CachedTextureCoordinates
 Object which allows access to coordinates and other props.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace