RhinoCommon SDK
BinaryArchiveMode Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.FileIO.BinaryArchiveMode"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum BinaryArchiveMode
Public Enumeration BinaryArchiveMode
Members
Member name | Value | Description
Unknown | 0
Read | 1
Write | 2
ReadWrite | 3
Read3dm | 5
Write3dm | 6
See Also
Reference
Rhino.FileIO Namespace