RhinoCommon SDK
MouseCursor Methods
Rhino for Mac 5.1
The MouseCursor type exposes the following members.
Methods
Name | Description
SetToolTip
 Sets a cursor tooltip string shown next to the mouse cursor. Overrides all cursor tooltip panes.
Top
See Also
Reference
MouseCursor Class
Rhino.UI Namespace