RhinoCommon SDK
MeshingParameters.SimplePlanes Property
Rhino for Mac 5.1
 Gets or sets a value indicating whether or not planar areas are allowed to be meshed in a simplified manner.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SimplePlanes { get; set; }
Public Property SimplePlanes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace