RhinoCommon SDK
GumballFrame.ScaleGripDistance Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballFrame.ScaleGripDistance"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d ScaleGripDistance { get; set; }
Public Property ScaleGripDistance As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
GumballFrame Structure
Rhino.UI.Gumball Namespace