RhinoCommon SDK
Linetype.Name Property
Rhino for Mac 5.1
The name of this linetype.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace