RhinoCommon SDK
Cylinder Constructor
Rhino for Mac 5.1
Overload List
Name | Description
Cylinder(Circle)
 Constructs a new cylinder with infinite height.
Cylinder(Circle, Double)
 Constructs a new cylinder with a finite height.
Top
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace