RhinoCommon SDK
Extrusion.MiterPlaneNormalAtStart Property
Rhino for Mac 5.1
 Gets or sets the normal of the miter plane at the start in profile coordinates. In profile coordinates, 0,0,1 always maps to the extrusion axis
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d MiterPlaneNormalAtStart { get; set; }
Public Property MiterPlaneNormalAtStart As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace