RhinoCommon SDK
IntersectionEvent.SurfaceOverlapParameter Method
Rhino for Mac 5.1
 If this instance records a Curve|Surface intersection event, and the intersection type if overlap, then use this function to get the U and V domains on the surface where the overlap occurs.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SurfaceOverlapParameter(
	out Interval uDomain,
	out Interval vDomain
)
Public Sub SurfaceOverlapParameter (
	<OutAttribute> ByRef uDomain As Interval,
	<OutAttribute> ByRef vDomain As Interval
)
Parameters
uDomain
Type: Rhino.Geometry.Interval
Domain along surface U direction for overlap event.
vDomain
Type: Rhino.Geometry.Interval
Domain along surface V direction for overlap event.
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace