RhinoCommon SDK
CurveProxy Class
Rhino for Mac 5.1
 Provides strongly-typed access to Brep edges.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Curve
 Rhino.Geometry.CurveProxy
 Rhino.Geometry.BrepEdge
 Rhino.Geometry.BrepTrim
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class CurveProxy : Curve
Public Class CurveProxy
	Inherits Curve
The CurveProxy type exposes the following members.
Constructors
Name | Description
CurveProxy
 Protected constructor for internal use.
Top
Properties
Name | Description
ProxyCurveIsReversed
 True if "this" is a curve is reversed from the "real" curve geometry
Top
Methods
Name | Description
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The Nurbs Curves segments do not have fully multiple interior knots.
 3. Rational Nurbs curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent Colinear or Cocircular segments are combined.
Top
See Also
Reference
Rhino.Geometry Namespace