RhinoCommon SDK
Brep.CreateBooleanDifference Method (Brep, Brep, Double)
Rhino for Mac 5.1
 Compute the Solid Difference of two Breps.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep[] CreateBooleanDifference(
	Brep firstBrep,
	Brep secondBrep,
	double tolerance
)
Public Shared Function CreateBooleanDifference (
	firstBrep As Brep,
	secondBrep As Brep,
	tolerance As Double
) As Brep()
Parameters
firstBrep
Type: Rhino.Geometry.Brep
First Brep for boolean difference.
secondBrep
Type: Rhino.Geometry.Brep
Second Brep for boolean difference.
tolerance
Type: System.Double
Tolerance to use for difference operation.
Return Value
Type: Brep[]
An array of Brep results or null on failure.
Remarks
The solid orientation of the breps make a difference when calling this function
See Also
Reference
Brep Class
CreateBooleanDifference Overload
Rhino.Geometry Namespace