RhinoCommon SDK
Mesh.Reduce Method
Rhino for Mac 5.1
 Reduce polygon count
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Reduce(
	int desiredPolygonCount,
	bool allowDistortion,
	int accuracy,
	bool normalizeSize
)
Public Function Reduce (
	desiredPolygonCount As Integer,
	allowDistortion As Boolean,
	accuracy As Integer,
	normalizeSize As Boolean
) As Boolean
Parameters
desiredPolygonCount
Type: System.Int32
desired or target number of faces
allowDistortion
Type: System.Boolean
 If true mesh appearance is not changed even if the target polygon count is not reached
accuracy
Type: System.Int32
Integer from 1 to 10 telling how accurate reduction algorithm to use. Greater number gives more accurate results
normalizeSize
Type: System.Boolean
If true mesh is fitted to an axis aligned unit cube until reduction is complete
Return Value
Type: Boolean
True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace