RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_CURRENT_WIRE_DENSITY Field
Rhino for Mac 5.1
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_CURRENT_WIRE_DENSITY"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_SETTINGS_CURRENT_WIRE_DENSITY
Public Const TCODE_SETTINGS_CURRENT_WIRE_DENSITY As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace