RhinoCommon SDK
ColorHSL.CreateFromXYZ Method
Rhino for Mac 5.1
 Create the nearest HSL equivalent of an XYZ color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorHSL CreateFromXYZ(
	ColorXYZ xyz
)
Public Shared Function CreateFromXYZ (
	xyz As ColorXYZ
) As ColorHSL
Parameters
xyz
Type: Rhino.Display.ColorXYZ
Target color in XYZ space.
Return Value
Type: ColorHSL
The HSL equivalent of the XYZ color.
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace