RhinoCommon SDK
Localization.FormatNumber Method
Rhino for Mac 5.1
 Get a string version of a number in a given unit system / display mode.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string FormatNumber(
	double x,
	UnitSystem units,
	DistanceDisplayMode mode,
	int precision,
	bool appendUnitSystemName
)
Public Shared Function FormatNumber (
	x As Double,
	units As UnitSystem,
	mode As DistanceDisplayMode,
	precision As Integer,
	appendUnitSystemName As Boolean
) As String
Parameters
x
Type: System.Double
The number to format into a string.
units
Type: Rhino.UnitSystem
The unit system for the number.
mode
Type: Rhino.UI.DistanceDisplayMode
How the number should be formatted.
precision
Type: System.Int32
The precision of the number.
appendUnitSystemName
Type: System.Boolean
Adds unit system name to the end of the number.
Return Value
Type: String
The formatted number.
See Also
Reference
Localization Class
Rhino.UI Namespace