RhinoCommon SDK
BinaryArchiveException Class
Rhino for Mac 5.1
 Thrown by BinaryArchiveReader and BinaryArchiveWriter classes when an IO error has occured.
Inheritance Hierarchy
System.Object
 System.Exception
 System.SystemException
 System.IO.IOException
 Rhino.FileIO.BinaryArchiveException
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class BinaryArchiveException : IOException
Public Class BinaryArchiveException
	Inherits IOException
The BinaryArchiveException type exposes the following members.
Constructors
Name | Description
BinaryArchiveException
 Initializes a new instance of the BinaryArchiveException class.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Events
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace