RhinoCommon SDK
DisplayBitmapDrawList.Sort Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayBitmapDrawList.Sort(Rhino.Geometry.Vector3d)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] Sort(
	Vector3d cameraDirection
)
Public Function Sort (
	cameraDirection As Vector3d
) As Integer()
Parameters
cameraDirection
Type: Rhino.Geometry.Vector3d
[Missing <param name="cameraDirection"/> documentation for "M:Rhino.Display.DisplayBitmapDrawList.Sort(Rhino.Geometry.Vector3d)"]
Return Value
Type: Int32[]
[Missing <returns> documentation for "M:Rhino.Display.DisplayBitmapDrawList.Sort(Rhino.Geometry.Vector3d)"]
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace