RhinoCommon SDK
DimensionStyle.FontIndex Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.FontIndex"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int FontIndex { get; set; }
Public Property FontIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace