RhinoCommon SDK
SpaceMorph.PreserveStructure Property
Rhino for Mac 5.1
 true if the morph should be done in a way that preserves the structure of the geometry. In particular, for NURBS objects, true means that only the control points are moved. The PreserveStructure value does not affect the way meshes and points are morphed. The default is false.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PreserveStructure { get; set; }
Public Property PreserveStructure As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SpaceMorph Class
Rhino.Geometry Namespace