RhinoCommon SDK
Circle.Center Property
Rhino for Mac 5.1
 Gets or sets the center point of this circle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d Center { get; set; }
Public Property Center As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Circle Structure
Rhino.Geometry Namespace