RhinoCommon SDK
ObjectLinetypeSource Enumeration
Rhino for Mac 5.1
 Defines enumerated values for the source of linetype of single objects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum ObjectLinetypeSource
Public Enumeration ObjectLinetypeSource
Members
Member name | Value | Description
LinetypeFromLayer | 0 | use line style assigned to layer.
LinetypeFromObject | 1 | use line style assigned to object.
LinetypeFromParent | 3 |  for objects with parents (like objects in instance references, use parent linetype) if not parent, treat as linetype_from_layer.
See Also
Reference
Rhino.DocObjects Namespace