RhinoCommon SDK
Polyline.Length Property
Rhino for Mac 5.1
 Gets the total length of the polyline.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
See Also
Reference
Polyline Class
Rhino.Geometry Namespace