RhinoCommon SDK
RhinoViewport.ZoomExtentsSelected Method
Rhino for Mac 5.1
 Dollies the camera location and so that the view frustum contains all of the selected document objects that can be seen in view. If the projection is perspective, the camera angle is not changed.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ZoomExtentsSelected()
Public Function ZoomExtentsSelected As Boolean
Return Value
Type: Boolean
true if successful.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace