RhinoCommon SDK
ParticleSystem Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Geometry.ParticleSystem"]
Inheritance Hierarchy
System.Object
 Rhino.Geometry.ParticleSystem
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class ParticleSystem : IEnumerable<Particle>,
	IEnumerable
Public Class ParticleSystem
	Implements IEnumerable(Of Particle), IEnumerable
The ParticleSystem type exposes the following members.
Constructors
Name | Description
ParticleSystem
Initializes a new instance of the ParticleSystem class
Top
Properties
Name | Description
BoundingBox
DisplaySizesInWorldUnits
DrawRequiresDepthSorting
Top
Methods
Name | Description
Add
 Adds a particle to this ParticleSystem. A Particle can only be in one system at a time. If the Particle already exists in a different system, this function will return false. You should remove the particle from the other system first before adding it.
Clear
 Remove all Particles from this system.
GetEnumerator
Remove
 Removes a single particle from this system.
Update
 Calls Update on every particle in the system.
Top
See Also
Reference
Rhino.Geometry Namespace