RhinoCommon SDK
FlowSpaceMorph.Dispose Method (Boolean)
Rhino for Mac 5.1
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.
See Also
Reference
FlowSpaceMorph Class
Dispose Overload
Rhino.Geometry.Morphs Namespace