RhinoCommon SDK
PageViewSpaceChangeEventArgs.PageView Property
Rhino for Mac 5.1
 The page view on which a different detail object was set active.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoPageView PageView { get; }
Public ReadOnly Property PageView As RhinoPageView
	Get
Property Value
Type: RhinoPageView
See Also
Reference
PageViewSpaceChangeEventArgs Class
Rhino.Display Namespace