RhinoCommon SDK
MaterialTableEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.MaterialTableEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.Tables.MaterialTableEventArgs
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MaterialTableEventArgs : EventArgs
Public Class MaterialTableEventArgs
	Inherits EventArgs
The MaterialTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
Index
OldSettings
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace