RhinoCommon SDK
Transform.Identity Property
Rhino for Mac 5.1
 Gets a new identity transform matrix. An identity matrix defines no transformation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform Identity { get; }
Public Shared ReadOnly Property Identity As Transform
	Get
Property Value
Type: Transform
See Also
Reference
Transform Structure
Rhino.Geometry Namespace