RhinoCommon SDK
ColorLAB Methods
Rhino for Mac 5.1
The ColorLAB type exposes the following members.
Methods
Name | Description
CreateFromCMYK
 Create the nearest LAB equivalent of a CMYK color.
CreateFromHSL
 Create the nearest LAB equivalent of an HSL color.
CreateFromLCH
 Create the nearest LAB equivalent of an LCH color.
CreateFromXYZ
 Create the nearest LAB equivalent of an XYZ color.
Top
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace