RhinoCommon SDK
DrawObjectEventArgs.RhinoObject Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DrawObjectEventArgs.RhinoObject"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject RhinoObject { get; }
Public ReadOnly Property RhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
DrawObjectEventArgs Class
Rhino.Display Namespace