RhinoCommon SDK
OptionToggle Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Input.Custom.OptionToggle"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.OptionToggle
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class OptionToggle : IDisposable
Public Class OptionToggle
	Implements IDisposable
The OptionToggle type exposes the following members.
Constructors
Name | Description
OptionToggle(Boolean, LocalizeStringPair, LocalizeStringPair)
Initializes a new instance of the OptionToggle class
OptionToggle(Boolean, String, String)
Initializes a new instance of the OptionToggle class
Top
Properties
Name | Description
CurrentValue
InitialValue
Top
Methods
Name | Description
Dispose()
Releases all resources used by the OptionToggle
Dispose(Boolean)
Releases the unmanaged resources used by the OptionToggle and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Input.Custom Namespace