RhinoCommon SDK
File3dmSettings.PageRelativeTolerance Property
Rhino for Mac 5.1
Gets or sets the page space relative tolerance.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double PageRelativeTolerance { get; set; }
Public Property PageRelativeTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace