RhinoCommon SDK
SweepOneRail.SetRoadlikeUpDirection Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.SetRoadlikeUpDirection(Rhino.Geometry.Vector3d)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetRoadlikeUpDirection(
	Vector3d up
)
Public Sub SetRoadlikeUpDirection (
	up As Vector3d
)
Parameters
up
Type: Rhino.Geometry.Vector3d
[Missing <param name="up"/> documentation for "M:Rhino.Geometry.SweepOneRail.SetRoadlikeUpDirection(Rhino.Geometry.Vector3d)"]
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace