RhinoCommon SDK
GetBaseClass.Result Method
Rhino for Mac 5.1
Returns result of the Get*() call.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GetResult Result()
Public Function Result As GetResult
Return Value
Type: GetResult
The result of the last Get*() call.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace