RhinoCommon SDK
ReplayHistoryData.Results Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.ReplayHistoryData.Results"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ReplayHistoryResult[] Results { get; }
Public ReadOnly Property Results As ReplayHistoryResult()
	Get
Property Value
Type: ReplayHistoryResult[]
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace