RhinoCommon SDK
RhinoViewport.KeyboardDollyInOut Method
Rhino for Mac 5.1
 Emulates the keyboard arrow key in terms of interaction.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool KeyboardDollyInOut(
	double amount
)
Public Function KeyboardDollyInOut (
	amount As Double
) As Boolean
Parameters
amount
Type: System.Double
The dolly amount.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace