RhinoCommon SDK
ObjectPropertiesPage Methods
Rhino for Mac 5.1
The ObjectPropertiesPage type exposes the following members.
Methods
Name | Description
InitializeControls
OnActivate
Called when this page is activated/deactivated.
OnCreateParent
OnHelp
OnSizeParent
ShouldDisplay
Top
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace