RhinoCommon SDK
MaterialTable.Item Property
Rhino for Mac 5.1
 Conceptually, the material table is an array of materials. The operator[] can be used to get individual materials. A material is either active or deleted and this state is reported by Material.IsDeleted.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Material this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As Material
	Get
Parameters
index
Type: System.Int32
zero based array index.
Return Value
Type: Material
 If index is out of range, the current material is returned.
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace