RhinoCommon SDK
DisplayPipeline.Draw2dRectangle Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.Draw2dRectangle(System.Drawing.Rectangle,System.Drawing.Color,System.Int32,System.Drawing.Color)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Draw2dRectangle(
	Rectangle rectangle,
	Color strokeColor,
	int thickness,
	Color fillColor
)
Public Sub Draw2dRectangle (
	rectangle As Rectangle,
	strokeColor As Color,
	thickness As Integer,
	fillColor As Color
)
Parameters
rectangle
Type: System.Drawing.Rectangle
[Missing <param name="rectangle"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw2dRectangle(System.Drawing.Rectangle,System.Drawing.Color,System.Int32,System.Drawing.Color)"]
strokeColor
Type: System.Drawing.Color
[Missing <param name="strokeColor"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw2dRectangle(System.Drawing.Rectangle,System.Drawing.Color,System.Int32,System.Drawing.Color)"]
thickness
Type: System.Int32
[Missing <param name="thickness"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw2dRectangle(System.Drawing.Rectangle,System.Drawing.Color,System.Int32,System.Drawing.Color)"]
fillColor
Type: System.Drawing.Color
[Missing <param name="fillColor"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw2dRectangle(System.Drawing.Rectangle,System.Drawing.Color,System.Int32,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace