RhinoCommon SDK
File3dmObjectTable.AddTextDot Method
Rhino for Mac 5.1
Overload List
Name | Description
AddTextDot(TextDot)
Adds a text dot object to Rhino.
AddTextDot(String, Point3d)
Adds a text dot object to the table.
AddTextDot(TextDot, ObjectAttributes)
Adds a text dot object to Rhino.
AddTextDot(String, Point3d, ObjectAttributes)
Adds a text dot object to the table.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace