RhinoCommon SDK
Light.PowerLumens Property
Rhino for Mac 5.1
 Gets or sets the light power in lumens (lm).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double PowerLumens { get; set; }
Public Property PowerLumens As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Light Class
Rhino.Geometry Namespace