RhinoCommon SDK
Mesh.Split Method (Mesh)
Rhino for Mac 5.1
 Split a mesh with another mesh.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Mesh[] Split(
	Mesh mesh
)
Public Function Split (
	mesh As Mesh
) As Mesh()
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to split with.
Return Value
Type: Mesh[]
An array of mesh segments representing the split result.
See Also
Reference
Mesh Class
Split Overload
Rhino.Geometry Namespace