RhinoCommon SDK
Extrusion.PathEnd Property
Rhino for Mac 5.1
 Gets the end point of the path.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PathEnd { get; }
Public ReadOnly Property PathEnd As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace