RhinoCommon SDK
ObjectTable.AddLinearDimension Method (LinearDimension, ObjectAttributes)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddLinearDimension(
	LinearDimension dimension,
	ObjectAttributes attributes
)
Public Function AddLinearDimension (
	dimension As LinearDimension,
	attributes As ObjectAttributes
) As Guid
Parameters
dimension
Type: Rhino.Geometry.LinearDimension
[Missing <param name="dimension"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ObjectTable Class
AddLinearDimension Overload
Rhino.DocObjects.Tables Namespace