RhinoCommon SDK
ClippingPlaneSurface.ViewportIds Method
Rhino for Mac 5.1
 Returns Ids of viewports that this clipping plane is supposed to clip.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid[] ViewportIds()
Public Function ViewportIds As Guid()
Return Value
Type: Guid[]
An array of globally unique ideantifiers (Guids) to the viewports.
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace