RhinoCommon SDK
Particle.DisplayBitmapIndex Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Geometry.Particle.DisplayBitmapIndex"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int DisplayBitmapIndex { get; set; }
Public Property DisplayBitmapIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Particle Class
Rhino.Geometry Namespace