RhinoCommon SDK
LinearDimensionObject.DimensionStyle Property
Rhino for Mac 5.1
 Gets the DimensionStyle associated with this LinearDimensionObject.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DimensionStyle DimensionStyle { get; }
Public ReadOnly Property DimensionStyle As DimensionStyle
	Get
Property Value
Type: DimensionStyle
See Also
Reference
LinearDimensionObject Class
Rhino.DocObjects Namespace