RhinoCommon SDK
File3dmObjectTable.AddBrep Method (Brep)
Rhino for Mac 5.1
Adds a brep object to Rhino.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddBrep(
	Brep brep
)
Public Function AddBrep (
	brep As Brep
) As Guid
Parameters
brep
Type: Rhino.Geometry.Brep
A duplicate of this brep is added to Rhino.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddBrep Overload
Rhino.FileIO Namespace