RhinoCommon SDK
RhinoObjectSelectionEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.RhinoObjectSelectionEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoObjectSelectionEventArgs
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class RhinoObjectSelectionEventArgs : EventArgs
Public Class RhinoObjectSelectionEventArgs
	Inherits EventArgs
The RhinoObjectSelectionEventArgs type exposes the following members.
Properties
Name | Description
Document
RhinoObjects
Selected
 Returns true if objects are being selected. Returns false if objects are being deseleced.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace