RhinoCommon SDK
ReplayHistoryResult.UpdateToLeader Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToLeader(Rhino.Geometry.Leader,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToLeader(
	Leader leader,
	ObjectAttributes attributes
)
Public Function UpdateToLeader (
	leader As Leader,
	attributes As ObjectAttributes
) As Boolean
Parameters
leader
Type: Rhino.Geometry.Leader
[Missing <param name="leader"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToLeader(Rhino.Geometry.Leader,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToLeader(Rhino.Geometry.Leader,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToLeader(Rhino.Geometry.Leader,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace