RhinoCommon SDK
MeshTopologyEdgeList.GetConnectedFaces Method (Int32)
Rhino for Mac 5.1
 Gets indices of faces connected to an edge.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] GetConnectedFaces(
	int topologyEdgeIndex
)
Public Function GetConnectedFaces (
	topologyEdgeIndex As Integer
) As Integer()
Parameters
topologyEdgeIndex
Type: System.Int32
An index of a topology edge that is queried.
Return Value
Type: Int32[]
An array of face indices the edge borders. This might be empty on error.
See Also
Reference
MeshTopologyEdgeList Class
GetConnectedFaces Overload
Rhino.Geometry.Collections Namespace