RhinoCommon SDK
Mesh.GetOutlines Method (Plane)
Rhino for Mac 5.1
 Constructs the outlines of a mesh projected against a plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Polyline[] GetOutlines(
	Plane plane
)
Public Function GetOutlines (
	plane As Plane
) As Polyline()
Parameters
plane
Type: Rhino.Geometry.Plane
A plane to project against.
Return Value
Type: Polyline[]
An array of polylines, or null on error.
See Also
Reference
Mesh Class
GetOutlines Overload
Rhino.Geometry Namespace