RhinoCommon SDK
RhinoView.MainViewport Property
Rhino for Mac 5.1
 A RhinoView contains a "main viewport" that fills the entire view client window. RhinoPageViews may also contain nested child RhinoViewports for implementing detail viewports. The MainViewport will always return this RhinoView's m_vp.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoViewport MainViewport { get; }
Public ReadOnly Property MainViewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
See Also
Reference
RhinoView Class
Rhino.Display Namespace