RhinoCommon SDK
GetColorEventArgs.InputColor Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.GetColorEventArgs.InputColor"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color InputColor { get; }
Public ReadOnly Property InputColor As Color
	Get
Property Value
Type: Color
See Also
Reference
GetColorEventArgs Class
Rhino.UI Namespace