RhinoCommon SDK
Color4f.Equality Operator
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.Color4f.op_Equality(Rhino.Display.Color4f,Rhino.Display.Color4f)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator ==(
	Color4f a,
	Color4f b
)
Public Shared Operator = (
	a As Color4f,
	b As Color4f
) As Boolean
Parameters
a
Type: Rhino.Display.Color4f
[Missing <param name="a"/> documentation for "M:Rhino.Display.Color4f.op_Equality(Rhino.Display.Color4f,Rhino.Display.Color4f)"]
b
Type: Rhino.Display.Color4f
[Missing <param name="b"/> documentation for "M:Rhino.Display.Color4f.op_Equality(Rhino.Display.Color4f,Rhino.Display.Color4f)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.Color4f.op_Equality(Rhino.Display.Color4f,Rhino.Display.Color4f)"]
See Also
Reference
Color4f Structure
Rhino.Display Namespace