RhinoCommon SDK
MeshFace.Set Method (Int32, Int32, Int32, Int32)
Rhino for Mac 5.1
 Sets all the corners for this face as a quad.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Set(
	int a,
	int b,
	int c,
	int d
)
Public Sub Set (
	a As Integer,
	b As Integer,
	c As Integer,
	d As Integer
)
Parameters
a
Type: System.Int32
Index of first corner.
b
Type: System.Int32
Index of second corner.
c
Type: System.Int32
Index of third corner.
d
Type: System.Int32
Index of fourth corner.
See Also
Reference
MeshFace Structure
Set Overload
Rhino.Geometry Namespace