RhinoCommon SDK
SplopSpaceMorph Constructor
Rhino for Mac 5.1
Overload List
Name | Description
SplopSpaceMorph(Plane, Surface, Point2d)
 Constructs a flow space morph.
SplopSpaceMorph(Plane, Surface, Point2d, Double)
 Constructs a flow space morph.
SplopSpaceMorph(Plane, Surface, Point2d, Double, Double)
 Constructs a flow space morph.
Top
See Also
Reference
SplopSpaceMorph Class
Rhino.Geometry.Morphs Namespace