RhinoCommon SDK
ColorLAB Properties
Rhino for Mac 5.1
The ColorLAB type exposes the following members.
Properties
Name | Description
A
 Gets or sets the Base channel. The channel is limited to 0~1.
Alpha
 Gets or sets the Alpha channel. The channel is limited to 0~1.
B
 Gets or sets the Opponent channel. The channel is limited to 0~1.
L
 Gets or sets the lightness channel. The channel is limited to 0~1.
Top
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace