RhinoCommon SDK
Point3d.Subtract Method (Point3d, Point3d)
Rhino for Mac 5.1
 Subtracts a point from another point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Vector3d Subtract(
	Point3d point1,
	Point3d point2
)
Public Shared Function Subtract (
	point1 As Point3d,
	point2 As Point3d
) As Vector3d
Parameters
point1
Type: Rhino.Geometry.Point3d
A point.
point2
Type: Rhino.Geometry.Point3d
Another point.
Return Value
Type: Vector3d
A new vector that is the difference of point minus vector.
See Also
Reference
Point3d Structure
Subtract Overload
Rhino.Geometry Namespace