RhinoCommon SDK
Vector2d.GetHashCode Method
Rhino for Mac 5.1
 Provides a hashing value for the present vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A non-unique number based on vector components.
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace