RhinoCommon SDK
TwistSpaceMorph.TwistAxis Property
Rhino for Mac 5.1
Axis to rotate about.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line TwistAxis { get; set; }
Public Property TwistAxis As Line
	Get
	Set
Property Value
Type: Line
See Also
Reference
TwistSpaceMorph Class
Rhino.Geometry.Morphs Namespace