RhinoCommon SDK
BrepLoopList.Item Property
Rhino for Mac 5.1
 Gets the BrepLoop at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepLoop this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As BrepLoop
	Get
Parameters
index
Type: System.Int32
Index of BrepLoop to access.
Return Value
Type: BrepLoop
The BrepLoop at [index].
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
See Also
Reference
BrepLoopList Class
Rhino.Geometry.Collections Namespace