RhinoCommon SDK
PolylineCurve Constructor (PolylineCurve)
Rhino for Mac 5.1
 Initializes a new polyline curve by copying its content from another polyline curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PolylineCurve(
	PolylineCurve other
)
Public Sub New (
	other As PolylineCurve
)
Parameters
other
Type: Rhino.Geometry.PolylineCurve
Another polyline curve.
See Also
Reference
PolylineCurve Class
PolylineCurve Overload
Rhino.Geometry Namespace