RhinoCommon SDK
File3dmObjectTable.AddLinearDimension Method (LinearDimension, ObjectAttributes)
Rhino for Mac 5.1
 Adds a linear dimension to the 3dm file object table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddLinearDimension(
	LinearDimension dimension,
	ObjectAttributes attributes
)
Public Function AddLinearDimension (
	dimension As LinearDimension,
	attributes As ObjectAttributes
) As Guid
Parameters
dimension
Type: Rhino.Geometry.LinearDimension
A dimension.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to dimension.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddLinearDimension Overload
Rhino.FileIO Namespace