RhinoCommon SDK
LineCurve Properties
Rhino for Mac 5.1
The LineCurve type exposes the following members.
Properties
Name | Description
Line
 Gets or sets the Line value inside this curve.
Top
See Also
Reference
LineCurve Class
Rhino.Geometry Namespace