RhinoCommon SDK
LayerTable.ForceLayerVisible Method (Int32)
Rhino for Mac 5.1
 Makes a layer and all of its parent layers visible.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ForceLayerVisible(
	int layerIndex
)
Public Function ForceLayerVisible (
	layerIndex As Integer
) As Boolean
Parameters
layerIndex
Type: System.Int32
The layer index to be made visible.
Return Value
Type: Boolean
true if the operation succeeded.
See Also
Reference
LayerTable Class
ForceLayerVisible Overload
Rhino.DocObjects.Tables Namespace