RhinoCommon SDK
MeshTopologyVertexList.Item Property
Rhino for Mac 5.1
 Gets or sets the vertex at the given index. Setting a location adjusts all vertices in the mesh's vertex list that are defined by this topological vertex The index must be valid or an IndexOutOfRangeException will be thrown.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3f this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Point3f
	Get
	Set
Parameters
index
Type: System.Int32
Index of topology vertex to access.
Return Value
Type: Point3f
The topological vertex at [index].
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace