RhinoCommon SDK
ObjectTable.Undelete Method (UInt32)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Undelete(System.UInt32)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Undelete(
	uint runtimeSerialNumber
)
Public Function Undelete (
	runtimeSerialNumber As UInteger
) As Boolean
Parameters
runtimeSerialNumber
Type: System.UInt32
[Missing <param name="runtimeSerialNumber"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Undelete(System.UInt32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.Undelete(System.UInt32)"]
See Also
Reference
ObjectTable Class
Undelete Overload
Rhino.DocObjects.Tables Namespace