RhinoCommon SDK
Localization.LocalizeDialogItem Method
Rhino for Mac 5.1
 Look in the dialog item list for the specified key and return the translated localized string if the key is found otherwise return the English string.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string LocalizeDialogItem(
	Object assemblyOrObject,
	string key,
	string english
)
Public Shared Function LocalizeDialogItem (
	assemblyOrObject As Object,
	key As String,
	english As String
) As String
Parameters
assemblyOrObject
Type: System.Object
An assembly or an object from an assembly.
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.UI.Localization.LocalizeDialogItem(System.Object,System.String,System.String)"]
english
Type: System.String
The text in English.
Return Value
Type: String
 Look in the dialog item list for the specified key and return the translated localized string if the key is found otherwise return the English string.
See Also
Reference
Localization Class
Rhino.UI Namespace