RhinoCommon SDK
Polyline Constructor (IEnumerable<Point3d>)
Rhino for Mac 5.1
 Initializes a new polyline from a collection of points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Polyline(
	IEnumerable<Point3d> collection
)
Public Sub New (
	collection As IEnumerable(Of Point3d)
)
Parameters
collection
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to copy into the local vertex array.
See Also
Reference
Polyline Class
Polyline Overload
Rhino.Geometry Namespace