RhinoCommon SDK
HistoryRecord Properties
Rhino for Mac 5.1
The HistoryRecord type exposes the following members.
Properties
Name | Description
Handle
 Wrapped native C++ pointer to CRhinoHistory instance
Top
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace