RhinoCommon SDK
Quaternion.LengthSquared Property
Rhino for Mac 5.1
 Gets the result of (a^2 + b^2 + c^2 + d^2).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double LengthSquared { get; }
Public ReadOnly Property LengthSquared As Double
	Get
Property Value
Type: Double
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace