RhinoCommon SDK
CurveProxy.ProxyCurveIsReversed Property
Rhino for Mac 5.1
 True if "this" is a curve is reversed from the "real" curve geometry
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ProxyCurveIsReversed { get; }
Public ReadOnly Property ProxyCurveIsReversed As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CurveProxy Class
Rhino.Geometry Namespace