RhinoCommon SDK
Intersection.SurfaceSurface Method
Rhino for Mac 5.1
 Intersects two Surfaces.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool SurfaceSurface(
	Surface surfaceA,
	Surface surfaceB,
	double tolerance,
	out Curve[] intersectionCurves,
	out Point3d[] intersectionPoints
)
Public Shared Function SurfaceSurface (
	surfaceA As Surface,
	surfaceB As Surface,
	tolerance As Double,
	<OutAttribute> ByRef intersectionCurves As Curve(),
	<OutAttribute> ByRef intersectionPoints As Point3d()
) As Boolean
Parameters
surfaceA
Type: Rhino.Geometry.Surface
First Surface for intersection.
surfaceB
Type: Rhino.Geometry.Surface
Second Surface for intersection.
tolerance
Type: System.Double
Intersection tolerance.
intersectionCurves
Type: Rhino.Geometry.Curve[]
The intersection curves will be returned here.
intersectionPoints
Type: Rhino.Geometry.Point3d[]
The intersection points will be returned here.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace