RhinoCommon SDK
DisplayPipeline.DrawLine Method
Rhino for Mac 5.1
Overload List
Name | Description
DrawLine(Line, Color)
 Draws a single line object.
DrawLine(Line, Color, Int32)
 Draws a single line object.
DrawLine(Point3d, Point3d, Color)
 Draws a single line object.
DrawLine(Point3d, Point3d, Color, Int32)
 Draws a single line object.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace