RhinoCommon SDK
InstanceDefinitionTableEventArgs Properties
Rhino for Mac 5.1
The InstanceDefinitionTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
InstanceDefinitionIndex
NewState
OldState
Top
See Also
Reference
InstanceDefinitionTableEventArgs Class
Rhino.DocObjects.Tables Namespace