RhinoCommon SDK
SweepOneRail.IsRoadlikeFront Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.IsRoadlikeFront"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsRoadlikeFront { get; }
Public ReadOnly Property IsRoadlikeFront As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace