RhinoCommon SDK
DisplayPipeline.Draw3dText Method (String, Color, Plane, Double, String)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Draw3dText(
	string text,
	Color color,
	Plane textPlane,
	double height,
	string fontface
)
Public Sub Draw3dText (
	text As String,
	color As Color,
	textPlane As Plane,
	height As Double,
	fontface As String
)
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String)"]
textPlane
Type: Rhino.Geometry.Plane
[Missing <param name="textPlane"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String)"]
height
Type: System.Double
[Missing <param name="height"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String)"]
fontface
Type: System.String
[Missing <param name="fontface"/> documentation for "M:Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String)"]
See Also
Reference
DisplayPipeline Class
Draw3dText Overload
Rhino.Display Namespace