RhinoCommon SDK
BrepTrimType Enumeration
Rhino for Mac 5.1
 Each brep trim has a defined type.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum BrepTrimType
Public Enumeration BrepTrimType
Members
Member name | Value | Description
Unknown | 0 | Unknown type
Boundary | 1 |  Trim is connected to an edge, is part of an outer, inner or slit loop, and is the only trim connected to the edge.
Mated | 2 |  Trim is connected to an edge, is part of an outer, inner or slit loop, no other trim from the same loop is connected to the edge, and at least one trim from a different loop is connected to the edge.
Seam | 3 |  trim is connected to an edge, is part of an outer, inner or slit loop, and one other trim from the same loop is connected to the edge. (There can be other mated trims that are also connected to the edge. For example, the non-mainfold edge that results when a surface edge lies in the middle of another surface.) Non-mainfold "cuts" have seam trims too.
Singular | 4 |  Trim is part of an outer loop, the trim's 2d curve runs along the singular side of a surface, and the trim is NOT connected to an edge. (There is no 3d edge because the surface side is singular.)
CurveOnSurface | 5 |  Trim is connected to an edge, is the only trim in a crfonsrf loop, and is the only trim connected to the edge.
PointOnSurface | 6 |  Trim is a point on a surface, trim.m_pbox is records surface parameters, and is the only trim in a ptonsrf loop. This trim is not connected to an edge and has no 2d curve.
Slit | 7
See Also
Reference
Rhino.Geometry Namespace