RhinoCommon SDK
ColorCMYK.M Property
Rhino for Mac 5.1
 Gets or sets the Magenta channel value. Magenta channels are limited to the 0~1 range.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double M { get; set; }
Public Property M As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace