RhinoCommon SDK
TextDot.FontFace Property
Rhino for Mac 5.1
Font face used for displaying the dot
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string FontFace { get; set; }
Public Property FontFace As String
	Get
	Set
Property Value
Type: String
See Also
Reference
TextDot Class
Rhino.Geometry Namespace