RhinoCommon SDK
ClippingPlaneSurface Methods
Rhino for Mac 5.1
The ClippingPlaneSurface type exposes the following members.
Methods
Name | Description
ViewportIds
 Returns Ids of viewports that this clipping plane is supposed to clip.
Top
See Also
Reference
ClippingPlaneSurface Class
Rhino.Geometry Namespace