RhinoCommon SDK
GumballScaleMode Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.Gumball.GumballScaleMode"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum GumballScaleMode
Public Enumeration GumballScaleMode
Members
Member name | Value | Description
Independent | 0
XY | 1
YZ | 2
ZX | 3
XYZ | 4
See Also
Reference
Rhino.UI.Gumball Namespace