RhinoCommon SDK
GripObject.OwnerId Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.GripObject.OwnerId"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid OwnerId { get; }
Public ReadOnly Property OwnerId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace