RhinoCommon SDK
File3dmObjectTable.AddPoints Method (IEnumerable<Point3d>)
Rhino for Mac 5.1
 Adds multiple points to the document.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid[] AddPoints(
	IEnumerable<Point3d> points
)
Public Function AddPoints (
	points As IEnumerable(Of Point3d)
) As Guid()
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to add.
Return Value
Type: Guid[]
List of object ids.
See Also
Reference
File3dmObjectTable Class
AddPoints Overload
Rhino.FileIO Namespace