RhinoCommon SDK
GetPoint.AddSnapPoints Method
Rhino for Mac 5.1
 Adds points to the list of osnap points.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddSnapPoints(
	Point3d[] points
)
Public Function AddSnapPoints (
	points As Point3d()
) As Integer
Parameters
points
Type: Rhino.Geometry.Point3d[]
An array of points to snap onto.
Return Value
Type: Int32
Total number of snap points.
Remarks
 When point osnap is enabled, GetPoint will snap to points in the Rhino model. If you want the user to be able to snap to additional points, then use GetPoint::AddSnapPoints to specify the locations of these additional points.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace