RhinoCommon SDK
GetBaseClass.AddOption Method (LocalizeStringPair)
Rhino for Mac 5.1
 Adds a command line option.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddOption(
	LocalizeStringPair optionName
)
Public Function AddOption (
	optionName As LocalizeStringPair
) As Integer
Parameters
optionName
Type: Rhino.UI.LocalizeStringPair
 Must only consist of letters and numbers (no characters list periods, spaces, or dashes)
Return Value
Type: Int32
 option index value (>0) or 0 if option cannot be added.
See Also
Reference
GetBaseClass Class
AddOption Overload
Rhino.Input.Custom Namespace