RhinoCommon SDK
DisplayMaterial.SetTransparencyTexture Method
Rhino for Mac 5.1
Overload List
Name | Description
SetTransparencyTexture(String, Boolean)
SetTransparencyTexture(Texture, Boolean)
Top
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace