RhinoCommon SDK
ColorLCH.CreateFromCMYK Method
Rhino for Mac 5.1
 Create the nearest LCH equivalent of a CMYK color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorLCH CreateFromCMYK(
	ColorCMYK cmyk
)
Public Shared Function CreateFromCMYK (
	cmyk As ColorCMYK
) As ColorLCH
Parameters
cmyk
Type: Rhino.Display.ColorCMYK
Target color in CMYK space.
Return Value
Type: ColorLCH
The LCH equivalent of the CMYK color.
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace