RhinoCommon SDK
MeshTopologyEdgeList.EdgeLine Method
Rhino for Mac 5.1
Gets the 3d line along an edge.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line EdgeLine(
	int topologyEdgeIndex
)
Public Function EdgeLine (
	topologyEdgeIndex As Integer
) As Line
Parameters
topologyEdgeIndex
Type: System.Int32
The topology edge index.
Return Value
Type: Line
 Line along edge. If input is not valid, an Invalid Line is returned.
See Also
Reference
MeshTopologyEdgeList Class
Rhino.Geometry.Collections Namespace