RhinoCommon SDK
Mesh.Offset Method (Double, Boolean)
Rhino for Mac 5.1
 Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals. Optionally, based on the value of solidify, adds the input mesh and a ribbon of faces along any naked edges. If solidify is false it acts exactly as the Offset(distance) function.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Mesh Offset(
	double distance,
	bool solidify
)
Public Function Offset (
	distance As Double,
	solidify As Boolean
) As Mesh
Parameters
distance
Type: System.Double
A distance value.
solidify
Type: System.Boolean
true if the mesh should be solidified.
Return Value
Type: Mesh
A new mesh on success, or null on failure.
See Also
Reference
Mesh Class
Offset Overload
Rhino.Geometry Namespace