RhinoCommon SDK
Arc.GetHashCode Method
Rhino for Mac 5.1
 Computes a hash code for the present arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A non-unique integer that represents this arc.
See Also
Reference
Arc Structure
Rhino.Geometry Namespace