RhinoCommon SDK
MostRecentCommandDescription Constructor
Rhino for Mac 5.1
Initializes a new instance of the MostRecentCommandDescription class
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MostRecentCommandDescription()
Public Sub New
See Also
Reference
MostRecentCommandDescription Class
Rhino.Commands Namespace