RhinoCommon SDK
Extrusion.GetProfilePlane Method
Rhino for Mac 5.1
 Gets the 3D plane containing the profile curve at a normalized path parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Plane GetProfilePlane(
	double s
)
Public Function GetProfilePlane (
	s As Double
) As Plane
Parameters
s
Type: System.Double
 0.0 = starting profile 1.0 = ending profile.
Return Value
Type: Plane
A plane. The plane is Invalid on failure.
Remarks
 When no mitering is happening, GetPathPlane() and GetProfilePlane() return the same plane.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace