RhinoCommon SDK
MeshVertexColorList Properties
Rhino for Mac 5.1
The MeshVertexColorList type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of mesh colors.
Item
 Gets or sets the vertex color at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Tag
 Gets or sets a mapping information for the mesh associated with these vertex colors.
Top
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace