RhinoCommon SDK
ILocalizationService Methods
Rhino for Mac 5.1
The ILocalizationService type exposes the following members.
Methods
Name | Description
LocalizeCommandName
LocalizeDialogItem
LocalizeString
Top
See Also
Reference
ILocalizationService Interface
Rhino.UI Namespace