RhinoCommon SDK
Ray3d.GetHashCode Method
Rhino for Mac 5.1
 Computes a hashing number that represents the current ray.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A signed integer that represents both postion and direction, but is not unique.
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace