RhinoCommon SDK
MeshFaceList.Item Property
Rhino for Mac 5.1
 Returns the mesh face at the given index.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MeshFace this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As MeshFace
	Get
Parameters
index
Type: System.Int32
Index of face to get. Must be larger than or equal to zero and smaller than the Face Count of the mesh.
Property Value
Type: MeshFace
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace