RhinoCommon SDK
MeshClash.MeshA Property
Rhino for Mac 5.1
 Gets the first mesh.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Mesh MeshA { get; }
Public ReadOnly Property MeshA As Mesh
	Get
Property Value
Type: Mesh
See Also
Reference
MeshClash Class
Rhino.Geometry.Intersect Namespace