RhinoCommon SDK
MeshTextureCoordinateList.Add Method (Single, Single)
Rhino for Mac 5.1
 Adds a new texture coordinate to the end of the Texture list.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	float s,
	float t
)
Public Function Add (
	s As Single,
	t As Single
) As Integer
Parameters
s
Type: System.Single
S component of new texture coordinate.
t
Type: System.Single
T component of new texture coordinate.
Return Value
Type: Int32
The index of the newly added texture coordinate.
See Also
Reference
MeshTextureCoordinateList Class
Add Overload
Rhino.Geometry.Collections Namespace