RhinoCommon SDK
DisplayPipeline.DrawSprite Method (DisplayBitmap, Point2d, Single, Color)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point2d,System.Single,System.Drawing.Color)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawSprite(
	DisplayBitmap bitmap,
	Point2d screenLocation,
	float size,
	Color blendColor
)
Public Sub DrawSprite (
	bitmap As DisplayBitmap,
	screenLocation As Point2d,
	size As Single,
	blendColor As Color
)
Parameters
bitmap
Type: Rhino.Display.DisplayBitmap
[Missing <param name="bitmap"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point2d,System.Single,System.Drawing.Color)"]
screenLocation
Type: Rhino.Geometry.Point2d
[Missing <param name="screenLocation"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point2d,System.Single,System.Drawing.Color)"]
size
Type: System.Single
[Missing <param name="size"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point2d,System.Single,System.Drawing.Color)"]
blendColor
Type: System.Drawing.Color
[Missing <param name="blendColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point2d,System.Single,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
DrawSprite Overload
Rhino.Display Namespace