RhinoCommon SDK
RhinoViewport.SetViewProjection Method
Rhino for Mac 5.1
 Sets the viewport camera projection.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetViewProjection(
	ViewportInfo projection,
	bool updateTargetLocation
)
Public Function SetViewProjection (
	projection As ViewportInfo,
	updateTargetLocation As Boolean
) As Boolean
Parameters
projection
Type: Rhino.DocObjects.ViewportInfo
The "standard" projection type.
updateTargetLocation
Type: System.Boolean
 if true, the target location is changed so that the vector from the camera location to the target is parallel to the camera direction vector. If false, the target location is not changed.
Return Value
Type: Boolean
true on success.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace