RhinoCommon SDK
StackedDialogPage.EnglishPageTitle Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.StackedDialogPage.EnglishPageTitle"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string EnglishPageTitle { get; }
Public ReadOnly Property EnglishPageTitle As String
	Get
Property Value
Type: String
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace