RhinoCommon SDK
Sphere.LatitudeRadians Method
Rhino for Mac 5.1
 Computes the parallel at a specific latitude angle.
The angle is specified in radians.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Circle LatitudeRadians(
	double radians
)
Public Function LatitudeRadians (
	radians As Double
) As Circle
Parameters
radians
Type: System.Double
An angle in radians for the parallel.
Return Value
Type: Circle
A circle.
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace