RhinoCommon SDK
ObjectTable.ModifyTextureMapping Method (RhinoObject, Int32, TextureMapping)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.ModifyTextureMapping(Rhino.DocObjects.RhinoObject,System.Int32,Rhino.Render.TextureMapping)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ModifyTextureMapping(
	RhinoObject obj,
	int channel,
	TextureMapping mapping
)
Public Function ModifyTextureMapping (
	obj As RhinoObject,
	channel As Integer,
	mapping As TextureMapping
) As Boolean
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="obj"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.ModifyTextureMapping(Rhino.DocObjects.RhinoObject,System.Int32,Rhino.Render.TextureMapping)"]
channel
Type: System.Int32
[Missing <param name="channel"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.ModifyTextureMapping(Rhino.DocObjects.RhinoObject,System.Int32,Rhino.Render.TextureMapping)"]
mapping
Type: Rhino.Render.TextureMapping
[Missing <param name="mapping"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.ModifyTextureMapping(Rhino.DocObjects.RhinoObject,System.Int32,Rhino.Render.TextureMapping)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.ModifyTextureMapping(Rhino.DocObjects.RhinoObject,System.Int32,Rhino.Render.TextureMapping)"]
See Also
Reference
ObjectTable Class
ModifyTextureMapping Overload
Rhino.DocObjects.Tables Namespace