RhinoCommon SDK
DisplayPipeline.DrawSurface Method
Rhino for Mac 5.1
 Draw wireframe display for a single surface.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawSurface(
	Surface surface,
	Color wireColor,
	int wireDensity
)
Public Sub DrawSurface (
	surface As Surface,
	wireColor As Color,
	wireDensity As Integer
)
Parameters
surface
Type: Rhino.Geometry.Surface
Surface to draw.
wireColor
Type: System.Drawing.Color
Color to draw with.
wireDensity
Type: System.Int32
Thickness (in pixels) or wires to draw.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace