RhinoCommon SDK
Line Constructor (Point3d, Point3d)
Rhino for Mac 5.1
 Constructs a new line segment between two points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line(
	Point3d from,
	Point3d to
)
Public Sub New (
	from As Point3d,
	to As Point3d
)
Parameters
from
Type: Rhino.Geometry.Point3d
Start point of line.
to
Type: Rhino.Geometry.Point3d
End point of line.
See Also
Reference
Line Structure
Line Overload
Rhino.Geometry Namespace