RhinoCommon SDK
Texture Class
Rhino for Mac 5.1
 Represents a texture that is mapped on objects.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.Texture
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class Texture : CommonObject
<SerializableAttribute>
Public Class Texture
	Inherits CommonObject
The Texture type exposes the following members.
Constructors
Name | Description
Texture()
 Initializes a new texture.
Texture(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
ApplyUvwTransform
 If true then the UVW transform is applied to the texture otherwise the UVW transform is ignored.
Enabled
 If the texture is enabled then it will be visible in the rendered display otherwise it will not.
FileName
 Gets or sets a file name that is used by this texture. NOTE: this filename may well not be a path that makes sense on a user's computer because it was a path initially set on a different user's computer. If you want to get a workable path for this user, use the BitmapTable.Find function using this property.
Id
 Gets the globally unique identifier of this texture.
MappingChannelId
TextureCombineMode
 Determines how this texture is combined with others in a material's texture list.
TextureType
 Controls how the pixels in the bitmap are interpreted
UvwTransform
 Transform to be applied to each instance of this texture if ApplyUvw is true
WrapU
 Texture wrapping mode in the U direction
WrapV
 Texture wrapping mode in the V direction
WrapW
 Texture wrapping mode in the W direction
Top
Methods
Name | Description
GetAlphaBlendValues
 If the TextureCombineMode is Blend, then the blending function for alpha is determined by
 new alpha = constant + a0*(current alpha) + a1*(texture alpha) + a2*min(current alpha,texture alpha) + a3*max(current alpha,texture alpha)
SetAlphaBlendValues
 If the TextureCombineMode is Blend, then the blending function for alpha is determined by
 new alpha = constant + a0*(current alpha) + a1*(texture alpha) + a2*min(current alpha,texture alpha) + a3*max(current alpha,texture alpha)
Top
See Also
Reference
Rhino.DocObjects Namespace