RhinoCommon SDK
Leader Class
Rhino for Mac 5.1
 Represents a leader, or an annotation entity with text that resembles an arrow pointing to something.
This class refers to the geometric element that is independent from the document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Leader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class Leader : AnnotationBase
<SerializableAttribute>
Public Class Leader
	Inherits AnnotationBase
The Leader type exposes the following members.
Constructors
Name | Description
Leader
 Protected constructor used in serialization.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace