RhinoCommon SDK
PanelIds Class
Rhino for Mac 5.1
 Standard Rhino panel Id's
Inheritance Hierarchy
System.Object
 Rhino.UI.PanelIds
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static class PanelIds
Public NotInheritable Class PanelIds
The PanelIds type exposes the following members.
Properties
Name | Description
ContextHelp
 Rhino context sensitive help panel.
Display
Environment
 Rhino environment panel
GroundPlane
 Rhino ground plane panel
Layers
 Rhino Layer panel
Libraries
 Rhino render properties panel
LightManager
 Rhino light manager panel
Materials
 Rhino material browser
Notes
 Rhino notes panel
ObjectProperties
 Rhino object properties panel
Rendering
 Rhino rendering properties panel
Sun
 Rhino sun panel
Texture
 Rhino texture panel
Top
See Also
Reference
Rhino.UI Namespace