RhinoCommon SDK
ReplayHistoryResult.UpdateToSphere Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToSphere(
	Sphere sphere,
	ObjectAttributes attributes
)
Public Function UpdateToSphere (
	sphere As Sphere,
	attributes As ObjectAttributes
) As Boolean
Parameters
sphere
Type: Rhino.Geometry.Sphere
[Missing <param name="sphere"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace