RhinoCommon SDK
ObjectTable.Delete Method (IEnumerable<Guid>, Boolean)
Rhino for Mac 5.1
 Deletes a collection of objects from the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Delete(
	IEnumerable<Guid> objectIds,
	bool quiet
)
Public Function Delete (
	objectIds As IEnumerable(Of Guid),
	quiet As Boolean
) As Integer
Parameters
objectIds
Type: System.Collections.Generic.IEnumerable<Guid>
Ids of all objects to delete.
quiet
Type: System.Boolean
If false, a message box will appear when an object cannot be deleted.
Return Value
Type: Int32
The number of successfully deleted objects.
See Also
Reference
ObjectTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace