RhinoCommon SDK
CustomMeshObject Constructor (Mesh)
Rhino for Mac 5.1
Initializes a new instance of the CustomMeshObject class
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected CustomMeshObject(
	Mesh mesh
)
Protected Sub New (
	mesh As Mesh
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.DocObjects.Custom.CustomMeshObject.#ctor(Rhino.Geometry.Mesh)"]
See Also
Reference
CustomMeshObject Class
CustomMeshObject Overload
Rhino.DocObjects.Custom Namespace