RhinoCommon SDK
RhinoObject.EnableVisualAnalysisMode Method
Rhino for Mac 5.1
 Used to turn analysis modes on and off.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool EnableVisualAnalysisMode(
	VisualAnalysisMode mode,
	bool enable
)
Public Function EnableVisualAnalysisMode (
	mode As VisualAnalysisMode,
	enable As Boolean
) As Boolean
Parameters
mode
Type: Rhino.Display.VisualAnalysisMode
A visual analysis mode.
enable
Type: System.Boolean
true if the mode should be activated; false otherwise.
Return Value
Type: Boolean
true if this object supports the analysis mode.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace