RhinoCommon SDK
Intersection.MeshMeshFast Method
Rhino for Mac 5.1
 Quickly intersects two meshes. Overlaps and near misses are ignored.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Line[] MeshMeshFast(
	Mesh meshA,
	Mesh meshB
)
Public Shared Function MeshMeshFast (
	meshA As Mesh,
	meshB As Mesh
) As Line()
Parameters
meshA
Type: Rhino.Geometry.Mesh
First mesh for intersection.
meshB
Type: Rhino.Geometry.Mesh
Second mesh for intersection.
Return Value
Type: Line[]
An array of intersection line segments.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace