RhinoCommon SDK
MaterialRefs.TryGetValue Method
Rhino for Mac 5.1
 Gets the value associated with the specified key.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetValue(
	Guid key,
	out MaterialRef value
)
Public Function TryGetValue (
	key As Guid,
	<OutAttribute> ByRef value As MaterialRef
) As Boolean
Parameters
key
Type: System.Guid
 The plug-in Id whose MaterialRef to get.
value
Type: Rhino.DocObjects.MaterialRef
 When this method returns, the MaterialRef associated with the specified key, if the key is found; otherwise, null. This parameter is passed uninitialized.
Return Value
Type: Boolean
 true if this dictionary contains a MaterialRef with the specified key; otherwise, false.
Implements
IDictionary<TKey, TValue>.TryGetValue(TKey, TValue)
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace