RhinoCommon SDK
Surface.IsIsoparametric Method (Curve, Interval)
Rhino for Mac 5.1
 Determines if a 2D curve is iso-parameteric in the parameter space of this surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IsoStatus IsIsoparametric(
	Curve curve,
	Interval curveDomain
)
Public Function IsIsoparametric (
	curve As Curve,
	curveDomain As Interval
) As IsoStatus
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to test.
curveDomain
Type: Rhino.Geometry.Interval
Sub domain of the curve.
Return Value
Type: IsoStatus
IsoStatus flag describing the iso-parametric relationship between the surface and the curve.
See Also
Reference
Surface Class
IsIsoparametric Overload
Rhino.Geometry Namespace