RhinoCommon SDK
Surface.HasNurbsForm Method
Rhino for Mac 5.1
 Is there a NURBS surface representation of this surface.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int HasNurbsForm()
Public Function HasNurbsForm As Integer
Return Value
Type: Int32
 0 unable to create NURBS representation with desired accuracy. 1 success - NURBS parameterization matches the surface's 2 success - NURBS point locus matches the surface's and the domain of the NURBS surface is correct. However, This surface's parameterization and the NURBS surface parameterization may not match. This situation happens when getting NURBS representations of surfaces that have a transendental parameterization like spheres, cylinders, and cones.
See Also
Reference
Surface Class
Rhino.Geometry Namespace