RhinoCommon SDK
InstanceDefinition.UsesDefinition Method
Rhino for Mac 5.1
 Determines if this instance definition contains a reference to another instance definition.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int UsesDefinition(
	int otherIdefIndex
)
Public Function UsesDefinition (
	otherIdefIndex As Integer
) As Integer
Parameters
otherIdefIndex
Type: System.Int32
index of another instance definition.
Return Value
Type: Int32
 0 no 1 other_idef_index is the index of this instance definition >1 This InstanceDefinition uses the instance definition and the returned value is the nesting depth.
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace