RhinoCommon SDK
BrepEdge.SetEdgeCurve Method
Rhino for Mac 5.1
Overload List
Name | Description
SetEdgeCurve(Int32)
 Set 3d curve geometry used by a b-rep edge.
SetEdgeCurve(Int32, Interval)
 Set 3d curve geometry used by a b-rep edge.
Top
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace