RhinoCommon SDK
MaterialTable.DeleteAt Method
Rhino for Mac 5.1
 Removes a material at a specific position from this material table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DeleteAt(
	int materialIndex
)
Public Function DeleteAt (
	materialIndex As Integer
) As Boolean
Parameters
materialIndex
Type: System.Int32
The position to be removed.
Return Value
Type: Boolean
 true if successful. false if materialIndex is out of range or the material cannot be deleted because it is the current material or because it material contains active geometry.
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace