RhinoCommon SDK
ArcCurve Constructor (Circle, Double, Double)
Rhino for Mac 5.1
 Initializes a new ArcCurve instance, copying values from a Circle and specifying the needed parametrization of the arc.
Circle will not be newly cut at these parameterizations.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ArcCurve(
	Circle circle,
	double t0,
	double t1
)
Public Sub New (
	circle As Circle,
	t0 As Double,
	t1 As Double
)
Parameters
circle
Type: Rhino.Geometry.Circle
A circle.
t0
Type: System.Double
A new Domain.T0 value.
t1
Type: System.Double
A new Domain.T1 value.
See Also
Reference
ArcCurve Class
ArcCurve Overload
Rhino.Geometry Namespace