RhinoCommon SDK
ArcCurve Constructor (Arc)
Rhino for Mac 5.1
 Initializes a new ArcCurve instance, copying values from another Arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ArcCurve(
	Arc arc
)
Public Sub New (
	arc As Arc
)
Parameters
arc
Type: Rhino.Geometry.Arc
Another Arc.
See Also
Reference
ArcCurve Class
ArcCurve Overload
Rhino.Geometry Namespace