RhinoCommon SDK
ArcCurve Constructor (ArcCurve)
Rhino for Mac 5.1
 Initializes a new ArcCurve instance, copying values from another ArcCurve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ArcCurve(
	ArcCurve other
)
Public Sub New (
	other As ArcCurve
)
Parameters
other
Type: Rhino.Geometry.ArcCurve
Another ArcCurve.
See Also
Reference
ArcCurve Class
ArcCurve Overload
Rhino.Geometry Namespace