RhinoCommon SDK
ArcCurve Constructor (Arc, Double, Double)
Rhino for Mac 5.1
 Initializes a new ArcCurve instance, copying values from another Arc and specifying the needed parametrization of the arc.
Arc will not be cut again at these parameterizations.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ArcCurve(
	Arc arc,
	double t0,
	double t1
)
Public Sub New (
	arc As Arc,
	t0 As Double,
	t1 As Double
)
Parameters
arc
Type: Rhino.Geometry.Arc
An original arc.
t0
Type: System.Double
A new Domain.T0 value.
t1
Type: System.Double
A new Domain.T1 value.
See Also
Reference
ArcCurve Class
ArcCurve Overload
Rhino.Geometry Namespace