RhinoCommon SDK
VisualAnalysisMode.Register Method
Rhino for Mac 5.1
 Registers a custom visual analysis mode for use in Rhino. It is OK to call register multiple times for a single custom analysis mode type, since subsequent register calls will notice that the type has already been registered.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static VisualAnalysisMode Register(
	Type customAnalysisModeType
)
Public Shared Function Register (
	customAnalysisModeType As Type
) As VisualAnalysisMode
Parameters
customAnalysisModeType
Type: System.Type
 Must be a type that is a subclass of VisualAnalysisMode.
Return Value
Type: VisualAnalysisMode
 An instance of registered analysis mode on success.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace