RhinoCommon SDK
Matrix.SetDiagonal Method
Rhino for Mac 5.1
 Sets diagonal value and zeros off all non-diagonal values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetDiagonal(
	double d
)
Public Sub SetDiagonal (
	d As Double
)
Parameters
d
Type: System.Double
The new diagonal value.
See Also
Reference
Matrix Class
Rhino.Geometry Namespace