RhinoCommon SDK
ObjectTable.AddMorphControl Method (MorphControl, ObjectAttributes)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddMorphControl(
	MorphControl morphControl,
	ObjectAttributes attributes
)
Public Function AddMorphControl (
	morphControl As MorphControl,
	attributes As ObjectAttributes
) As Guid
Parameters
morphControl
Type: Rhino.Geometry.MorphControl
[Missing <param name="morphControl"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ObjectTable Class
AddMorphControl Overload
Rhino.DocObjects.Tables Namespace