RhinoCommon SDK
TwistSpaceMorph Constructor
Rhino for Mac 5.1
 Constructs a twist space morph.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TwistSpaceMorph()
Public Sub New
See Also
Reference
TwistSpaceMorph Class
Rhino.Geometry.Morphs Namespace