RhinoCommon SDK
TextureMapping.MappingType Property
Rhino for Mac 5.1
 Texture mapping type associated with this Mapping object.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TextureMappingType MappingType { get; }
Public ReadOnly Property MappingType As TextureMappingType
	Get
Property Value
Type: TextureMappingType
See Also
Reference
TextureMapping Class
Rhino.Render Namespace