RhinoCommon SDK
Command.RunCommand Method
Rhino for Mac 5.1
 Executes the command.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected abstract Result RunCommand(
	RhinoDoc doc,
	RunMode mode
)
Protected MustOverride Function RunCommand (
	doc As RhinoDoc,
	mode As RunMode
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
The current document.
mode
Type: Rhino.Commands.RunMode
The command running mode.
Return Value
Type: Result
The command result code.
See Also
Reference
Command Class
Rhino.Commands Namespace