RhinoCommon SDK
TextEntity.Explode Method
Rhino for Mac 5.1
 Explodes this text entity into an array of curves.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] Explode()
Public Function Explode As Curve()
Return Value
Type: Curve[]
An array of curves that forms the outline or content of this text entity.
See Also
Reference
TextEntity Class
Rhino.Geometry Namespace