RhinoCommon SDK
DimensionStyle Constructor
Rhino for Mac 5.1
Initializes a new instance of the DimensionStyle class
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DimensionStyle()
Public Sub New
See Also
Reference
DimensionStyle Class
DimensionStyle Overload
Rhino.DocObjects Namespace