RhinoCommon SDK
Interval.GetHashCode Method
Rhino for Mac 5.1
 Computes the hash code for this Interval object.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A hash value that might be equal for two different Interval values.
See Also
Reference
Interval Structure
Rhino.Geometry Namespace