RhinoCommon SDK
MeshVertexList.GetTopologicalIndenticalVertices Method
Rhino for Mac 5.1
 Gets a list of other vertices which are "topologically" identical to this vertex.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] GetTopologicalIndenticalVertices(
	int vertexIndex
)
Public Function GetTopologicalIndenticalVertices (
	vertexIndex As Integer
) As Integer()
Parameters
vertexIndex
Type: System.Int32
A vertex index in the mesh.
Return Value
Type: Int32[]
 Array of indices of vertices that are topoligically the same as this vertex. The array includes vertexIndex. Returns null on failure.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace