RhinoCommon SDK
ViewportInfo.IsCameraUpLocked Property
Rhino for Mac 5.1
 Gets or sets a value that indicates whether the camera up vector is unmodifiable.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsCameraUpLocked { get; set; }
Public Property IsCameraUpLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace