RhinoCommon SDK
BrepObject Class
Rhino for Mac 5.1
 Represents a brep in a document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.BrepObject
 Rhino.DocObjects.Custom.CustomBrepObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class BrepObject : RhinoObject
Public Class BrepObject
	Inherits RhinoObject
The BrepObject type exposes the following members.
Properties
Name | Description
BrepGeometry
 Gets the brep geometry linked with this object.
Top
Methods
Name | Description
DuplicateBrepGeometry
 Constructs a new deep copy of the brep geometry.
Top
See Also
Reference
Rhino.DocObjects Namespace