RhinoCommon SDK
RhinoObjectEventArgs Properties
Rhino for Mac 5.1
The RhinoObjectEventArgs type exposes the following members.
Properties
Name | Description
ObjectId
TheObject
Top
See Also
Reference
RhinoObjectEventArgs Class
Rhino.DocObjects Namespace