RhinoCommon SDK
LayerTable.FindByFullPath Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int FindByFullPath(
	string layerPath,
	bool ignoreDeletedLayers
)
Public Function FindByFullPath (
	layerPath As String,
	ignoreDeletedLayers As Boolean
) As Integer
Parameters
layerPath
Type: System.String
[Missing <param name="layerPath"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Boolean)"]
ignoreDeletedLayers
Type: System.Boolean
[Missing <param name="ignoreDeletedLayers"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Boolean)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Boolean)"]
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace