RhinoCommon SDK
PointCloud.HiddenPointCount Property
Rhino for Mac 5.1
 Gets the number of points that have their Hidden flag set.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int HiddenPointCount { get; }
Public ReadOnly Property HiddenPointCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace