RhinoCommon SDK
Brep.Edges Property
Rhino for Mac 5.1
 Gets the brep edges list accessor.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepEdgeList Edges { get; }
Public ReadOnly Property Edges As BrepEdgeList
	Get
Property Value
Type: BrepEdgeList
See Also
Reference
Brep Class
Rhino.Geometry Namespace