RhinoCommon SDK
SporphSpaceMorph Class
Rhino for Mac 5.1
 Deforms an object from a source surface to a target surface.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SpaceMorph
 Rhino.Geometry.Morphs.SporphSpaceMorph
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class SporphSpaceMorph : SpaceMorph,
	IDisposable
Public Class SporphSpaceMorph
	Inherits SpaceMorph
	Implements IDisposable
The SporphSpaceMorph type exposes the following members.
Constructors
Name | Description
SporphSpaceMorph(Surface, Surface)
 Constructs a sporph space morph.
SporphSpaceMorph(Surface, Surface, Point2d, Point2d)
 Constructs a sporph space morph.
Top
Properties
Name | Description
IsValid
 Returns true if the space morph definition is valid, false otherwise.
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
MorphPoint
Morphs an Euclidean point.
 (Overrides SpaceMorph.MorphPoint(Point3d).)
Top
See Also
Reference
Rhino.Geometry.Morphs Namespace