RhinoCommon SDK
BoundingBox.Intersection Method
Rhino for Mac 5.1
 Computes the intersection of two bounding boxes.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static BoundingBox Intersection(
	BoundingBox a,
	BoundingBox b
)
Public Shared Function Intersection (
	a As BoundingBox,
	b As BoundingBox
) As BoundingBox
Parameters
a
Type: Rhino.Geometry.BoundingBox
A first bounding box.
b
Type: Rhino.Geometry.BoundingBox
A second bounding box.
Return Value
Type: BoundingBox
The intersection bounding box.
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace