RhinoCommon SDK
Brep.CreateContourCurves Method (Brep, Plane)
Rhino for Mac 5.1
 Constructs the contour curves for a brep, using a slicing plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] CreateContourCurves(
	Brep brepToContour,
	Plane sectionPlane
)
Public Shared Function CreateContourCurves (
	brepToContour As Brep,
	sectionPlane As Plane
) As Curve()
Parameters
brepToContour
Type: Rhino.Geometry.Brep
A brep or polysurface.
sectionPlane
Type: Rhino.Geometry.Plane
A plane.
Return Value
Type: Curve[]
An array with intersected curves. This array can be empty.
See Also
Reference
Brep Class
CreateContourCurves Overload
Rhino.Geometry Namespace