RhinoCommon SDK
Curve.Split Method (IEnumerable<Double>)
Rhino for Mac 5.1
 Splits (divides) the curve at a series of specified parameters. The parameter must be in the interior of the curve's domain.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] Split(
	IEnumerable<double> t
)
Public Function Split (
	t As IEnumerable(Of Double)
) As Curve()
Parameters
t
Type: System.Collections.Generic.IEnumerable<Double>
 Parameters to split the curve at in the interval returned by Domain().
Return Value
Type: Curve[]
 Multiple curves on success, null on failure.
See Also
Reference
Curve Class
Split Overload
Rhino.Geometry Namespace