RhinoCommon SDK
TwistSpaceMorph.TwistAngleRadians Property
Rhino for Mac 5.1
 Twist angle in radians.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double TwistAngleRadians { get; set; }
Public Property TwistAngleRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
TwistSpaceMorph Class
Rhino.Geometry.Morphs Namespace