RhinoCommon SDK
Cylinder Properties
Rhino for Mac 5.1
The Cylinder type exposes the following members.
Properties
Name | Description
Axis
 Gets the axis direction of the cylinder.
Center
 Gets the center point of the defining circle.
Height1
 Gets or sets the start height of the cylinder.
Height2
 Gets or sets the end height of the cylinder. If the end height equals the start height, the cylinder is presumed to be infinite.
IsFinite
 true if the cylinder is finite (Height0 != Height1) false if the cylinder is infinite.
IsValid
 Gets a boolean value indicating whether this cylinder is valid.
A valid cylinder is represented by a valid circle and two valid heights.
TotalHeight
 Gets the height of the cylinder. Infinite cylinders have a height of zero, not Double.PositiveInfinity.
Unset
 Gets an invalid Cylinder.
Top
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace