RhinoCommon SDK
Quaternion.SetRotation Method (Plane, Plane)
Rhino for Mac 5.1
 Sets the quaternion to the unit quaternion which rotates plane0.xaxis to plane1.xaxis, plane0.yaxis to plane1.yaxis, and plane0.zaxis to plane1.zaxis.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetRotation(
	Plane plane0,
	Plane plane1
)
Public Sub SetRotation (
	plane0 As Plane,
	plane1 As Plane
)
Parameters
plane0
Type: Rhino.Geometry.Plane
The "from" rotation plane. Origin point is ignored.
plane1
Type: Rhino.Geometry.Plane
The "to" rotation plane. Origin point is ignored.
Remarks
The plane origins are ignored
See Also
Reference
Quaternion Structure
SetRotation Overload
Rhino.Geometry Namespace