RhinoCommon SDK
File3dmObjectTable.AddClippingPlane Method (Plane, Double, Double, IEnumerable<Guid>, ObjectAttributes)
Rhino for Mac 5.1
 Adds a clipping plane object to Rhino.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddClippingPlane(
	Plane plane,
	double uMagnitude,
	double vMagnitude,
	IEnumerable<Guid> clippedViewportIds,
	ObjectAttributes attributes
)
Public Function AddClippingPlane (
	plane As Plane,
	uMagnitude As Double,
	vMagnitude As Double,
	clippedViewportIds As IEnumerable(Of Guid),
	attributes As ObjectAttributes
) As Guid
Parameters
plane
Type: Rhino.Geometry.Plane
A plane.
uMagnitude
Type: System.Double
The size in U direction.
vMagnitude
Type: System.Double
The size in V direction.
clippedViewportIds
Type: System.Collections.Generic.IEnumerable<Guid>
list of viewport ids that the new clipping plane will clip.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to point cloud.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddClippingPlane Overload
Rhino.FileIO Namespace