RhinoCommon SDK
PlugIn.ShouldCallWriteDocument Method
Rhino for Mac 5.1
 Called whenever a Rhino is about to save a .3dm file. If you want to save plug-in document data when a model is saved in a version 5 .3dm file, then you must override this function to return true and you must override WriteDocument().
Namespace: Rhino.PlugIns
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual bool ShouldCallWriteDocument(
	FileWriteOptions options
)
Protected Overridable Function ShouldCallWriteDocument (
	options As FileWriteOptions
) As Boolean
Parameters
options
Type: Rhino.FileIO.FileWriteOptions
The file write options, such as "include preview image" and "include render meshes".
Return Value
Type: Boolean
 true if the plug-in wants to save document user data in the version 5 .3dm file. The default returns false.
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace