RhinoCommon SDK
RTree Properties
Rhino for Mac 5.1
The RTree type exposes the following members.
Properties
Name | Description
Count
 Gets the number of items in this tree.
Top
See Also
Reference
RTree Class
Rhino.Geometry Namespace