RhinoCommon SDK
GroupTable.GroupName Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.GroupTable.GroupName(System.Int32)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string GroupName(
	int groupIndex
)
Public Function GroupName (
	groupIndex As Integer
) As String
Parameters
groupIndex
Type: System.Int32
[Missing <param name="groupIndex"/> documentation for "M:Rhino.DocObjects.Tables.GroupTable.GroupName(System.Int32)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.GroupTable.GroupName(System.Int32)"]
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace