RhinoCommon SDK
DisplayPipeline.DrawToBitmap Method
Rhino for Mac 5.1
 Draw a given viewport to an off-screen bitmap.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Bitmap DrawToBitmap(
	RhinoViewport viewport,
	int width,
	int height
)
Public Shared Function DrawToBitmap (
	viewport As RhinoViewport,
	width As Integer,
	height As Integer
) As Bitmap
Parameters
viewport
Type: Rhino.Display.RhinoViewport
Viewport to draw.
width
Type: System.Int32
Width of target image.
height
Type: System.Int32
Height of target image.
Return Value
Type: Bitmap
A bitmap containing the given view, or null on error.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace