RhinoCommon SDK
DisplayPipelineAttributes.ViewSpecificAttributes Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ViewSpecificAttributes"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DisplayPipelineAttributes.ViewDisplayAttributes ViewSpecificAttributes { get; }
Public ReadOnly Property ViewSpecificAttributes As DisplayPipelineAttributes.ViewDisplayAttributes
	Get
Property Value
Type: DisplayPipelineAttributes.ViewDisplayAttributes
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace