RhinoCommon SDK
Dialogs.ShowNumberBox Method (String, String, Double, Double, Double)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.Dialogs.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool ShowNumberBox(
	string title,
	string message,
	ref double number,
	double minimum,
	double maximum
)
Public Shared Function ShowNumberBox (
	title As String,
	message As String,
	ByRef number As Double,
	minimum As Double,
	maximum As Double
) As Boolean
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.Dialogs.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.Dialogs.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)"]
number
Type: System.Double
[Missing <param name="number"/> documentation for "M:Rhino.UI.Dialogs.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)"]
minimum
Type: System.Double
[Missing <param name="minimum"/> documentation for "M:Rhino.UI.Dialogs.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)"]
maximum
Type: System.Double
[Missing <param name="maximum"/> documentation for "M:Rhino.UI.Dialogs.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)"]
Return Value
Type: Boolean
 True if the dialog was closed with the OK button. False if the dialog was closed with escape.
See Also
Reference
Dialogs Class
ShowNumberBox Overload
Rhino.UI Namespace