RhinoCommon SDK
RhinoPageView.PageNumber Property
Rhino for Mac 5.1
 Gets or sets the runtime page number and updates the page number for all of the other pages. The first page has a value of 0
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int PageNumber { get; set; }
Public Property PageNumber As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace