RhinoCommon SDK
ArchivableDictionary.GetPoint3f Method (String, Point3f)
Rhino for Mac 5.1
 Get value as Point3f, will return defaultValue unless value was created using Set(string key, Point3f value)
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3f GetPoint3f(
	string key,
	Point3f defaultValue
)
Public Function GetPoint3f (
	key As String,
	defaultValue As Point3f
) As Point3f
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetPoint3f(System.String,Rhino.Geometry.Point3f)"]
defaultValue
Type: Rhino.Geometry.Point3f
[Missing <param name="defaultValue"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetPoint3f(System.String,Rhino.Geometry.Point3f)"]
Return Value
Type: Point3f
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetPoint3f(System.String,Rhino.Geometry.Point3f)"]
See Also
Reference
ArchivableDictionary Class
GetPoint3f Overload
Rhino.Collections Namespace