RhinoCommon SDK
ArchivableDictionary.GetPoint3d Method (String, Point3d)
Rhino for Mac 5.1
 Get value as Point3d, will return defaultValue unless value was created using Set(string key, Point3d value)
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d GetPoint3d(
	string key,
	Point3d defaultValue
)
Public Function GetPoint3d (
	key As String,
	defaultValue As Point3d
) As Point3d
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetPoint3d(System.String,Rhino.Geometry.Point3d)"]
defaultValue
Type: Rhino.Geometry.Point3d
[Missing <param name="defaultValue"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetPoint3d(System.String,Rhino.Geometry.Point3d)"]
Return Value
Type: Point3d
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetPoint3d(System.String,Rhino.Geometry.Point3d)"]
See Also
Reference
ArchivableDictionary Class
GetPoint3d Overload
Rhino.Collections Namespace