RhinoCommon SDK
DrawEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.DrawEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.DrawEventArgs
 More...
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class DrawEventArgs : EventArgs
Public Class DrawEventArgs
	Inherits EventArgs
The DrawEventArgs type exposes the following members.
Properties
Name | Description
Display
RhinoDoc
Viewport
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Display Namespace
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.DrawEventArgs
 Rhino.Display.CalculateBoundingBoxEventArgs
 Rhino.Display.CullObjectEventArgs
 Rhino.Display.DrawForegroundEventArgs
 Rhino.Display.DrawObjectEventArgs
 Rhino.DocObjects.Custom.GripsDrawEventArgs
 Rhino.Input.Custom.GetPointDrawEventArgs