RhinoCommon SDK
RhinoObject.UnselectAllSubObjects Method
Rhino for Mac 5.1
 Removes selection from all subobjects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int UnselectAllSubObjects()
Public Function UnselectAllSubObjects As Integer
Return Value
Type: Int32
The number of unselected subobjects.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace