RhinoCommon SDK
ComponentIndex.Unset Property
Rhino for Mac 5.1
 The unset value of component index.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ComponentIndex Unset { get; }
Public Shared ReadOnly Property Unset As ComponentIndex
	Get
Property Value
Type: ComponentIndex
See Also
Reference
ComponentIndex Structure
Rhino.Geometry Namespace