RhinoCommon SDK
InstanceDefinition.IsTenuous Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.IsTenuous"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsTenuous { get; }
Public ReadOnly Property IsTenuous As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace