RhinoCommon SDK
Circle.Rotate Method (Double, Double, Vector3d)
Rhino for Mac 5.1
 Rotates the circle around an axis that starts at the base plane origin.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Rotate(
	double sinAngle,
	double cosAngle,
	Vector3d axis
)
Public Function Rotate (
	sinAngle As Double,
	cosAngle As Double,
	axis As Vector3d
) As Boolean
Parameters
sinAngle
Type: System.Double
The value returned by Math.Sin(angle) to compose the rotation.
cosAngle
Type: System.Double
The value returned by Math.Cos(angle) to compose the rotation.
axis
Type: Rhino.Geometry.Vector3d
A rotation axis.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Circle Structure
Rotate Overload
Rhino.Geometry Namespace