RhinoCommon SDK
ExtrudeCornerType Enumeration
Rhino for Mac 5.1
 Corner types used for creating a tapered extrusion
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum ExtrudeCornerType
Public Enumeration ExtrudeCornerType
Members
Member name | Value | Description
None | 0 | No Corner
Sharp | 1
Round | 2
Smooth | 3
Chamfer | 4
See Also
Reference
Rhino.Geometry Namespace