RhinoCommon SDK
GetObject.SerialNumber Property
Rhino for Mac 5.1
 Each instance of GetObject has a unique runtime serial number that is used to identify object selection events associated with that instance.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public uint SerialNumber { get; }
Public ReadOnly Property SerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace