RhinoCommon SDK
FileType.Extension Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.FileIO.FileType.Extension"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Extension { get; }
Public ReadOnly Property Extension As String
	Get
Property Value
Type: String
See Also
Reference
FileType Class
Rhino.FileIO Namespace