RhinoCommon SDK
File3dmObjectTable.AddLeader Method (String, Plane, IEnumerable<Point2d>)
Rhino for Mac 5.1
 Adds an annotation leader to the document.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddLeader(
	string text,
	Plane plane,
	IEnumerable<Point2d> points
)
Public Function AddLeader (
	text As String,
	plane As Plane,
	points As IEnumerable(Of Point2d)
) As Guid
Parameters
text
Type: System.String
The text.
plane
Type: Rhino.Geometry.Plane
A plane.
points
Type: System.Collections.Generic.IEnumerable<Point2d>
A list, an array or any enumerable set of 2d points.
Return Value
Type: Guid
A unique identifier for the object; or Empty on failure.
See Also
Reference
File3dmObjectTable Class
AddLeader Overload
Rhino.FileIO Namespace