RhinoCommon SDK
File3dmObjectTable.AddLeader Method (IEnumerable<Point3d>)
Rhino for Mac 5.1
 Adds an annotation leader to the document. This overload is only provided in the Rhino SDK.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddLeader(
	IEnumerable<Point3d> points
)
Public Function AddLeader (
	points As IEnumerable(Of Point3d)
) As Guid
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable set of 2d points.
Return Value
Type: Guid
A unique identifier for the object; or Empty on failure.
See Also
Reference
File3dmObjectTable Class
AddLeader Overload
Rhino.FileIO Namespace