RhinoCommon SDK
CurveList.Transform Method
Rhino for Mac 5.1
 Transform all the curves in this list. If at least a single transform failed this function returns false.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to apply to all curves.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.CurveList.Transform(Rhino.Geometry.Transform)"]
See Also
Reference
CurveList Class
Rhino.Collections Namespace