RhinoCommon SDK
Curve.ExtendByLine Method
Rhino for Mac 5.1
 Extends a curve by a line until it intersects a collection of objects.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve ExtendByLine(
	CurveEnd side,
	IEnumerable<GeometryBase> geometry
)
Public Function ExtendByLine (
	side As CurveEnd,
	geometry As IEnumerable(Of GeometryBase)
) As Curve
Parameters
side
Type: Rhino.Geometry.CurveEnd
The end of the curve to extend.
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
A collection of objects. Allowable object types are Curve, Surface, Brep.
Return Value
Type: Curve
New extended curve result on success, null on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace