RhinoCommon SDK
BrepTrim.TrimType Property
Rhino for Mac 5.1
Type of trim
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepTrimType TrimType { get; set; }
Public Property TrimType As BrepTrimType
	Get
	Set
Property Value
Type: BrepTrimType
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace