RhinoCommon SDK
CustomUndoEventArgs.UndoSerialNumber Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Commands.CustomUndoEventArgs.UndoSerialNumber"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public uint UndoSerialNumber { get; }
Public ReadOnly Property UndoSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace