RhinoCommon SDK
Vector3f.PerpendicularTo Method
Rhino for Mac 5.1
 Sets this vector to be perpendicular to another vector. Result is not unitized.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PerpendicularTo(
	Vector3f other
)
Public Function PerpendicularTo (
	other As Vector3f
) As Boolean
Parameters
other
Type: Rhino.Geometry.Vector3f
Vector to use as guide.
Return Value
Type: Boolean
true on success, false if input vector is zero or invalid.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace