RhinoCommon SDK
Brep.IsValidTolerancesAndFlags Method
Rhino for Mac 5.1
 Expert user function that tests the brep to see if its tolerances and flags are valid. The values of brep.IsValidTopology() and brep.IsValidGeometry() must be true before brep.IsValidTolerancesAndFlags() can be safely called.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValidTolerancesAndFlags(
	out string log
)
Public Function IsValidTolerancesAndFlags (
	<OutAttribute> ByRef log As String
) As Boolean
Parameters
log
Type: System.String
 If the brep tolerance or flags are not valid, then a brief description of the problem in English is assigned to this out parameter. The information is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool. Otherwise, Empty.
Return Value
Type: Boolean
A value that indicates
See Also
Reference
Brep Class
Rhino.Geometry Namespace