RhinoCommon SDK
BoundingBox.FurthestPoint Method
Rhino for Mac 5.1
 Finds the furthest point on the Box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d FurthestPoint(
	Point3d point
)
Public Function FurthestPoint (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
Sample point.
Return Value
Type: Point3d
The point on the box that is furthest from the sample point.
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace