RhinoCommon SDK
Interval.Subtraction Operator (Interval, Double)
Rhino for Mac 5.1
 Shifts an interval by a specific amount (subtraction).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Interval operator -(
	Interval interval,
	double number
)
Public Shared Operator - (
	interval As Interval,
	number As Double
) As Interval
Parameters
interval
Type: Rhino.Geometry.Interval
The base interval (minuend).
number
Type: System.Double
The shifting value to be subtracted (subtrahend).
Return Value
Type: Interval
A new interval with [T0-number, T1-number].
See Also
Reference
Interval Structure
Subtraction Overload
Rhino.Geometry Namespace