RhinoCommon SDK
Line.Equals Method (Object)
Rhino for Mac 5.1
 Determines whether an object is a line that has the same value as this line.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
An object.
Return Value
Type: Boolean
true if obj is a Line and has the same coordinates as this; otherwise false.
See Also
Reference
Line Structure
Equals Overload
Rhino.Geometry Namespace