RhinoCommon SDK
DimensionStyle.AngleResolution Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AngleResolution"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AngleResolution { get; set; }
Public Property AngleResolution As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace