RhinoCommon SDK
ViewportInfo.SetFrustumNearFar Method (BoundingBox)
Rhino for Mac 5.1
 Sets the frustum near and far using a bounding box.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFrustumNearFar(
	BoundingBox boundingBox
)
Public Function SetFrustumNearFar (
	boundingBox As BoundingBox
) As Boolean
Parameters
boundingBox
Type: Rhino.Geometry.BoundingBox
A bounding box to use.
Return Value
Type: Boolean
true if operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
SetFrustumNearFar Overload
Rhino.DocObjects Namespace