RhinoCommon SDK
RhinoTransformObjectsEventArgs Class
Rhino for Mac 5.1
 EventArgs passed to RhinoDoc.BeforeTransform.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoTransformObjectsEventArgs
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class RhinoTransformObjectsEventArgs : EventArgs
Public Class RhinoTransformObjectsEventArgs
	Inherits EventArgs
The RhinoTransformObjectsEventArgs type exposes the following members.
Properties
Name | Description
ObjectCount
Objects
ObjectsWillBeCopied
Transform
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace