RhinoCommon SDK
Mesh.GetOutlines Method
Rhino for Mac 5.1
Overload List
Name | Description
GetOutlines(Plane)
 Constructs the outlines of a mesh projected against a plane.
GetOutlines(RhinoViewport)
 Constructs the outlines of a mesh. The projection information in the viewport is used to determine how the outlines are projected.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace