RhinoCommon SDK
DetailView.IsPerspectiveProjection Property
Rhino for Mac 5.1
 Gets or sets whether the view is perspective.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsPerspectiveProjection { get; set; }
Public Property IsPerspectiveProjection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DetailView Class
Rhino.Geometry Namespace