RhinoCommon SDK
BinaryArchiveReader.ReadUInt Method
Rhino for Mac 5.1
 Reads a UInt32 from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public uint ReadUInt()
Public Function ReadUInt As UInteger
Return Value
Type: UInt32
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace