RhinoCommon SDK
Interop.ToOnBrep Method
Rhino for Mac 5.1
 Constructs a Rhino_DotNet OnBrep that is a copy of a given brep.
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Object ToOnBrep(
	Brep source
)
Public Shared Function ToOnBrep (
	source As Brep
) As Object
Parameters
source
Type: Rhino.Geometry.Brep
A source brep.
Return Value
Type: Object
 Rhino_DotNet object on success. This will be an independent copy.
See Also
Reference
Interop Class
Rhino.Runtime Namespace