RhinoCommon SDK
Matrix.SwapRows Method
Rhino for Mac 5.1
 Exchanges two rows.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SwapRows(
	int rowA,
	int rowB
)
Public Function SwapRows (
	rowA As Integer,
	rowB As Integer
) As Boolean
Parameters
rowA
Type: System.Int32
A first row.
rowB
Type: System.Int32
Another row.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
See Also
Reference
Matrix Class
Rhino.Geometry Namespace