RhinoCommon SDK
DisplayPipelineAttributes.GetObjectData Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipelineAttributes.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
Public Overridable Sub GetObjectData (
	info As SerializationInfo,
	context As StreamingContext
)
Parameters
info
Type: System.Runtime.Serialization.SerializationInfo
[Missing <param name="info"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
context
Type: System.Runtime.Serialization.StreamingContext
[Missing <param name="context"/> documentation for "M:Rhino.Display.DisplayPipelineAttributes.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)"]
Implements
ISerializable.GetObjectData(SerializationInfo, StreamingContext)
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace