RhinoCommon SDK
ShowMessageButton Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageButton"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum ShowMessageButton
Public Enumeration ShowMessageButton
Members
Member name | Value | Description
OK | 0
OKCancel | 1
AbortRetryIgnore | 2
YesNoCancel | 3
YesNo | 4
RetryCancel | 5
See Also
Reference
Rhino.UI Namespace