RhinoCommon SDK
BinaryArchiveReader.ReadSingleArray Method
Rhino for Mac 5.1
 Reads an array of Single from the archive.
An array is returned even if the input was another enumerable type.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public float[] ReadSingleArray()
Public Function ReadSingleArray As Single()
Return Value
Type: Single[]
The array that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace