RhinoCommon SDK
SelCommand Properties
Rhino for Mac 5.1
The SelCommand type exposes the following members.
Properties
Name | Description
BeQuiet
TestGrips
TestLights
Top
See Also
Reference
SelCommand Class
Rhino.Commands Namespace