RhinoCommon SDK
File3dm.Notes Property
Rhino for Mac 5.1
 Gets or sets the model notes.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public File3dmNotes Notes { get; set; }
Public Property Notes As File3dmNotes
	Get
	Set
Property Value
Type: File3dmNotes
See Also
Reference
File3dm Class
Rhino.FileIO Namespace