RhinoCommon SDK
WaitCursor Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.WaitCursor"]
Inheritance Hierarchy
System.Object
 Rhino.UI.WaitCursor
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class WaitCursor : IDisposable
Public Class WaitCursor
	Implements IDisposable
The WaitCursor type exposes the following members.
Constructors
Name | Description
WaitCursor
Initializes a new instance of the WaitCursor class
Top
Methods
Name | Description
Clear
Dispose
Releases all resources used by the WaitCursor
Set
Top
See Also
Reference
Rhino.UI Namespace