RhinoCommon SDK
RhinoViewport.IsVisible Method
Rhino for Mac 5.1
Overload List
Name | Description
IsVisible(BoundingBox)
 Returns true if some portion of a world coordinate bounding box is potentially visible in the viewing frustum.
IsVisible(Point3d)
 Deterines if a world coordinate point is visible in the viewing frustum.
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace