RhinoCommon SDK
ObjectType Enumeration
Rhino for Mac 5.1
 Defines binary mask values for each object type that can be found in a document.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[FlagsAttribute]
public enum ObjectType
<FlagsAttribute>
Public Enumeration ObjectType
Members
Member name | Value | Description
None | 0 |  Nothing.
Point | 1 |  A point.
PointSet | 2 |  A point set or cloud.
Curve | 4 |  A curve.
Surface | 8 |  A surface.
Brep | 16 |  A brep.
Mesh | 32 |  A mesh.
Light | 256 |  A rendering light.
Annotation | 512 |  An annotation.
InstanceDefinition | 2048 |  A block definition.
InstanceReference | 4096 |  A block reference.
TextDot | 8192 |  A text dot.
Grip | 16384 | Selection filter value - not a real object type.
Detail | 32768 |  A detail.
Hatch | 65536 |  A hatch.
MorphControl | 131072 |  A morph control.
BrepLoop | 524288 |  A brep loop.
PolysrfFilter | 2097152 | Selection filter value - not a real object type.
EdgeFilter | 4194304 | Selection filter value - not a real object type.
PolyedgeFilter | 8388608 | Selection filter value - not a real object type.
MeshVertex | 16777216 |  A mesh vertex.
MeshEdge | 33554432 |  A mesh edge.
MeshFace | 67108864 |  A mesh face.
Cage | 134217728 |  A cage.
Phantom | 268435456 |  A phantom object.
ClipPlane | 536870912 |  A clipping plane.
Extrusion | 1073741824 |  An extrusion.
AnyObject | 4294967295 |  All bits set.
See Also
Reference
Rhino.DocObjects Namespace