RhinoCommon SDK
ObjectTable.MostRecentObject Method
Rhino for Mac 5.1
 Gets the most recently added object that is still in the Document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject MostRecentObject()
Public Function MostRecentObject As RhinoObject
Return Value
Type: RhinoObject
The most recent (non-deleted) object in the document, or null if no such object exists.
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace