RhinoCommon SDK
Layer.SetPersistentLocking Method
Rhino for Mac 5.1
 Set the persistent locking setting for this layer
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetPersistentLocking(
	bool persistentLocking
)
Public Sub SetPersistentLocking (
	persistentLocking As Boolean
)
Parameters
persistentLocking
Type: System.Boolean
[Missing <param name="persistentLocking"/> documentation for "M:Rhino.DocObjects.Layer.SetPersistentLocking(System.Boolean)"]
See Also
Reference
Layer Class
Rhino.DocObjects Namespace