RhinoCommon SDK
BrepFace.UnderlyingSurface Method
Rhino for Mac 5.1
 Gets the untrimmed surface that is the base of this face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface UnderlyingSurface()
Public Function UnderlyingSurface As Surface
Return Value
Type: Surface
A surface, or null on error.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace