RhinoCommon SDK
HostUtils.RegisterDynamicCommand Method
Rhino for Mac 5.1
 Adds a new dynamic command to Rhino.
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool RegisterDynamicCommand(
	PlugIn plugin,
	Command cmd
)
Public Shared Function RegisterDynamicCommand (
	plugin As PlugIn,
	cmd As Command
) As Boolean
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
Plugin that owns the command.
cmd
Type: Rhino.Commands.Command
Command to add.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace