RhinoCommon SDK
RhinoView.Floating Property
Rhino for Mac 5.1
 Floating state of RhinoView. if true, then the view will be in a floating frame window. Otherwise the view will be embeded in the main frame.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Floating { get; set; }
Public Property Floating As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoView Class
Rhino.Display Namespace