RhinoCommon SDK
SurfaceCurvature.OsculatingCircle Method
Rhino for Mac 5.1
 Computes the osculating circle along the given direction.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Circle OsculatingCircle(
	int direction
)
Public Function OsculatingCircle (
	direction As Integer
) As Circle
Parameters
direction
Type: System.Int32
Direction index, valid values are 0 and 1.
Return Value
Type: Circle
The osculating circle in the given direction or Circle.Unset on failure.
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace