RhinoCommon SDK
Curve.CreateTweenCurvesWithSampling Method
Rhino for Mac 5.1
 Creates curves between two open or closed input curves. Use sample points method to make curves compatible. This is how the algorithm workd: Divides the two curves into an equal number of points, finds the midpoint between the corresponding points on the curves and interpolates the tween curve through those points. There is no matching of curves direction. Caller must match input curves direction before calling the function.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] CreateTweenCurvesWithSampling(
	Curve curve0,
	Curve curve1,
	int numCurves,
	int numSamples
)
Public Shared Function CreateTweenCurvesWithSampling (
	curve0 As Curve,
	curve1 As Curve,
	numCurves As Integer,
	numSamples As Integer
) As Curve()
Parameters
curve0
Type: Rhino.Geometry.Curve
The first, or starting, curve.
curve1
Type: Rhino.Geometry.Curve
The second, or ending, curve.
numCurves
Type: System.Int32
Number of tween curves to create.
numSamples
Type: System.Int32
Number of sample points along input curves.
Return Value
Type: Curve[]
>An array of joint curves. This array can be empty.
See Also
Reference
Curve Class
Rhino.Geometry Namespace