RhinoCommon SDK
VisualAnalysisMode.ShowIsoCurves Property
Rhino for Mac 5.1
 Gets true if this visual analysis mode will show isocuves on shaded surface objects. Often a mode's user interface will provide a way to change this setting.
The default is false.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual bool ShowIsoCurves { get; }
Public Overridable ReadOnly Property ShowIsoCurves As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace