RhinoCommon SDK
StringTable.SetString Method (String, String)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.StringTable.SetString(System.String,System.String)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string SetString(
	string key,
	string value
)
Public Function SetString (
	key As String,
	value As String
) As String
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.DocObjects.Tables.StringTable.SetString(System.String,System.String)"]
value
Type: System.String
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.Tables.StringTable.SetString(System.String,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.StringTable.SetString(System.String,System.String)"]
See Also
Reference
StringTable Class
SetString Overload
Rhino.DocObjects.Tables Namespace