RhinoCommon SDK
RhinoGet.GetBool Method
Rhino for Mac 5.1
Easy to use bool getter.
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetBool(
	string prompt,
	bool acceptNothing,
	string offPrompt,
	string onPrompt,
	ref bool boolValue
)
Public Shared Function GetBool (
	prompt As String,
	acceptNothing As Boolean,
	offPrompt As String,
	onPrompt As String,
	ByRef boolValue As Boolean
) As Result
Parameters
prompt
Type: System.String
Command prompt.
acceptNothing
Type: System.Boolean
If true, the user can press enter.
offPrompt
Type: System.String
The 'false/off' message.
onPrompt
Type: System.String
The 'true/on' message.
boolValue
Type: System.Boolean
Default bool value set to this and returned here.
Return Value
Type: Result
The getter result based on user choice.
Commands.Result.Success - got value.
Commands.Result.Nothing - user pressed enter.
Commands.Result.Cancel - user cancelled value getting.
See Also
Reference
RhinoGet Class
Rhino.Input Namespace