RhinoCommon SDK
File3dmObjectTable.AddSphere Method
Rhino for Mac 5.1
Overload List
Name | Description
AddSphere(Sphere)
 Adds a surface object to the document representing a sphere.
AddSphere(Sphere, ObjectAttributes)
 Adds a surface object to the document representing a sphere.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace