RhinoCommon SDK
ObjectTable.ModifyAttributes Method (RhinoObject, ObjectAttributes, Boolean)
Rhino for Mac 5.1
 Modifies an object's attributes. Cannot be used to change object id.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ModifyAttributes(
	RhinoObject obj,
	ObjectAttributes newAttributes,
	bool quiet
)
Public Function ModifyAttributes (
	obj As RhinoObject,
	newAttributes As ObjectAttributes,
	quiet As Boolean
) As Boolean
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
object to modify.
newAttributes
Type: Rhino.DocObjects.ObjectAttributes
new attributes.
quiet
Type: System.Boolean
if true, then warning message boxes are disabled.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
ModifyAttributes Overload
Rhino.DocObjects.Tables Namespace