RhinoCommon SDK
RhinoViewport.GetDepth Method (BoundingBox, Double, Double)
Rhino for Mac 5.1
 Gets near and far clipping distances of a bounding box.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetDepth(
	BoundingBox bbox,
	out double nearDistance,
	out double farDistance
)
Public Function GetDepth (
	bbox As BoundingBox,
	<OutAttribute> ByRef nearDistance As Double,
	<OutAttribute> ByRef farDistance As Double
) As Boolean
Parameters
bbox
Type: Rhino.Geometry.BoundingBox
The bounding box.
nearDistance
Type: System.Double
The near distance is assigned to this out parameter during this call.
farDistance
Type: System.Double
The far distance is assigned to this out parameter during this call.
Return Value
Type: Boolean
 true if the bounding box intersects the view frustum and near_dist/far_dist were set. false if the bounding box does not intesect the view frustum.
See Also
Reference
RhinoViewport Class
GetDepth Overload
Rhino.Display Namespace