RhinoCommon SDK
GetBaseClass.AcceptColor Method
Rhino for Mac 5.1
 If you want to allow the user to be able to type in a color r,g,b or name during GetPoint.Get(), GetObject::GetObjects(), etc., then call AcceptColor(true) before calling GetPoint()/GetObject(). If the user chooses to type in a color, then the result code GetResult.Color is returned and you can use RhinoGet.Color() to get the value of the color. If the get accepts points, then the user will not be able to type in r,g,b colors but will be able to type color names.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AcceptColor(
	bool enable
)
Public Sub AcceptColor (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true if user is able to type a color.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace