RhinoCommon SDK
Polyline.DeleteShortSegments Method
Rhino for Mac 5.1
 Removes all points that are closer than tolerance to the previous point.
Start and end points are left intact.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int DeleteShortSegments(
	double tolerance
)
Public Function DeleteShortSegments (
	tolerance As Double
) As Integer
Parameters
tolerance
Type: System.Double
Vertices closer together than tolerance will be removed.
Return Value
Type: Int32
Number of points (and segments) removed.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace