RhinoCommon SDK
File3dm.ObjectTypeFilter Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.FileIO.File3dm.ObjectTypeFilter"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[FlagsAttribute]
public enum ObjectTypeFilter
<FlagsAttribute>
Public Enumeration ObjectTypeFilter
Members
Member name | Value | Description
None | 0
Point | 1 | some type of Point
Pointset | 2 | some type of PointCloud, PointGrid, ...
Curve | 4 | some type of Curve like LineCurve, NurbsCurve, etc.
Surface | 8 | some type of Surface like PlaneSurface, NurbsSurface, etc.
Brep | 16 | some type of Brep
Mesh | 32 | some type of Mesh
Annotation | 512 | some type of Annotation
InstanceDefinition | 2048 | some type of InstanceDefinition
InstanceReference | 4096 | some type of InstanceReference
TextDot | 8192 | some type of TextDot
DetailView | 32768 | some type of DetailView
Hatch | 65536 | some type of Hatch
Extrusion | 1073741824 | some type of Extrusion
Any | 4294967295
See Also
Reference
Rhino.FileIO Namespace