RhinoCommon SDK
MeshVertexList Methods
Rhino for Mac 5.1
The MeshVertexList type exposes the following members.
Methods
Name | Description
Add(Point3d)
 Adds a new vertex to the end of the Vertex list.
Add(Point3f)
 Adds a new vertex to the end of the Vertex list.
Add(Double, Double, Double)
 Adds a new vertex to the end of the Vertex list.
Add(Single, Single, Single)
 Adds a new vertex to the end of the Vertex list.
AddVertices(IEnumerable<Point3d>)
 Adds a series of new vertices to the end of the vertex list.
This overload accepts double-precision points.
AddVertices(IEnumerable<Point3f>)
 Adds a series of new vertices to the end of the vertex list.
This overload accepts single-precision points.
Clear
 Clear the Vertex list on the mesh.
CombineIdentical
 Merges identical vertices.
CullUnused
 Removes all vertices that are currently not used by the Face list.
GetConnectedVertices
 Gets indices of all vertices that form "edges" with a given vertex index.
GetEnumerator
 Gets an enumerator that yields all mesh vertices (points) in this collection.
GetTopologicalIndenticalVertices
 Gets a list of other vertices which are "topologically" identical to this vertex.
GetVertexFaces
 Gets a list of all of the faces that share a given vertex.
Hide
 Hides the vertex at the given index.
HideAll
 Hides all vertices in the mesh.
IsHidden
 Gets a value indicating whether or not a vertex is hidden.
Remove(IEnumerable<Int32>, Boolean)
 Removes the vertices at the given indices and all faces that reference those vertices.
Remove(Int32, Boolean)
 Removes the vertex at the given index and all faces that reference that index.
SetVertex(Int32, Point3d)
 Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
SetVertex(Int32, Point3f)
 Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
SetVertex(Int32, Double, Double, Double)
 Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
SetVertex(Int32, Single, Single, Single)
 Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
Show
 Shows the vertex at the given index.
ShowAll
 Shows all vertices in the mesh.
ToFloatArray
 Copies all vertices to a linear array of float in x,y,z order
ToPoint3dArray
 Copies all vertices to a new array of Point3d.
ToPoint3fArray
 Copies all vertices to a new array of Point3f.
Top
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace