RhinoCommon SDK
Curve.ProjectToPlane Method
Rhino for Mac 5.1
 Constructs a curve by projecting an existing curve to a plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve ProjectToPlane(
	Curve curve,
	Plane plane
)
Public Shared Function ProjectToPlane (
	curve As Curve,
	plane As Plane
) As Curve
Parameters
curve
Type: Rhino.Geometry.Curve
A curve.
plane
Type: Rhino.Geometry.Plane
A plane.
Return Value
Type: Curve
The projected curve on success; null on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace