RhinoCommon SDK
IntersectionEvent.PointB Property
Rhino for Mac 5.1
 Gets the point on Curve B (or Surface B) where the intersection occured. If the intersection type is overlap, then this will return the start of the overlap region.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointB { get; }
Public ReadOnly Property PointB As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace