RhinoCommon SDK
DetailView.IsParallelProjection Property
Rhino for Mac 5.1
 Gets or sets whether the view is parallel.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsParallelProjection { get; set; }
Public Property IsParallelProjection As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DetailView Class
Rhino.Geometry Namespace