RhinoCommon SDK
ReplayHistoryResult.UpdateToHatch Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToHatch(Rhino.Geometry.Hatch,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToHatch(
	Hatch hatch,
	ObjectAttributes attributes
)
Public Function UpdateToHatch (
	hatch As Hatch,
	attributes As ObjectAttributes
) As Boolean
Parameters
hatch
Type: Rhino.Geometry.Hatch
[Missing <param name="hatch"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToHatch(Rhino.Geometry.Hatch,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToHatch(Rhino.Geometry.Hatch,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToHatch(Rhino.Geometry.Hatch,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace