RhinoCommon SDK
CachedTextureCoordinates.IsReadOnly Property
Rhino for Mac 5.1
 This collection is always read-only
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsReadOnly { get; }
Public ReadOnly Property IsReadOnly As Boolean
	Get
Property Value
Type: Boolean
Implements
ICollection<T>.IsReadOnly
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace