RhinoCommon SDK
Quaternion.GetRotation Method (Double, Vector3d)
Rhino for Mac 5.1
 Returns the rotation defined by the quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetRotation(
	out double angle,
	out Vector3d axis
)
Public Function GetRotation (
	<OutAttribute> ByRef angle As Double,
	<OutAttribute> ByRef axis As Vector3d
) As Boolean
Parameters
angle
Type: System.Double
An angle in radians.
axis
Type: Rhino.Geometry.Vector3d
unit axis of rotation of 0 if (b,c,d) is the zero vector.
Return Value
Type: Boolean
True if the operation succeeded; otherwise, false.
Remarks
 If the quaternion is not unitized, the rotation of its unitized form is returned.
See Also
Reference
Quaternion Structure
GetRotation Overload
Rhino.Geometry Namespace