RhinoCommon SDK
Surface.IsCylinder Method
Rhino for Mac 5.1
Overload List
Name | Description
IsCylinder()
 Determines if the surface is a portion of a cylinder within RhinoMath.ZeroTolerance.
IsCylinder(Double)
Determines if the surface is a portion of a cylinder within a given tolerance.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace