RhinoCommon SDK
SweepOneRail.PerformSweep Method (Curve, Curve, Double)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] PerformSweep(
	Curve rail,
	Curve crossSection,
	double crossSectionParameter
)
Public Function PerformSweep (
	rail As Curve,
	crossSection As Curve,
	crossSectionParameter As Double
) As Brep()
Parameters
rail
Type: Rhino.Geometry.Curve
[Missing <param name="rail"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)"]
crossSection
Type: Rhino.Geometry.Curve
[Missing <param name="crossSection"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)"]
crossSectionParameter
Type: System.Double
[Missing <param name="crossSectionParameter"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)"]
Return Value
Type: Brep[]
[Missing <returns> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)"]
See Also
Reference
SweepOneRail Class
PerformSweep Overload
Rhino.Geometry Namespace