RhinoCommon SDK
SporphSpaceMorph Properties
Rhino for Mac 5.1
The SporphSpaceMorph type exposes the following members.
Properties
Name | Description
IsValid
 Returns true if the space morph definition is valid, false otherwise.
Top
See Also
Reference
SporphSpaceMorph Class
Rhino.Geometry.Morphs Namespace