RhinoCommon SDK
Layer.UnsetPersistentVisibility Method
Rhino for Mac 5.1
 Remove any explicit persistent visibility setting from this layer
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void UnsetPersistentVisibility()
Public Sub UnsetPersistentVisibility
See Also
Reference
Layer Class
Rhino.DocObjects Namespace