RhinoCommon SDK
ObjectTable.Replace Method (Guid, Circle)
Rhino for Mac 5.1
Replaces one object with new curve object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	Guid objectId,
	Circle circle
)
Public Function Replace (
	objectId As Guid,
	circle As Circle
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
circle
Type: Rhino.Geometry.Circle
new circle to be added. The circle is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace