RhinoCommon SDK
DimStyleTable Methods
Rhino for Mac 5.1
The DimStyleTable type exposes the following members.
Methods
Name | Description
Add(String)
 Adds a new dimension style to the document. The new dimension style will be initialized with the current default dimension style properties.
Add(String, Boolean)
 Adds a new dimension style to the document. The new dimension style will be initialized with the current default dimension style properties.
DeleteDimensionStyle
Find
GetEnumerator
GetUnusedDimensionStyleName
SetCurrentDimensionStyleIndex
Top
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace