RhinoCommon SDK
Font Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Font"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Font
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class Font
Public Class Font
The Font type exposes the following members.
Properties
Name | Description
Bold
FaceName
Italic
Top
Methods
Name | Description
AvailableFontFaceNames
Top
See Also
Reference
Rhino.DocObjects Namespace