RhinoCommon SDK
ObjectTable.Select Method (IEnumerable<ObjRef>, Boolean)
Rhino for Mac 5.1
 Selects or deselects a collection of objects.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Select(
	IEnumerable<ObjRef> objRefs,
	bool select
)
Public Function Select (
	objRefs As IEnumerable(Of ObjRef),
	select As Boolean
) As Integer
Parameters
objRefs
Type: System.Collections.Generic.IEnumerable<ObjRef>
References to objects to select or deselect.
select
Type: System.Boolean
 If true, objects will be selected. If false, objects will be deselected.
Return Value
Type: Int32
Number of objects successfully selected or deselected.
See Also
Reference
ObjectTable Class
Select Overload
Rhino.DocObjects.Tables Namespace