RhinoCommon SDK
PolyCurve.SegmentIndexes Method
Rhino for Mac 5.1
Finds the segments that overlap the Polycurve sub domain.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int SegmentIndexes(
	Interval subdomain,
	out int segmentIndex0,
	out int segmentIndex1
)
Public Function SegmentIndexes (
	subdomain As Interval,
	<OutAttribute> ByRef segmentIndex0 As Integer,
	<OutAttribute> ByRef segmentIndex1 As Integer
) As Integer
Parameters
subdomain
Type: Rhino.Geometry.Interval
Domain on this PolyCurve.
segmentIndex0
Type: System.Int32
 Index of first segment that overlaps the subdomain.
segmentIndex1
Type: System.Int32
 Index of last segment that overlaps the subdomain. Note that segmentIndex0 <= i < segmentIndex1.
Return Value
Type: Int32
Number of segments that overlap the subdomain.
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace