RhinoCommon SDK
ColorLAB Structure
Rhino for Mac 5.1
 Represents a LAB (Lightness, A, B) color with double precision floating point channels. LAB colors are based on nonlinearly compressed CIE XYZ color space coordinates. The A and B parameters of a LAB color represent the opponents.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct ColorLAB
<SerializableAttribute>
Public Structure ColorLAB
The ColorLAB type exposes the following members.
Constructors
Name | Description
ColorLAB(Color)
 Constructs a new instance of ColorLAB that is equivalent to an RGB color.
ColorLAB(Double, Double, Double)
 Constructs a new instance of ColorLAB with custom channel values.
ColorLAB(Double, Double, Double, Double)
 Constructs a new instance of ColorLAB with custom channel values.
Top
Properties
Name | Description
A
 Gets or sets the Base channel. The channel is limited to 0~1.
Alpha
 Gets or sets the Alpha channel. The channel is limited to 0~1.
B
 Gets or sets the Opponent channel. The channel is limited to 0~1.
L
 Gets or sets the lightness channel. The channel is limited to 0~1.
Top
Methods
Name | Description
CreateFromCMYK
 Create the nearest LAB equivalent of a CMYK color.
CreateFromHSL
 Create the nearest LAB equivalent of an HSL color.
CreateFromLCH
 Create the nearest LAB equivalent of an LCH color.
CreateFromXYZ
 Create the nearest LAB equivalent of an XYZ color.
Top
Operators
Name | Description
Implicit(ColorLAB to Color)
 Implicitly converts a LAB color into a .Net library color.
Top
See Also
Reference
Rhino.Display Namespace