RhinoCommon SDK
AnnotationObjectBase Class
Rhino for Mac 5.1
 Provides a base class for AnnotationBase-derived objects that are placed in a document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.AnnotationObjectBase
 Rhino.DocObjects.AngularDimensionObject
 Rhino.DocObjects.LeaderObject
 Rhino.DocObjects.LinearDimensionObject
 Rhino.DocObjects.RadialDimensionObject
 Rhino.DocObjects.TextObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class AnnotationObjectBase : RhinoObject
Public Class AnnotationObjectBase
	Inherits RhinoObject
The AnnotationObjectBase type exposes the following members.
Properties
Name | Description
DisplayText
 Gets the text that is displayed to users.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace