RhinoCommon SDK
MeshVertexNormalList.Flip Method
Rhino for Mac 5.1
 Reverses direction of all vertex normals
This is the same as Mesh.Flip(true, false, false)
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Flip()
Public Sub Flip
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace