RhinoCommon SDK
RhinoObject.IsHighlighted Method
Rhino for Mac 5.1
Check highlight state.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int IsHighlighted(
	bool checkSubObjects
)
Public Function IsHighlighted (
	checkSubObjects As Boolean
) As Integer
Parameters
checkSubObjects
Type: System.Boolean
 If true and the entire object is not highlighted, and some subset of the object is highlighted, like some edges of a surface, then 3 is returned. If false and the entire object is not highlighted, then zero is returned.
Return Value
Type: Int32
0: object is not highlighted.
1: entire object is highlighted.
3: one or more proper sub-objects are highlighted.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace