RhinoCommon SDK
Curve.DivideEquidistant Method
Rhino for Mac 5.1
 Calculates 3d points on a curve where the linear distance between the points is equal.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d[] DivideEquidistant(
	double distance
)
Public Function DivideEquidistant (
	distance As Double
) As Point3d()
Parameters
distance
Type: System.Double
The distance betwen division points.
Return Value
Type: Point3d[]
An array of equidistant points, or null on error.
See Also
Reference
Curve Class
Rhino.Geometry Namespace