RhinoCommon SDK
MaterialRefs.Count Property
Rhino for Mac 5.1
 Gets the number of elements contained in this dictionary
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace