RhinoCommon SDK
MeshVertexNormalList Class
Rhino for Mac 5.1
 Provides access to the Vertex Normals of a Mesh.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.MeshVertexNormalList
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MeshVertexNormalList : IEnumerable<Vector3f>,
	IEnumerable
Public Class MeshVertexNormalList
	Implements IEnumerable(Of Vector3f), IEnumerable
The MeshVertexNormalList type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of mesh vertex normals.
Item
 Gets or sets the vertex at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
Methods
Name | Description
Add(Vector3d)
 Adds a new vertex normal at the end of the list.
Add(Vector3f)
 Adds a new vertex normal at the end of the list.
Add(Double, Double, Double)
 Adds a new vertex normal at the end of the list.
Add(Single, Single, Single)
 Adds a new vertex normal at the end of the list.
AddRange
 Appends a collection of normal vectors.
Clear
 Clears the vertex normal collection on the mesh.
ComputeNormals
 Computes the vertex normals based on the physical shape of the mesh.
Flip
 Reverses direction of all vertex normals
This is the same as Mesh.Flip(true, false, false)
GetEnumerator
 Gets an enumerator that yields all normals (vectors) in this collection.
SetNormal(Int32, Vector3d)
 Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.
If [index] equals [Count], a new vertex normal is appended to the end of the list.
If [index] is larger than [Count], the function will return false.
SetNormal(Int32, Vector3f)
 Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.
If [index] equals [Count], a new vertex normal is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
SetNormal(Int32, Double, Double, Double)
 Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.
If [index] equals [Count], a new vertex normal is appended to the end of the list.
If [index] is larger than [Count], the function will return false.
SetNormal(Int32, Single, Single, Single)
 Sets or adds a normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.
If [index] equals [Count], a new vertex normal is appended to the end of the list.
If [index] is larger than [Count], the function will return false.
SetNormals
 Sets all normal vectors in one go. This method destroys the current normal array if it exists.
UnitizeNormals
 Unitizes all vertex normals.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace