RhinoCommon SDK
Dialogs.ShowColorDialog Method (Color, Boolean, String)
Rhino for Mac 5.1
 Display Rhino's color selection dialog.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool ShowColorDialog(
	ref Color color,
	bool includeButtonColors,
	string dialogTitle
)
Public Shared Function ShowColorDialog (
	ByRef color As Color,
	includeButtonColors As Boolean,
	dialogTitle As String
) As Boolean
Parameters
color
Type: System.Drawing.Color
 [in/out] Default color for dialog, and will receive new color if function returns true.
includeButtonColors
Type: System.Boolean
 Display button face and text options at top of named color list.
dialogTitle
Type: System.String
The title of the dialog.
Return Value
Type: Boolean
true if the color changed. false if the color has not changed or the user pressed cancel.
See Also
Reference
Dialogs Class
ShowColorDialog Overload
Rhino.UI Namespace