RhinoCommon SDK
BrepEdge.SetEdgeCurve Method (Int32)
Rhino for Mac 5.1
 Set 3d curve geometry used by a b-rep edge.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetEdgeCurve(
	int curve3dIndex
)
Public Function SetEdgeCurve (
	curve3dIndex As Integer
) As Boolean
Parameters
curve3dIndex
Type: System.Int32
index of 3d curve in m_C3[] array
Return Value
Type: Boolean
true if successful
See Also
Reference
BrepEdge Class
SetEdgeCurve Overload
Rhino.Geometry Namespace