RhinoCommon SDK
MeshTextureCoordinateList.SetTextureCoordinates Method (TextureMapping)
Rhino for Mac 5.1
 Set all texture coordinates based on a texture mapping function
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetTextureCoordinates(
	TextureMapping mapping
)
Public Function SetTextureCoordinates (
	mapping As TextureMapping
) As Boolean
Parameters
mapping
Type: Rhino.Render.TextureMapping
The new mapping type.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshTextureCoordinateList Class
SetTextureCoordinates Overload
Rhino.Geometry.Collections Namespace