RhinoCommon SDK
InstanceDefinitionTable.UndoModify Method
Rhino for Mac 5.1
 Restores the instance definition to its previous state, if the instance definition has been modified and the modification can be undone.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UndoModify(
	int idefIndex
)
Public Function UndoModify (
	idefIndex As Integer
) As Boolean
Parameters
idefIndex
Type: System.Int32
The index of the instance definition to be restored.
Return Value
Type: Boolean
true if operation succeeded.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace