RhinoCommon SDK
ObjectTable.Unlock Method (Guid, Boolean)
Rhino for Mac 5.1
 If Object().IsLocked() is true, then the object will be returned to normal (visible and selectable) mode.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Unlock(
	Guid objectId,
	bool ignoreLayerMode
)
Public Function Unlock (
	objectId As Guid,
	ignoreLayerMode As Boolean
) As Boolean
Parameters
objectId
Type: System.Guid
Id of locked object to unlock.
ignoreLayerMode
Type: System.Boolean
 if true, the object will be unlocked even if it is on a layer that is locked or off.
Return Value
Type: Boolean
true if the object was successfully unlocked.
See Also
Reference
ObjectTable Class
Unlock Overload
Rhino.DocObjects.Tables Namespace