RhinoCommon SDK
RhinoObject.IsActiveInViewport Method
Rhino for Mac 5.1
 Determine if this object is active in a particular viewport.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual bool IsActiveInViewport(
	RhinoViewport viewport
)
Public Overridable Function IsActiveInViewport (
	viewport As RhinoViewport
) As Boolean
Parameters
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.DocObjects.RhinoObject.IsActiveInViewport(Rhino.Display.RhinoViewport)"]
Return Value
Type: Boolean
True if the object is active in viewport
Remarks
 The default implementation tests for space and viewport id. This handles things like testing if a page space object is visible in a modeling view.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace