RhinoCommon SDK
ColorXYZ Constructor (Double, Double, Double, Double)
Rhino for Mac 5.1
 Constructs a new instance of ColorXYZ with custom channel values.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ColorXYZ(
	double alpha,
	double x,
	double y,
	double z
)
Public Sub New (
	alpha As Double,
	x As Double,
	y As Double,
	z As Double
)
Parameters
alpha
Type: System.Double
Alpha channel value, channel will be limited to 0~1.
x
Type: System.Double
X channel value, channel will be limited to 0~1.
y
Type: System.Double
Y channel value, channel will be limited to 0~1.
z
Type: System.Double
Z channel value, channel will be limited to 0~1.
See Also
Reference
ColorXYZ Structure
ColorXYZ Overload
Rhino.Display Namespace