RhinoCommon SDK
ZBufferCapture.MinZ Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.MinZ"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public float MinZ()
Public Function MinZ As Single
Return Value
Type: Single
[Missing <returns> documentation for "M:Rhino.Display.ZBufferCapture.MinZ"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace