RhinoCommon SDK
DimStyleTable.GetUnusedDimensionStyleName Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.GetUnusedDimensionStyleName"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string GetUnusedDimensionStyleName()
Public Function GetUnusedDimensionStyleName As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.GetUnusedDimensionStyleName"]
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace