RhinoCommon SDK
IntersectionEvent Constructor
Rhino for Mac 5.1
Initializes a new instance of the IntersectionEvent class
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IntersectionEvent()
Public Sub New
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace