RhinoCommon SDK
GetObject.EnablePostSelect Method
Rhino for Mac 5.1
 Control the availability of post selection in GetObjects.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnablePostSelect(
	bool enable
)
Public Sub EnablePostSelect (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
[Missing <param name="enable"/> documentation for "M:Rhino.Input.Custom.GetObject.EnablePostSelect(System.Boolean)"]
Remarks
 By default, if no valid input is pre-selected when GetObjects is called, then the user is given the chance to post select. If you want to force the user to pre-select, then call EnablePostSelect(false).
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace