RhinoCommon SDK
Curve.ToNurbsCurve Method (Interval)
Rhino for Mac 5.1
 Constructs a NURBS curve representation of this curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsCurve ToNurbsCurve(
	Interval subdomain
)
Public Function ToNurbsCurve (
	subdomain As Interval
) As NurbsCurve
Parameters
subdomain
Type: Rhino.Geometry.Interval
The NURBS representation for this portion of the curve is returned.
Return Value
Type: NurbsCurve
NURBS representation of the curve on success, null on failure.
See Also
Reference
Curve Class
ToNurbsCurve Overload
Rhino.Geometry Namespace