RhinoCommon SDK
StatusBar.ShowProgressMeter Method
Rhino for Mac 5.1
 Starts, or shows, Rhino's status bar progress meter.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static int ShowProgressMeter(
	int lowerLimit,
	int upperLimit,
	string label,
	bool embedLabel,
	bool showPercentComplete
)
Public Shared Function ShowProgressMeter (
	lowerLimit As Integer,
	upperLimit As Integer,
	label As String,
	embedLabel As Boolean,
	showPercentComplete As Boolean
) As Integer
Parameters
lowerLimit
Type: System.Int32
The lower limit of the progress meter's range.
upperLimit
Type: System.Int32
The upper limit of the progress meter's range.
label
Type: System.String
The short description of the progress (e.g. "Calculating", "Meshing", etc)
embedLabel
Type: System.Boolean
 If true, then the label will be embeded in the progress meter. If false, then the label will appear to the left of the progress meter.
showPercentComplete
Type: System.Boolean
 If true, then the percent complete will appear in the progress meter.
Return Value
Type: Int32
 1 - The progress meter was created successfully. 0 - The progress meter was not created. -1 - The progress meter was not created because some other process has already created it.
See Also
Reference
StatusBar Class
Rhino.UI Namespace