RhinoCommon SDK
CustomObjectGrips.OwnerObject Property
Rhino for Mac 5.1
Owner of the grips.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject OwnerObject { get; }
Public ReadOnly Property OwnerObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
CustomObjectGrips Class
Rhino.DocObjects.Custom Namespace