RhinoCommon SDK
SerializationOptions Class
Rhino for Mac 5.1
 Contains options for serializing -or storing- data, such as Rhino version and user data.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.SerializationOptions
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class SerializationOptions
Public Class SerializationOptions
The SerializationOptions type exposes the following members.
Constructors
Name | Description
SerializationOptions
 Initializes a new instance of the SerializationOptions class.
Top
Properties
Name | Description
RhinoVersion
 Gets or sets a value indicating the Rhino version.
WriteUserData
 Gets or sets a value indicating whether to write user data.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace