RhinoCommon SDK
DisplayPipeline.DrawCircle Method (Circle, Color, Int32)
Rhino for Mac 5.1
 Draw a single circle object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawCircle(
	Circle circle,
	Color color,
	int thickness
)
Public Sub DrawCircle (
	circle As Circle,
	color As Color,
	thickness As Integer
)
Parameters
circle
Type: Rhino.Geometry.Circle
Circle to draw.
color
Type: System.Drawing.Color
Color to draw with.
thickness
Type: System.Int32
Thickness (in pixels) of circle.
See Also
Reference
DisplayPipeline Class
DrawCircle Overload
Rhino.Display Namespace