RhinoCommon SDK
MaterialRefCreateParams.MaterialSource Property
Rhino for Mac 5.1
 Determines if the simple material should come from the object or from it's layer.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectMaterialSource MaterialSource { get; set; }
Public Property MaterialSource As ObjectMaterialSource
	Get
	Set
Property Value
Type: ObjectMaterialSource
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace