RhinoCommon SDK
RhinoViewport.GetCameraFrame Method
Rhino for Mac 5.1
 Gets the camera plane.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetCameraFrame(
	out Plane frame
)
Public Function GetCameraFrame (
	<OutAttribute> ByRef frame As Plane
) As Boolean
Parameters
frame
Type: Rhino.Geometry.Plane
A plane is assigned to this out parameter during the call, if the operation succeeded.
Return Value
Type: Boolean
true if current camera orientation is valid.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace