RhinoCommon SDK
Mesh.GetNakedEdgePointStatus Method
Rhino for Mac 5.1
 Returns an array of bool values equal in length to the number of vertices in this mesh. Each value corresponds to a mesh vertex and is set to true if the vertex is not completely surrounded by faces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool[] GetNakedEdgePointStatus()
Public Function GetNakedEdgePointStatus As Boolean()
Return Value
Type: Boolean[]
An array of true/false flags that, at each index, reveals if the corresponding vertex is completely surrounded by faces.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace