RhinoCommon SDK
PointCloud.ClearHiddenFlags Method
Rhino for Mac 5.1
 Destroys the hidden flag information in this point cloud.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void ClearHiddenFlags()
Public Sub ClearHiddenFlags
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace