RhinoCommon SDK
ObjectTable.AddPoint Method
Rhino for Mac 5.1
Overload List
Name | Description
AddPoint(Point3d)
Adds a point object to the document.
AddPoint(Point3f)
Adds a point object to the document.
AddPoint(Point3d, ObjectAttributes)
Adds a point object to the document.
AddPoint(Point3f, ObjectAttributes)
Adds a point object to the document.
AddPoint(Double, Double, Double)
 Adds a point object to the document.
AddPoint(Point3d, ObjectAttributes, HistoryRecord, Boolean)
Adds a point object to the document
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace