RhinoCommon SDK
Ray3d.Equals Method (Ray3d)
Rhino for Mac 5.1
 Determines whether the specified Ray3d has the same value as the present ray.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Equals(
	Ray3d ray
)
Public Function Equals (
	ray As Ray3d
) As Boolean
Parameters
ray
Type: Rhino.Geometry.Ray3d
The specified ray.
Return Value
Type: Boolean
true if ray has the same position and direction as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Ray3d Structure
Equals Overload
Rhino.Geometry Namespace