RhinoCommon SDK
File3dmTypeCodes.TCODE_ANONYMOUS_CHUNK Field
Rhino for Mac 5.1
(TCODE_USER | TCODE_CRC | 0x0000)
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_ANONYMOUS_CHUNK
Public Const TCODE_ANONYMOUS_CHUNK As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace