RhinoCommon SDK
Curve.DivideByLength Method
Rhino for Mac 5.1
Overload List
Name | Description
DivideByLength(Double, Boolean)
 Divide the curve into specific length segments.
DivideByLength(Double, Boolean, Point3d[])
 Divide the curve into specific length segments.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace