RhinoCommon SDK
PolyCurve.IsNested Property
Rhino for Mac 5.1
 Gets a value indicating whether or not a PolyCurve contains nested PolyCurves.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsNested { get; }
Public ReadOnly Property IsNested As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace
PolyCurve.RemoveNesting()