RhinoCommon SDK
Extrusion.CapCount Property
Rhino for Mac 5.1
 Gets the amount of capping surfaces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int CapCount { get; }
Public ReadOnly Property CapCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace