RhinoCommon SDK
ParticleSystem.DisplaySizesInWorldUnits Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Geometry.ParticleSystem.DisplaySizesInWorldUnits"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DisplaySizesInWorldUnits { get; set; }
Public Property DisplaySizesInWorldUnits As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace