RhinoCommon SDK
BrepVertex Methods
Rhino for Mac 5.1
The BrepVertex type exposes the following members.
Methods
Name | Description
EdgeIndices
 Gets the indices of all edges associated with this vertex.
Top
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace