RhinoCommon SDK
ConstructionPlane.Name Property
Rhino for Mac 5.1
 Gets or sets the name of the grid.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace