RhinoCommon SDK
ReplayHistoryData Methods
Rhino for Mac 5.1
The ReplayHistoryData type exposes the following members.
Methods
Name | Description
Dispose
GetRhinoObjRef
 In ReplayHistory, use GetRhinoObjRef to convert the information in a history record into the ObjRef that has up to date RhinoObject pointers
TryGetBool
TryGetColor
TryGetDouble
TryGetGuid
TryGetInt
TryGetPoint3d
TryGetString
TryGetTransform
TryGetVector3d
Top
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace