RhinoCommon SDK
Surface.IsTorus Method
Rhino for Mac 5.1
Determines if the surface is a portion of a torus within RhinoMath.ZeroTolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsTorus()
Public Function IsTorus As Boolean
Return Value
Type: Boolean
true if the surface is a portion of a torus.
See Also
Reference
Surface Class
IsTorus Overload
Rhino.Geometry Namespace