RhinoCommon SDK
LinetypeTable Methods
Rhino for Mac 5.1
The LinetypeTable type exposes the following members.
Methods
Name | Description
Add(Linetype)
 Adds a new linetype with specified definition to the linetype table.
Add(String, IEnumerable<Double>)
 Adds a new linetype with specified definition to the linetype table.
AddReferenceLinetype
 Adds a reference linetypes that will not be saved in files.
Delete(IEnumerable<Int32>, Boolean)
Deletes multiple linetypes.
Delete(Int32, Boolean)
Deletes linetype.
Find(Guid, Boolean)
Finds a linetype with a matching ID.
Find(String, Boolean)
Finds the linetype with a given name.
GetEnumerator
GetUnusedLinetypeName
 Gets unused linetype name used as default when creating new linetypes.
LinetypeIndexForObject
 Returns the effective linetype index to be used to find the linetype definition to draw an object. If an object's linetype source is LinetypeFromObject, the linetype index in the object's attributes is used. If an object's linetype source is LinetypeFromLayer the linetype index from the object's layer is used.
Modify
Modify linetype settings.
SetCurrentLinetypeIndex
 At all times, there is a "current" linetype. Unless otherwise specified, new objects are assigned to the current linetype. The current linetype is never deleted.
Undelete
Restores a linetype that has been deleted.
UndoModify
 If the linetype has been modified and the modifcation can be undone, then UndoModify() will restore the linetype to its previous state.
Top
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace