RhinoCommon SDK
GeometryBase.GetUserStrings Method
Rhino for Mac 5.1
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NameValueCollection GetUserStrings()
Public Function GetUserStrings As NameValueCollection
Return Value
Type: NameValueCollection
A new collection.
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace