RhinoCommon SDK
File3dmObjectTable.Delete Method (File3dmObject)
Rhino for Mac 5.1
 Deletes object from document.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Delete(
	File3dmObject obj
)
Public Function Delete (
	obj As File3dmObject
) As Boolean
Parameters
obj
Type: Rhino.FileIO.File3dmObject
The object to delete.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
File3dmObjectTable Class
Delete Overload
Rhino.FileIO Namespace