RhinoCommon SDK
Curve.ProjectToMesh Method
Rhino for Mac 5.1
Overload List
Name | Description
ProjectToMesh(Curve, Mesh, Vector3d, Double)
 Projects a curve to a mesh using a direction and tolerance.
ProjectToMesh(Curve, IEnumerable<Mesh>, Vector3d, Double)
 Projects a curve to a set of meshes using a direction and tolerance.
ProjectToMesh(IEnumerable<Curve>, IEnumerable<Mesh>, Vector3d, Double)
 Projects a curve to a set of meshes using a direction and tolerance.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace