RhinoCommon SDK
Material.SetBumpTexture Method
Rhino for Mac 5.1
Overload List
Name | Description
SetBumpTexture(String)
SetBumpTexture(Texture)
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace