RhinoCommon SDK
GetPoint.OnPostDrawObjects Method
Rhino for Mac 5.1
 In the "rare" case that you need to draw some depth buffered geometry during a GetPoint operation, override the OnPostDrawObjects function. NOTE!! Overriding this function comes with a significant performance penalty because the scene needs to be fully regenerated every frame where the standard DynamicDraw event draws temporary decorations (geometry) on top of a static scene.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnPostDrawObjects(
	DrawEventArgs e
)
Protected Overridable Sub OnPostDrawObjects (
	e As DrawEventArgs
)
Parameters
e
Type: Rhino.Display.DrawEventArgs
Current argument for the event.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace