RhinoCommon SDK
BinaryArchiveReader.ReadDictionary Method
Rhino for Mac 5.1
 Reads a complete ArchivableDictionary from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ArchivableDictionary ReadDictionary()
Public Function ReadDictionary As ArchivableDictionary
Return Value
Type: ArchivableDictionary
The newly instantiated object.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace