RhinoCommon SDK
TextEntity Class
Rhino for Mac 5.1
 Represents text geometry.
This class refers to the geometric element that is independent from the document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.TextEntity
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class TextEntity : AnnotationBase
<SerializableAttribute>
Public Class TextEntity
	Inherits AnnotationBase
The TextEntity type exposes the following members.
Constructors
Name | Description
TextEntity()
 Initializes a new instance of the TextEntity class.
TextEntity(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
AnnotativeScalingEnabled
 Scale annotation according to detail scale factor in paperspace or by 1.0 in paperspace and not in a detail Otherwise, dimscale or text scale is used
FontIndex
 Gets or sets the index of font in document font table used by the text.
Justification
 Gets or sets the justification of text in relation to its base point.
MaskColor
 Color to use for drawing a text mask when it is enabled. If the mask is enabled and MaskColor is System.Drawing.Color.Transparent, then the viewport's color will be used for the MaskColor
MaskEnabled
 Determines whether or not to draw a Text Mask
MaskOffset
 distance around text to display mask
MaskUsesViewportColor
 If true, the viewport's color is used for the mask color. If false, the color defined by MaskColor is used
Top
Methods
Name | Description
Explode
 Explodes this text entity into an array of curves.
Top
See Also
Reference
Rhino.Geometry Namespace