RhinoCommon SDK
DisplayPipeline.DrawTorus Method
Rhino for Mac 5.1
Overload List
Name | Description
DrawTorus(Torus, Color)
 Draw a wireframe torus.
DrawTorus(Torus, Color, Int32)
 Draw a wireframe torus.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace