RhinoCommon SDK
File3dmObjectTable.AddMesh Method (Mesh)
Rhino for Mac 5.1
Adds a mesh object to Rhino.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddMesh(
	Mesh mesh
)
Public Function AddMesh (
	mesh As Mesh
) As Guid
Parameters
mesh
Type: Rhino.Geometry.Mesh
A duplicate of this mesh is added to Rhino.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddMesh Overload
Rhino.FileIO Namespace