RhinoCommon SDK
CustomDisplay.AddArc Method (Arc, Color, Int32)
Rhino for Mac 5.1
 Adds a new, colored arc to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddArc(
	Arc arc,
	Color color,
	int thickness
)
Public Sub AddArc (
	arc As Arc,
	color As Color,
	thickness As Integer
)
Parameters
arc
Type: Rhino.Geometry.Arc
Arc to add.
color
Type: System.Drawing.Color
Color of arc.
thickness
Type: System.Int32
Thickness of arc.
See Also
Reference
CustomDisplay Class
AddArc Overload
Rhino.Display Namespace