RhinoCommon SDK
GetBaseClass Class
Rhino for Mac 5.1
 Base class for GetObject, GetPoint, GetSphere, etc. You will never directly create a GetBaseClass but you will use its member functions after calling GetObject.Gets(), GetPoint.Get(), and so on. Provides tools to set command prompt, set command options, and specify if the "get" can optionally accept numbers, nothing (pressing enter), and undo.
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetBaseClass
 More...
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class GetBaseClass : IDisposable
Public MustInherit Class GetBaseClass
	Implements IDisposable
The GetBaseClass type exposes the following members.
Constructors
Name | Description
GetBaseClass
Initializes a new instance of the GetBaseClass class
Top
Methods
Name | Description
AcceptColor
 If you want to allow the user to be able to type in a color r,g,b or name during GetPoint.Get(), GetObject::GetObjects(), etc., then call AcceptColor(true) before calling GetPoint()/GetObject(). If the user chooses to type in a color, then the result code GetResult.Color is returned and you can use RhinoGet.Color() to get the value of the color. If the get accepts points, then the user will not be able to type in r,g,b colors but will be able to type color names.
AcceptCustomMessage
AcceptNothing
 If you want to allow the user to be able to press enter in order to skip selecting a something in GetPoint.Get(), GetObject::GetObjects(), etc., then call AcceptNothing( true ) beforehand.
AcceptNumber
 If you want to allow the user to be able to type in a number during GetPoint.Get(), GetObject::GetObjects(), etc., then call AcceptNumber() beforehand. If the user chooses to type in a number, then the result code GetResult.Number is returned and you can use RhinoGet.Number() to get the value of the number. If you are using GetPoint and you want "0" to return (0,0,0) instead of the number zero, then set acceptZero = false.
AcceptPoint
 If you want to allow the user to be able to type in a point then call AcceptPoint(true) before calling GetPoint()/GetObject(). If the user chooses to type in a number, then the result code GetResult.Point is returned and you can use RhinoGet.Point() to get the value of the point.
AcceptString
 If you want to allow the user to be able to type in a string during GetPoint.Get(), GetObject::GetObjects(), etc., then call AcceptString(true) before calling GetPoint()/GetObject(). If the user chooses to type in a string, then the result code GetResult.String is returned and you can use RhinoGet.String() to get the value of the string.
AcceptUndo
 If you want to allow the user to have an 'undo' option in GetPoint.Get(), GetObject.GetObjects(), etc., then call AcceptUndo(true) beforehand.
AddOption(String)
 Adds a command line option.
AddOption(LocalizeStringPair)
 Adds a command line option.
AddOption(String, String)
 Adds a command line option.
AddOption(LocalizeStringPair, LocalizeStringPair)
 Adds a command line option.
AddOptionColor(String, OptionColor)
 Add a command line option to get colors and automatically save the value.
AddOptionColor(LocalizeStringPair, OptionColor)
 Add a command line option to get colors and automatically save the value.
AddOptionColor(String, OptionColor, String)
 Add a command line option to get colors and automatically save the value.
AddOptionColor(LocalizeStringPair, OptionColor, String)
 Add a command line option to get colors and automatically save the value.
AddOptionDouble(String, OptionDouble)
 Adds a command line option to get numbers and automatically save the value.
AddOptionDouble(LocalizeStringPair, OptionDouble)
 Adds a command line option to get numbers and automatically save the value.
AddOptionDouble(String, OptionDouble, String)
 Adds a command line option to get numbers and automatically save the value.
AddOptionDouble(LocalizeStringPair, OptionDouble, String)
 Adds a command line option to get numbers and automatically saves the value.
AddOptionEnumList<T>
 Add a choice of enum values as list option
AddOptionEnumSelectionList<T>
 Add a list of enum values as option list. Use enumSelection[go.Option.CurrentListOptionIndex] to retrieve selection.
AddOptionInteger(String, OptionInteger)
 Adds a command line option to get integers and automatically save the value.
AddOptionInteger(LocalizeStringPair, OptionInteger)
 Adds a command line option to get integers and automatically save the value.
AddOptionInteger(String, OptionInteger, String)
 Adds a command line option to get integers and automatically save the value.
AddOptionInteger(LocalizeStringPair, OptionInteger, String)
 Adds a command line option to get integers and automatically save the value.
AddOptionList(String, IEnumerable<String>, Int32)
 Adds a command line list option.
AddOptionList(LocalizeStringPair, IEnumerable<LocalizeStringPair>, Int32)
 Adds a command line list option.
AddOptionToggle(String, OptionToggle)
 Adds a command line option to toggle a setting.
AddOptionToggle(LocalizeStringPair, OptionToggle)
 Adds a command line option to toggle a setting.
ClearCommandOptions
Clear all command options.
ClearDefault
 Clears any defaults set using SetDefaultPoint, SetDefaultNumber, SetDefaultString, or SetCommandPromptDefault.
Color
Gets a color if Get*() returns GetResult.Color.
CommandResult
 Helper method for getting command result value from getter results.
CustomMessage
Dispose()
Releases all resources used by the GetBaseClass
Dispose(Boolean)
Releases the unmanaged resources used by the GetBaseClass and optionally releases the managed resources
EnableTransparentCommands
 Control the availability of transparent commands during the get.
Finalize |  (Overrides Object.Finalize().)
GetSelectedEnumValue<T>
 Returns the selected enum value. Use this in combination with AddOptionEnumList<T>(String, T)
GetSelectedEnumValueFromSelectionList<T>
 Returns the selected enum value by looking at the list of values from which to select. Use this in combination with AddOptionEnumSelectionList<T>(String, IEnumerable<T>, Int32)
GotDefault
 Returns true if user pressed Enter to accept a default point, number, or string set using SetDefaultPoint, SetDefaultNumber, or SetDefaultString.
Line2d
 Returns two points defining the location in the view window of the 2d line selected in GetPoint::Get2dLine().
(0,0) = upper left corner of window.
Number
 Gets a number if GetPoint.Get(), GetObject.GetObjects(), etc., returns GetResult.Number.
Option
OptionIndex
PickRectangle
 If the get was a GetObjects() and the mouse was used to select the objects, then the returned rect has left < right and top < bottom. This rect is the Windows GDI screen coordinates of the picking rectangle. RhinoViewport.GetPickXform( pick_rect, pick_xform ) will calculate the picking transformation that was used. In all other cases, left=right=top=bottom=0;
Point
 Gets a point if Get*() returns GetResult.Point.
Point2d
 Returns location in view of point in selected in GetPoint::Get() or GetPoint::Get2dPoint(). (0,0) = upper left corner of window.
PostCustomMessage
Rectangle2d
 Returns the location in the view of the 2d rectangle selected in GetPoint::Get2dRectangle(). rect.left < rect.right and rect.top < rect.bottom (0,0) = upper left corner of window.
Result
Returns result of the Get*() call.
SetCommandPrompt
 Sets prompt message that appears in the command prompt window.
SetCommandPromptDefault
 Sets message that describes what default value will be used if the user presses enter. This description appears in angle brackets <> in the command prompt window. You do not need to provide a default value description unless you explicity enable AcceptNothing.
SetDefaultColor
 Sets a color as default value that will be returned if the user presses ENTER key during the get.
SetDefaultInteger
 Sets a number as default value that will be returned if the user presses ENTER key during the get.
SetDefaultNumber
 Sets a number as default value that will be returned if the user presses ENTER key during the get.
SetDefaultPoint
 Sets a point as default value that will be returned if the user presses the ENTER key during the get.
SetDefaultString
 Sets a string as default value that will be returned if the user presses ENTER key during the get.
SetWaitDuration
 Sets the wait duration (in milliseconds) of the getter. If the duration passes without the user making a decision, the GetResult.Timeout code is returned.
StringResult
 Gets a string if GetPoint.Get(), GetObject.GetObjects(), etc., returns GetResult.String.
Vector
 Gets a direction if Get*() returns GetResult.Point (Set by some digitizers, but in general it's (0,0,0).
View
 Gets a view the user clicked in during GetPoint.Get(), GetObject.GetObjects(), etc.
Top
See Also
Reference
Rhino.Input.Custom Namespace
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetBaseClass
 Rhino.Input.Custom.GetInteger
 Rhino.Input.Custom.GetNumber
 Rhino.Input.Custom.GetObject
 Rhino.Input.Custom.GetOption
 Rhino.Input.Custom.GetPoint
 Rhino.Input.Custom.GetString