RhinoCommon SDK
InstanceDefinitionTableEventType Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.InstanceDefinitionTableEventType"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum InstanceDefinitionTableEventType
Public Enumeration InstanceDefinitionTableEventType
Members
Member name | Value | Description
Added | 0
Deleted | 1
Undeleted | 2
Modified | 3
Sorted | 4 | InstanceDefinitionTable.Sort() potentially changed sort order.
See Also
Reference
Rhino.DocObjects.Tables Namespace