RhinoCommon SDK
PickContext.PickFrustumTest Method (Mesh, PickContext.MeshPickStyle, Point3d, Double, Double, PickContext.MeshHitFlag, Int32)
Rhino for Mac 5.1
Utility for picking meshes
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PickFrustumTest(
	Mesh mesh,
	PickContext.MeshPickStyle pickStyle,
	out Point3d hitPoint,
	out double depth,
	out double distance,
	out PickContext.MeshHitFlag hitFlag,
	out int hitIndex
)
Public Function PickFrustumTest (
	mesh As Mesh,
	pickStyle As PickContext.MeshPickStyle,
	<OutAttribute> ByRef hitPoint As Point3d,
	<OutAttribute> ByRef depth As Double,
	<OutAttribute> ByRef distance As Double,
	<OutAttribute> ByRef hitFlag As PickContext.MeshHitFlag,
	<OutAttribute> ByRef hitIndex As Integer
) As Boolean
Parameters
mesh
Type: Rhino.Geometry.Mesh
mesh to test
pickStyle
Type: Rhino.Input.Custom.PickContext.MeshPickStyle
mode used for pick test
hitPoint
Type: Rhino.Geometry.Point3d
location returned here for point picks
depth
Type: System.Double
 depth returned here for point picks LARGER values are NEARER to the camera. SMALLER values are FARTHER from the camera.
distance
Type: System.Double
 planar distance returned here for point picks. SMALLER values are CLOSER to the pick point
hitFlag
Type: Rhino.Input.Custom.PickContext.MeshHitFlag
 For point picks, How to interpret the hitIndex (vertex hit, edge hit, or face hit)
hitIndex
Type: System.Int32
 index of vertex/edge/face that was hit. Use hitFlag to determine what this index corresponds to
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Mesh,Rhino.Input.Custom.PickContext.MeshPickStyle,Rhino.Geometry.Point3d@,System.Double@,System.Double@,Rhino.Input.Custom.PickContext.MeshHitFlag@,System.Int32@)"]
See Also
Reference
PickContext Class
PickFrustumTest Overload
Rhino.Input.Custom Namespace