RhinoCommon SDK
CachedTextureCoordinates.MappingId Property
Rhino for Mac 5.1
 The texture mapping Id.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid MappingId { get; }
Public ReadOnly Property MappingId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace