RhinoCommon SDK
CommandLineOption.IsValidOptionValueName Method
Rhino for Mac 5.1
 Test a string to see if it can be used as an option value in RhinoGet::AddCommandOption, RhinoGet::AddCommandOptionToggle, or RhinoGet::AddCommandOptionList.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool IsValidOptionValueName(
	string optionValue
)
Public Shared Function IsValidOptionValueName (
	optionValue As String
) As Boolean
Parameters
optionValue
Type: System.String
The string to be tested.
Return Value
Type: Boolean
true if string can be used as an option value.
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace