RhinoCommon SDK
Point4d Constructor (Double, Double, Double, Double)
Rhino for Mac 5.1
 Initializes a new instance of the Point4d class based on coordinates.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point4d(
	double x,
	double y,
	double z,
	double w
)
Public Sub New (
	x As Double,
	y As Double,
	z As Double,
	w As Double
)
Parameters
x
Type: System.Double
The X (first) dimension.
y
Type: System.Double
The Y (second) dimension.
z
Type: System.Double
The Z (third) dimension.
w
Type: System.Double
The W (fourth) dimension, or weight.
See Also
Reference
Point4d Structure
Point4d Overload
Rhino.Geometry Namespace