RhinoCommon SDK
MorphControl Class
Rhino for Mac 5.1
 Represents a geometry that is able to control the morphing behaviour of some other geometry.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.MorphControl
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class MorphControl : GeometryBase
<SerializableAttribute>
Public Class MorphControl
	Inherits GeometryBase
The MorphControl type exposes the following members.
Constructors
Name | Description
MorphControl(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
MorphControl(NurbsCurve, NurbsCurve)
 Constructs a MorphControl that allows for morphing between two curves.
Top
Properties
Name | Description
Curve
 Returns the morph control's curve. While this should never be null, the calling function should check.
PreserveStructure
 true if the morph should be done in a way that preserves the structure of the geometry. In particular, for NURBS objects, true eans that only the control points are moved. The PreserveStructure value does not affect the way meshes and points are morphed. The default is false.
QuickPreview
 true if the morph should be done as quickly as possible because the result is being used for some type of dynamic preview. If QuickPreview is true, the tolerance may be ignored. The QuickPreview value does not affect the way meshes and points are morphed. The default is false.
SpaceMorphTolerance
 The 3d fitting tolerance used when morphing surfaces and breps. The default is 0.0 and any value <= 0.0 is ignored by morphing functions. The value returned by Tolerance does not affect the way meshes and points are morphed.
Surface
 Returns the morph control's surface. While this should never be null, the calling function should check.
Top
Methods
Name | Description
Morph
Applies the space morph to geometry.
Top
See Also
Reference
Rhino.Geometry Namespace