RhinoCommon SDK
PolylineCurve.Point Method
Rhino for Mac 5.1
 Gets a point at a specified index in the polyline curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d Point(
	int index
)
Public Function Point (
	index As Integer
) As Point3d
Parameters
index
Type: System.Int32
An index.
Return Value
Type: Point3d
A point.
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace