RhinoCommon SDK
ObjectTable.AddPoints Method (IEnumerable<Point3d>)
Rhino for Mac 5.1
 Adds multiple points to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoList<Guid> AddPoints(
	IEnumerable<Point3d> points
)
Public Function AddPoints (
	points As IEnumerable(Of Point3d)
) As RhinoList(Of Guid)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to add.
Return Value
Type: RhinoList<Guid>
List of object ids.
See Also
Reference
ObjectTable Class
AddPoints Overload
Rhino.DocObjects.Tables Namespace