RhinoCommon SDK
GripsDrawEventArgs.GripStatus Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.GripsDrawEventArgs.GripStatus(System.Int32)"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GripStatus GripStatus(
	int index
)
Public Function GripStatus (
	index As Integer
) As GripStatus
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Custom.GripsDrawEventArgs.GripStatus(System.Int32)"]
Return Value
Type: GripStatus
[Missing <returns> documentation for "M:Rhino.DocObjects.Custom.GripsDrawEventArgs.GripStatus(System.Int32)"]
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace