RhinoCommon SDK
UserData Constructor
Rhino for Mac 5.1
Initializes a new instance of the UserData class
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected UserData()
Protected Sub New
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace