RhinoCommon SDK
RhinoGet Class
Rhino for Mac 5.1
 Base class for GetObject, GetPoint, GetSphere, etc. You will never directly create a RhinoGet but you will use its member functions after calling GetObject::GetObjects(), GetPoint::GetPoint(), and so on. Provides tools to set command prompt, set command options, and specify if the "get" can optionally accept numbers, nothing (pressing enter), and undo.
Inheritance Hierarchy
System.Object
 Rhino.Input.RhinoGet
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static class RhinoGet
Public NotInheritable Class RhinoGet
The RhinoGet type exposes the following members.
Methods
Name | Description
Get2dRectangle
 Gets a rectangle in view window coordinates.
GetAngle
 Allows user to interactively pick an angle
GetArc
GetBool
Easy to use bool getter.
GetBox(Box)
 Asks the user to select a Box in the viewport.
GetBox(Box, GetBoxMode, Point3d, String, String, String)
 Asks the user to select a Box in the viewport.
GetCircle
GetColor
Easy to use color getter.
GetFileName
GetFileNameScripted
GetGrip
GetGrips
GetHelix
GetInteger(String, Boolean, Int32)
 Easy to use number getter.
GetInteger(String, Boolean, Int32, Int32, Int32)
 Easy to use number getter.
GetLine
GetLinearDimension
GetMultipleObjects(String, Boolean, ObjectType, ObjRef[])
Easy to use object getter for getting multiple objects.
GetMultipleObjects(String, Boolean, GetObjectGeometryFilter, ObjRef[])
Easy to use object getter for getting multiple objects.
GetNumber(String, Boolean, Double)
 Easy to use number getter.
GetNumber(String, Boolean, Double, Double, Double)
 Easy to use number getter.
GetOneObject(String, Boolean, ObjectType, ObjRef)
Easy to use object getter.
GetOneObject(String, Boolean, GetObjectGeometryFilter, ObjRef)
Easy to use object getter.
GetPlane
 Gets an oriented infinite plane.
GetPoint
 Gets a point coordinate from the document.
GetPointOnMesh(Guid, String, Boolean, Point3d)
 Gets a point constrained to an existing mesh in the document.
GetPointOnMesh(MeshObject, String, Boolean, Point3d)
 Gets a point constrained to an existing mesh in the document.
GetPolyline
GetRectangle(Point3d[])
 Gets a 3d rectangle.
GetRectangle(GetBoxMode, Point3d, IEnumerable<String>, Point3d[])
 Gets a 3d rectangle made up of four points.
GetSpiral
GetString
Easy to use string getter.
GetView
 Allows the user to interactively pick a viewport.
InGet
 Returns true if the document is current in a "Get" operation.
Top
See Also
Reference
Rhino.Input Namespace