RhinoCommon SDK
LinetypeTable.SetCurrentLinetypeIndex Method
Rhino for Mac 5.1
 At all times, there is a "current" linetype. Unless otherwise specified, new objects are assigned to the current linetype. The current linetype is never deleted.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetCurrentLinetypeIndex(
	int linetypeIndex,
	bool quiet
)
Public Function SetCurrentLinetypeIndex (
	linetypeIndex As Integer,
	quiet As Boolean
) As Boolean
Parameters
linetypeIndex
Type: System.Int32
 Value for new current linetype. 0 <= linetypeIndex < LinetypeTable.Count.
quiet
Type: System.Boolean
 if true, then no warning message box pops up if the current linetype request can't be satisfied.
Return Value
Type: Boolean
true if current linetype index successfully set.
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace