RhinoCommon SDK
Point2d Constructor (Point3d)
Rhino for Mac 5.1
 Initializes a new instance of Point3d by copying the first two coordiantes of a Point3d.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2d(
	Point3d point
)
Public Sub New (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
The point that will be used: the Z (third) coordinate is discarded.
See Also
Reference
Point2d Structure
Point2d Overload
Rhino.Geometry Namespace