RhinoCommon SDK
GumballAppearanceSettings.RotateYEnabled Property
Rhino for Mac 5.1
 When RotateY is true, the Y rotation control is available. The default setting is true.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool RotateYEnabled { get; set; }
Public Property RotateYEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace