RhinoCommon SDK
Point3d Explicit Conversion (Vector3d to Point3d)
Rhino for Mac 5.1
 Converts a vector in a point, needing casting.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static explicit operator Point3d (
	Vector3d vector
)
Public Shared Narrowing Operator CType (
	vector As Vector3d
) As Point3d
Parameters
vector
Type: Rhino.Geometry.Vector3d
A vector.
Return Value
Type: Point3d
The resulting point.
See Also
Reference
Point3d Structure
Explicit Overload
Rhino.Geometry Namespace