RhinoCommon SDK
Transform.Mirror Method (Plane)
Rhino for Mac 5.1
 Constructs a new Mirror transformation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform Mirror(
	Plane mirrorPlane
)
Public Shared Function Mirror (
	mirrorPlane As Plane
) As Transform
Parameters
mirrorPlane
Type: Rhino.Geometry.Plane
Plane that defines the mirror orientation and position.
Return Value
Type: Transform
A transformation matrix which mirrors geometry in a specified plane.
See Also
Reference
Transform Structure
Mirror Overload
Rhino.Geometry Namespace