RhinoCommon SDK
MouseCallbackEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.MouseCallbackEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 System.ComponentModel.CancelEventArgs
 Rhino.UI.MouseCallbackEventArgs
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MouseCallbackEventArgs : CancelEventArgs
Public Class MouseCallbackEventArgs
	Inherits CancelEventArgs
The MouseCallbackEventArgs type exposes the following members.
Properties
Name | Description
Button
View
ViewportPoint
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace