RhinoCommon SDK
Plane Methods
Rhino for Mac 5.1
The Plane type exposes the following members.
Methods
Name | Description
ClosestParameter
 Gets the parameters of the point on the plane closest to a test point.
ClosestPoint
 Gets the point on the plane closest to a test point.
DistanceTo
 Returns the signed distance from testPoint to its projection onto this plane. If the point is below the plane, a negative distance is returned.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines if an object is a plane and has the same components as this plane.
 (Overrides ValueType.Equals(Object).)
Equals(Plane)
 Determines if another plane has the same components as this plane.
ExtendThroughBox(BoundingBox, Interval, Interval)
 Extends this plane through a bounding box.
ExtendThroughBox(Box, Interval, Interval)
 Extend this plane through a Box.
FitPlaneToPoints(IEnumerable<Point3d>, Plane)
Fit a plane through a collection of points.
FitPlaneToPoints(IEnumerable<Point3d>, Plane, Double)
Fit a plane through a collection of points.
Flip
 Flip this plane by swapping out the X and Y axes and inverting the Z axis.
GetHashCode
 Gets a non-unique hashing code for this entity.
 (Overrides ValueType.GetHashCode().)
GetPlaneEquation
 Gets the plane equation for this plane in the format of Ax+By+Cz+D=0.
PointAt(Double, Double)
 Evaluate a point on the plane.
PointAt(Double, Double, Double)
 Evaluate a point on the plane.
RemapToPlaneSpace
 Convert a point from World space coordinates into Plane space coordinates.
Rotate(Double, Vector3d)
 Rotate the plane about its origin point.
Rotate(Double, Vector3d, Point3d)
 Rotate the plane about a custom anchor point.
Rotate(Double, Double, Vector3d)
 Rotate the plane about its origin point.
Rotate(Double, Double, Vector3d, Point3d)
Rotate the plane about a custom anchor point.
ToString
 Constructs the string representation of this plane.
 (Overrides ValueType.ToString().)
Transform
 Transform the plane with a Transformation matrix.
Translate
 Translate (move) the plane along a vector.
ValueAt
 Get the value of the plane equation at the point.
Top
See Also
Reference
Plane Structure
Rhino.Geometry Namespace