RhinoCommon SDK
ArchivableDictionary.Set Method (String, Point3d)
Rhino for Mac 5.1
 Sets a Point3d.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Set(
	string key,
	Point3d val
)
Public Function Set (
	key As String,
	val As Point3d
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: Rhino.Geometry.Point3d
A point for that key.
Because Point3d has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Point3d)"]
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace