RhinoCommon SDK
CustomBrepObject Methods
Rhino for Mac 5.1
The CustomBrepObject type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
CustomBrepObject Class
Rhino.DocObjects.Custom Namespace