RhinoCommon SDK
InstanceDefinitionGeometry Properties
Rhino for Mac 5.1
The InstanceDefinitionGeometry type exposes the following members.
Properties
Name | Description
Description
 Gets or sets the description of the definition.
Id
 unique id for this instance definition
Name
 Gets or sets the name of the definition.
Top
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace