RhinoCommon SDK
DisplayPipelineAttributes.LockedObjectsDrawBehindOthers Property
Rhino for Mac 5.1
Locked object are drawn behind other objects
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool LockedObjectsDrawBehindOthers { get; set; }
Public Property LockedObjectsDrawBehindOthers As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace