RhinoCommon SDK
Layer.LayerIndex Property
Rhino for Mac 5.1
 Gets or sets the index of this layer.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int LayerIndex { get; set; }
Public Property LayerIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Layer Class
Rhino.DocObjects Namespace