RhinoCommon SDK
Interval Constructor (Interval)
Rhino for Mac 5.1
 Initializes a new instance copying the other instance values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interval(
	Interval other
)
Public Sub New (
	other As Interval
)
Parameters
other
Type: Rhino.Geometry.Interval
The Rhino.Geometry.Interval to use as a base.
See Also
Reference
Interval Structure
Interval Overload
Rhino.Geometry Namespace