RhinoCommon SDK
CustomGripObject Methods
Rhino for Mac 5.1
The CustomGripObject type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
NewLocation
Top
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace