RhinoCommon SDK
NurbsCurve.MakePiecewiseBezier Method
Rhino for Mac 5.1
 Clamps ends and adds knots so the NURBS curve has bezier spans (all distinct knots have multiplitity = degree).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MakePiecewiseBezier(
	bool setEndWeightsToOne
)
Public Function MakePiecewiseBezier (
	setEndWeightsToOne As Boolean
) As Boolean
Parameters
setEndWeightsToOne
Type: System.Boolean
 If true and the first or last weight is not one, then the first and last spans are reparameterized so that the end weights are one.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace