RhinoCommon SDK
DisplayPipeline.PushClipTesting Method
Rhino for Mac 5.1
 Push a ClipTesting flag on the engine's stack.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PushClipTesting(
	bool enable
)
Public Sub PushClipTesting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
ClipTesting flag.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace