RhinoCommon SDK
InstanceDefinitionTableEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class InstanceDefinitionTableEventArgs : EventArgs
Public Class InstanceDefinitionTableEventArgs
	Inherits EventArgs
The InstanceDefinitionTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
InstanceDefinitionIndex
NewState
OldState
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace