RhinoCommon SDK
BezierCurve.ChangeDimension Method
Rhino for Mac 5.1
Change dimension of bezier.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ChangeDimension(
	int desiredDimension
)
Public Function ChangeDimension (
	desiredDimension As Integer
) As Boolean
Parameters
desiredDimension
Type: System.Int32
Return Value
Type: Boolean
true if successful. false if desired_dimension < 1
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace