RhinoCommon SDK
NurbsCurve.CreateFromCircle Method
Rhino for Mac 5.1
 Gets a rational degree 2 NURBS curve representation of the circle. Note that the parameterization of NURBS curve does not match circle's transcendental paramaterization. Use GetRadianFromNurbFormParameter() and GetParameterFromRadian() to convert between the NURBS curve parameter and the transcendental parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static NurbsCurve CreateFromCircle(
	Circle circle
)
Public Shared Function CreateFromCircle (
	circle As Circle
) As NurbsCurve
Parameters
circle
Type: Rhino.Geometry.Circle
[Missing <param name="circle"/> documentation for "M:Rhino.Geometry.NurbsCurve.CreateFromCircle(Rhino.Geometry.Circle)"]
Return Value
Type: NurbsCurve
Curve on success, null on failure.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace