RhinoCommon SDK
DisplayPipeline.CalculateBoundingBoxZoomExtents Event
Rhino for Mac 5.1
 Calculate a bounding to include in the Zoom Extents command.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<CalculateBoundingBoxEventArgs> CalculateBoundingBoxZoomExtents
Public Shared Event CalculateBoundingBoxZoomExtents As EventHandler(Of CalculateBoundingBoxEventArgs)
Value
Type: System.EventHandler<CalculateBoundingBoxEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace