RhinoCommon SDK
DisplayPipeline.DrawSprite Method (DisplayBitmap, Point3d, Single, Color, Boolean)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point3d,System.Single,System.Drawing.Color,System.Boolean)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawSprite(
	DisplayBitmap bitmap,
	Point3d worldLocation,
	float size,
	Color blendColor,
	bool sizeInWorldSpace
)
Public Sub DrawSprite (
	bitmap As DisplayBitmap,
	worldLocation As Point3d,
	size As Single,
	blendColor As Color,
	sizeInWorldSpace As Boolean
)
Parameters
bitmap
Type: Rhino.Display.DisplayBitmap
[Missing <param name="bitmap"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point3d,System.Single,System.Drawing.Color,System.Boolean)"]
worldLocation
Type: Rhino.Geometry.Point3d
[Missing <param name="worldLocation"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point3d,System.Single,System.Drawing.Color,System.Boolean)"]
size
Type: System.Single
[Missing <param name="size"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point3d,System.Single,System.Drawing.Color,System.Boolean)"]
blendColor
Type: System.Drawing.Color
[Missing <param name="blendColor"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point3d,System.Single,System.Drawing.Color,System.Boolean)"]
sizeInWorldSpace
Type: System.Boolean
[Missing <param name="sizeInWorldSpace"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point3d,System.Single,System.Drawing.Color,System.Boolean)"]
See Also
Reference
DisplayPipeline Class
DrawSprite Overload
Rhino.Display Namespace