RhinoCommon SDK
GetObject.CustomGeometryFilter Method
Rhino for Mac 5.1
 Checks geometry to see if it can be selected. Override to provide fancy filtering.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual bool CustomGeometryFilter(
	RhinoObject rhObject,
	GeometryBase geometry,
	ComponentIndex componentIndex
)
Public Overridable Function CustomGeometryFilter (
	rhObject As RhinoObject,
	geometry As GeometryBase,
	componentIndex As ComponentIndex
) As Boolean
Parameters
rhObject
Type: Rhino.DocObjects.RhinoObject
parent object being considered.
geometry
Type: Rhino.Geometry.GeometryBase
geometry being considered.
componentIndex
Type: Rhino.Geometry.ComponentIndex
 if >= 0, geometry is a proper sub-part of object->Geometry() with componentIndex.
Return Value
Type: Boolean
 The default returns true unless you've set a custom geometry filter. If a custom filter has been set, that delegate is called
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace