RhinoCommon SDK
File3dmObjectTable.AddLine Method
Rhino for Mac 5.1
Overload List
Name | Description
AddLine(Line)
Adds a line object to Rhino.
AddLine(Line, ObjectAttributes)
Adds a line object to Rhino.
AddLine(Point3d, Point3d)
Adds a line object to Rhino.
AddLine(Point3d, Point3d, ObjectAttributes)
Adds a line object to Rhino.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace