RhinoCommon SDK
UserData.MoveUserDataFrom Method
Rhino for Mac 5.1
 Moves the user data from objectWithUserData to a temporary data storage identifierd by the return Guid. When MoveUserDataFrom returns, the objectWithUserData will not have any user data.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid MoveUserDataFrom(
	CommonObject objectWithUserData
)
Public Shared Function MoveUserDataFrom (
	objectWithUserData As CommonObject
) As Guid
Parameters
objectWithUserData
Type: Rhino.Runtime.CommonObject
Object with user data attached.
Return Value
Type: Guid
 Guid identifier for storage of UserData that is held in a temporary list by this class. This function should be used in conjunction with MoveUserDataTo to transfer the user data to a different object. Returns Guid.Empty if there was no user data to transfer.
See Also
Reference
UserData Class
Rhino.DocObjects.Custom Namespace