RhinoCommon SDK
Arc.StartAngle Property
Rhino for Mac 5.1
 Gets or sets the start angle (in Radians) for this arc segment.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double StartAngle { get; set; }
Public Property StartAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Arc Structure
Rhino.Geometry Namespace