RhinoCommon SDK
File3dmSettings.ModelUrl Property
Rhino for Mac 5.1
 Gets or sets a Uniform Resource Locator (URL) direction for the model.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string ModelUrl { get; set; }
Public Property ModelUrl As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace