RhinoCommon SDK
Circle Constructor (Arc)
Rhino for Mac 5.1
 Initializes a circle from an arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Circle(
	Arc arc
)
Public Sub New (
	arc As Arc
)
Parameters
arc
Type: Rhino.Geometry.Arc
Arc that defines the plane and radius.
See Also
Reference
Circle Structure
Circle Overload
Rhino.Geometry Namespace