RhinoCommon SDK
TextObject Properties
Rhino for Mac 5.1
The TextObject type exposes the following members.
Properties
Name | Description
TextGeometry
 Gets the text entity geometry of this text object.
Top
See Also
Reference
TextObject Class
Rhino.DocObjects Namespace