RhinoCommon SDK
Sphere.ClosestPoint Method
Rhino for Mac 5.1
 Returns point on sphere that is closest to given point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d ClosestPoint(
	Point3d testPoint
)
Public Function ClosestPoint (
	testPoint As Point3d
) As Point3d
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to project onto Sphere.
Return Value
Type: Point3d
Point on sphere surface closest to testPoint.
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace