RhinoCommon SDK
ViewportInfo.CameraAngle Property
Rhino for Mac 5.1
 Gets or sets the 1/2 smallest angle. See GetCameraAngles(Double, Double, Double) for more information.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double CameraAngle { get; set; }
Public Property CameraAngle As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace