RhinoCommon SDK
MeshFaceList.ConvertTrianglesToQuads Method
Rhino for Mac 5.1
 Joins adjacent triangles into quads if the resulting quad is 'nice'.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ConvertTrianglesToQuads(
	double angleToleranceRadians,
	double minimumDiagonalLengthRatio
)
Public Function ConvertTrianglesToQuads (
	angleToleranceRadians As Double,
	minimumDiagonalLengthRatio As Double
) As Boolean
Parameters
angleToleranceRadians
Type: System.Double
 Used to compare adjacent triangles' face normals. For two triangles to be considered, the angle between their face normals has to be <= angleToleranceRadians. When in doubt use RhinoMath.PI/90.0 (2 degrees).
minimumDiagonalLengthRatio
Type: System.Double
 ( <= 1.0) For two triangles to be considered the ratio of the resulting quad's diagonals (length of the shortest diagonal)/(length of longest diagonal). has to be >= minimumDiagonalLengthRatio. When in doubt us .875.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace