RhinoCommon SDK
Curve.IsEllipse Method (Double)
Rhino for Mac 5.1
 Test a curve to see if it can be represented by an ellipse within a given tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsEllipse(
	double tolerance
)
Public Function IsEllipse (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
Tolerance to use for checking.
Return Value
Type: Boolean
 true if the Curve can be represented by an ellipse within tolerance.
See Also
Reference
Curve Class
IsEllipse Overload
Rhino.Geometry Namespace