RhinoCommon SDK
UserDataList Methods
Rhino for Mac 5.1
The UserDataList type exposes the following members.
Methods
Name | Description
Add
 If the userdata is already in a different UserDataList, it will be removed from that list and added to this list.
Find
 Finds a specific data type in this regulated collection.
Remove
 Remove the userdata from this list
Top
See Also
Reference
UserDataList Class
Rhino.DocObjects.Custom Namespace