RhinoCommon SDK
Mesh.CreateFromSphere Method
Rhino for Mac 5.1
 Constructs a mesh sphere.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Mesh CreateFromSphere(
	Sphere sphere,
	int xCount,
	int yCount
)
Public Shared Function CreateFromSphere (
	sphere As Sphere,
	xCount As Integer,
	yCount As Integer
) As Mesh
Parameters
sphere
Type: Rhino.Geometry.Sphere
Base sphere for mesh.
xCount
Type: System.Int32
Number of faces in the around direction.
yCount
Type: System.Int32
Number of faces in the top-to-bottom direction.
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.CreateFromSphere(Rhino.Geometry.Sphere,System.Int32,System.Int32)"]
Exceptions
Exception | Condition
ArgumentException | Thrown when sphere is invalid.
ArgumentOutOfRangeException | Thrown when xCount is less than or equal to two.
ArgumentOutOfRangeException | Thrown when yCount is less than or equal to two.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace