RhinoCommon SDK
Point2d.IsValid Property
Rhino for Mac 5.1
 If any coordinate of a point is UnsetValue, then the point is not valid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace