RhinoCommon SDK
Point3d.IsValid Property
Rhino for Mac 5.1
 Each coordinate of the point must pass the IsValidDouble(Double) test.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace