RhinoCommon SDK
BitmapTable Methods
Rhino for Mac 5.1
The BitmapTable type exposes the following members.
Methods
Name | Description
AddBitmap
Adds a new bitmap with specified name to the bitmap table.
DeleteBitmap
Deletes a bitmap.
ExportToFile
Writes a bitmap to a file.
ExportToFiles
Exports all the bitmaps in the table to files.
Find
 This function first attempts to find the file with "name" on the disk. If it does find it, "fileName" is set to the full path of the file and the BitmapEntry returned will be null, even if there was a BitmapEntry with "name" in the bitmap table. If the function cannot find the file on the disk, it searches the bitmap table. If it finds it, the returned BitmapEntry entry will be the entry in the table with that name. Additionally, if "createFile" is true, and an entry is found, the file will be written to the disk and it's full path will be contained in "fileName".
GetEnumerator
 BitmapTable enumerator
Top
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace