RhinoCommon SDK
ShowPanelEventArgs Class
Rhino for Mac 5.1
 Panels.Show event arguments
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.UI.ShowPanelEventArgs
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class ShowPanelEventArgs : EventArgs
Public Class ShowPanelEventArgs
	Inherits EventArgs
The ShowPanelEventArgs type exposes the following members.
Constructors
Name | Description
ShowPanelEventArgs
Initializes a new instance of the ShowPanelEventArgs class
Top
Properties
Name | Description
PanelId
 Class Id for panel being shown or hidden
Show
 Will be true if showing or false if hiding
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace