RhinoCommon SDK
Intersection.CurvePlane Method
Rhino for Mac 5.1
 Intersects a curve with an (infinite) plane.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static CurveIntersections CurvePlane(
	Curve curve,
	Plane plane,
	double tolerance
)
Public Shared Function CurvePlane (
	curve As Curve,
	plane As Plane,
	tolerance As Double
) As CurveIntersections
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to intersect.
plane
Type: Rhino.Geometry.Plane
Plane to intersect with.
tolerance
Type: System.Double
Tolerance to use during intersection.
Return Value
Type: CurveIntersections
A list of intersection events or null if no intersections were recorded.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace