RhinoCommon SDK
RhinoView.CaptureToBitmap Method
Rhino for Mac 5.1
 Capture View contents to a bitmap.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Bitmap CaptureToBitmap()
Public Function CaptureToBitmap As Bitmap
Return Value
Type: Bitmap
The bitmap of the complete view.
See Also
Reference
RhinoView Class
CaptureToBitmap Overload
Rhino.Display Namespace