RhinoCommon SDK
MeshVertexList.Remove Method (IEnumerable<Int32>, Boolean)
Rhino for Mac 5.1
 Removes the vertices at the given indices and all faces that reference those vertices.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Remove(
	IEnumerable<int> indices,
	bool shrinkFaces
)
Public Function Remove (
	indices As IEnumerable(Of Integer),
	shrinkFaces As Boolean
) As Boolean
Parameters
indices
Type: System.Collections.Generic.IEnumerable<Int32>
Vertex indices to remove.
shrinkFaces
Type: System.Boolean
If true, quads that reference the deleted vertex will be converted to triangles.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexList Class
Remove Overload
Rhino.Geometry.Collections Namespace