RhinoCommon SDK
SpaceMorph.IsMorphable Method
Rhino for Mac 5.1
 true if the geometry can be morphed by calling SpaceMorph.Morph(geometry)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool IsMorphable(
	GeometryBase geometry
)
Public Shared Function IsMorphable (
	geometry As GeometryBase
) As Boolean
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
[Missing <param name="geometry"/> documentation for "M:Rhino.Geometry.SpaceMorph.IsMorphable(Rhino.Geometry.GeometryBase)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SpaceMorph.IsMorphable(Rhino.Geometry.GeometryBase)"]
See Also
Reference
SpaceMorph Class
Rhino.Geometry Namespace