RhinoCommon SDK
File3dm.Polish Method
Rhino for Mac 5.1
 Quickly fills in the little details, like making sure there is at least one layer and table indices make sense. For a full blown check and repair, call Audit(true).
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Polish()
Public Sub Polish
See Also
Reference
File3dm Class
Rhino.FileIO Namespace