RhinoCommon SDK
DisplayPipeline.InterruptDrawing Method
Rhino for Mac 5.1
 Tests to see if the pipeline should stop drawing more geometry and just show what it has so far. If a drawing operation is taking a long time, this function will return true and tell Rhino it should just finish up and show the frame buffer. This is used in dynamic drawing operations.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool InterruptDrawing()
Public Function InterruptDrawing As Boolean
Return Value
Type: Boolean
 true if the pipeline should stop attempting to draw more geometry and just show the frame buffer.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace