RhinoCommon SDK
BinaryArchiveReader.ReadDouble Method
Rhino for Mac 5.1
 Reads a Double from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ReadDouble()
Public Function ReadDouble As Double
Return Value
Type: Double
The value that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace