RhinoCommon SDK
GetNumber Class
Rhino for Mac 5.1
Used to get double precision numbers.
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetBaseClass
 Rhino.Input.Custom.GetNumber
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class GetNumber : GetBaseClass
Public Class GetNumber
	Inherits GetBaseClass
The GetNumber type exposes the following members.
Constructors
Name | Description
GetNumber
Create a new GetNumber.
Top
Methods
Name | Description
Get
Call to get a number.
SetLowerLimit
 Sets a lower limit on the number that can be returned. By default there is no lower limit.
SetUpperLimit
 Sets an upper limit on the number that can be returned. By default there is no upper limit.
Top
See Also
Reference
Rhino.Input.Custom Namespace