RhinoCommon SDK
MeshingParameterStyle Enumeration
Rhino for Mac 5.1
 Type of Mesh Parameters used by the RhinoDoc for meshing objects
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum MeshingParameterStyle
Public Enumeration MeshingParameterStyle
Members
Member name | Value | Description
None | 0 | No style
Fast | 1
Quality | 2
Custom | 9
PerObject | 10
See Also
Reference
Rhino.Geometry Namespace