RhinoCommon SDK
File3dmSettings.ModelUnitSystem Property
Rhino for Mac 5.1
 Gets or sets the model unit system, using UnitSystem enumeration.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public UnitSystem ModelUnitSystem { get; set; }
Public Property ModelUnitSystem As UnitSystem
	Get
	Set
Property Value
Type: UnitSystem
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace