RhinoCommon SDK
Quaternion.CrossProduct Method
Rhino for Mac 5.1
 Computes the vector cross product of p and q = (0,x,y,z),
where (x,y,z) = CrossProduct(p.Vector,q.Vector).
This is not the same as the quaternion product p*q.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Quaternion CrossProduct(
	Quaternion p,
	Quaternion q
)
Public Shared Function CrossProduct (
	p As Quaternion,
	q As Quaternion
) As Quaternion
Parameters
p
Type: Rhino.Geometry.Quaternion
A quaternion.
q
Type: Rhino.Geometry.Quaternion
Another quaternion.
Return Value
Type: Quaternion
A new quaternion.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace