RhinoCommon SDK
GeometryBase.Translate Method (Double, Double, Double)
Rhino for Mac 5.1
Translates the object along the specified vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Translate(
	double x,
	double y,
	double z
)
Public Function Translate (
	x As Double,
	y As Double,
	z As Double
) As Boolean
Parameters
x
Type: System.Double
The X component.
y
Type: System.Double
The Y component.
z
Type: System.Double
The Z component.
Return Value
Type: Boolean
true if geometry successfully translated.
See Also
Reference
GeometryBase Class
Translate Overload
Rhino.Geometry Namespace