RhinoCommon SDK
LinetypeTable.GetUnusedLinetypeName Method
Rhino for Mac 5.1
 Gets unused linetype name used as default when creating new linetypes.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string GetUnusedLinetypeName(
	bool ignoreDeleted
)
Public Function GetUnusedLinetypeName (
	ignoreDeleted As Boolean
) As String
Parameters
ignoreDeleted
Type: System.Boolean
 If this is true then a name used by a deleted linetype is allowed.
Return Value
Type: String
The unused linetype name.
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace