RhinoCommon SDK
Light.IsRectangularLight Property
Rhino for Mac 5.1
 Gets a value indicating whether the light style is LightStyle WorldRectangular.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsRectangularLight { get; }
Public ReadOnly Property IsRectangularLight As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Light Class
Rhino.Geometry Namespace