RhinoCommon SDK
ObjectTable.AddArc Method
Rhino for Mac 5.1
Overload List
Name | Description
AddArc(Arc)
Adds a curve object to the document representing an arc.
AddArc(Arc, ObjectAttributes)
Adds a curve object to the document representing an arc.
AddArc(Arc, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace