RhinoCommon SDK
PickContext.SetPickTransform Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.Custom.PickContext.SetPickTransform(Rhino.Geometry.Transform)"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetPickTransform(
	Transform transform
)
Public Sub SetPickTransform (
	transform As Transform
)
Parameters
transform
Type: Rhino.Geometry.Transform
[Missing <param name="transform"/> documentation for "M:Rhino.Input.Custom.PickContext.SetPickTransform(Rhino.Geometry.Transform)"]
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace