RhinoCommon SDK
BoundingBox.Union Method (BoundingBox, BoundingBox)
Rhino for Mac 5.1
 Returns a new BoundingBox that represents the union of boxes a and b.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static BoundingBox Union(
	BoundingBox a,
	BoundingBox b
)
Public Shared Function Union (
	a As BoundingBox,
	b As BoundingBox
) As BoundingBox
Parameters
a
Type: Rhino.Geometry.BoundingBox
First box to include in union.
b
Type: Rhino.Geometry.BoundingBox
Second box to include in union.
Return Value
Type: BoundingBox
The BoundingBox that contains both a and b.
Remarks
Invalid boxes are ignored and will not affect the union.
See Also
Reference
BoundingBox Structure
Union Overload
Rhino.Geometry Namespace