RhinoCommon SDK
NurbsSurfacePointList.CountV Property
Rhino for Mac 5.1
 Gets the number of control points in the V direction of this surface.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int CountV { get; }
Public ReadOnly Property CountV As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace