RhinoCommon SDK
Curve.ClosestPoint Method (Point3d, Double)
Rhino for Mac 5.1
 Finds parameter of the point on a curve that is closest to testPoint. If the maximumDistance parameter is > 0, then only points whose distance to the given point is <= maximumDistance will be returned. Using a positive value of maximumDistance can substantially speed up the search.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ClosestPoint(
	Point3d testPoint,
	out double t
)
Public Function ClosestPoint (
	testPoint As Point3d,
	<OutAttribute> ByRef t As Double
) As Boolean
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to search from.
t
Type: System.Double
Parameter of local closest point.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Curve Class
ClosestPoint Overload
Rhino.Geometry Namespace