RhinoCommon SDK
Surface.InterpolatedCurveOnSurfaceUV Method
Rhino for Mac 5.1
 Constructs an interpolated curve on a surface, using 2D surface points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsCurve InterpolatedCurveOnSurfaceUV(
	IEnumerable<Point2d> points,
	double tolerance
)
Public Function InterpolatedCurveOnSurfaceUV (
	points As IEnumerable(Of Point2d),
	tolerance As Double
) As NurbsCurve
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point2d>
A list, an array or any enumerable set of 2D points.
tolerance
Type: System.Double
A tolerance value.
Return Value
Type: NurbsCurve
A new nurbs curve, or null on error.
See Also
Reference
Surface Class
Rhino.Geometry Namespace