RhinoCommon SDK
LineSphereIntersection Enumeration
Rhino for Mac 5.1
 Represents all possible cases of a Line|Sphere intersection event.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum LineSphereIntersection
Public Enumeration LineSphereIntersection
Members
Member name | Value | Description
None | 0 |  No intersections.
Single | 1 |  One intersection.
Multiple | 2 |  Two intersections.
See Also
Reference
Rhino.Geometry.Intersect Namespace