RhinoCommon SDK
Material.SetTransparencyTexture Method
Rhino for Mac 5.1
Overload List
Name | Description
SetTransparencyTexture(String)
SetTransparencyTexture(Texture)
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace