RhinoCommon SDK
DisplayPipeline.DrawLine Method (Line, Color, Int32)
Rhino for Mac 5.1
 Draws a single line object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawLine(
	Line line,
	Color color,
	int thickness
)
Public Sub DrawLine (
	line As Line,
	color As Color,
	thickness As Integer
)
Parameters
line
Type: Rhino.Geometry.Line
Line to draw.
color
Type: System.Drawing.Color
Color to draw line in.
thickness
Type: System.Int32
Thickness (in pixels) of line.
See Also
Reference
DisplayPipeline Class
DrawLine Overload
Rhino.Display Namespace