RhinoCommon SDK
ObjectTable.AddRhinoObject Method (MeshObject, Mesh)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.MeshObject,Rhino.Geometry.Mesh)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddRhinoObject(
	MeshObject meshObject,
	Mesh mesh
)
Public Sub AddRhinoObject (
	meshObject As MeshObject,
	mesh As Mesh
)
Parameters
meshObject
Type: Rhino.DocObjects.MeshObject
[Missing <param name="meshObject"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.MeshObject,Rhino.Geometry.Mesh)"]
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.MeshObject,Rhino.Geometry.Mesh)"]
See Also
Reference
ObjectTable Class
AddRhinoObject Overload
Rhino.DocObjects.Tables Namespace