RhinoCommon SDK
DisplayPipelineAttributes.ShowGrips Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.ShowGrips"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ShowGrips { get; set; }
Public Property ShowGrips As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace