RhinoCommon SDK
Line.TryGetPlane Method
Rhino for Mac 5.1
 Gets a plane that contains the line. The origin of the plane is at the start of the line. If possible, a plane parallel to the world xy, yz, or zx plane is returned.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetPlane(
	out Plane plane
)
Public Function TryGetPlane (
	<OutAttribute> ByRef plane As Plane
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
If the return value is true, the plane out parameter is assigned during this call.
Return Value
Type: Boolean
true on success.
See Also
Reference
Line Structure
Rhino.Geometry Namespace