RhinoCommon SDK
ShowMessageIcon Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageIcon"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum ShowMessageIcon
Public Enumeration ShowMessageIcon
Members
Member name | Value | Description
None | 0
Error | 16
Hand | 16
Stop | 16
Question | 32
Exclamation | 48
Warning | 48
Information | 64
Asterisk | 64
See Also
Reference
Rhino.UI Namespace