RhinoCommon SDK
Curve.SimplifyEnd Method
Rhino for Mac 5.1
 Same as SimplifyCurve, but simplifies only the last two segments at "side" end.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve SimplifyEnd(
	CurveEnd end,
	CurveSimplifyOptions options,
	double distanceTolerance,
	double angleToleranceRadians
)
Public Function SimplifyEnd (
	end As CurveEnd,
	options As CurveSimplifyOptions,
	distanceTolerance As Double,
	angleToleranceRadians As Double
) As Curve
Parameters
end
Type: Rhino.Geometry.CurveEnd
If CurveEnd.Start the function simplifies the last two start side segments, otherwise if CurveEnd.End the last two end side segments are simplified.
options
Type: Rhino.Geometry.CurveSimplifyOptions
Simplification options.
distanceTolerance
Type: System.Double
A distance tolerance for the simplification.
angleToleranceRadians
Type: System.Double
An angle tolerance for the simplification.
Return Value
Type: Curve
New simplified curve on success, null on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace