RhinoCommon SDK
NurbsSurface.CreateFromCorners Method (Point3d, Point3d, Point3d, Point3d, Double)
Rhino for Mac 5.1
 Makes a surface from 4 corner points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static NurbsSurface CreateFromCorners(
	Point3d corner1,
	Point3d corner2,
	Point3d corner3,
	Point3d corner4,
	double tolerance
)
Public Shared Function CreateFromCorners (
	corner1 As Point3d,
	corner2 As Point3d,
	corner3 As Point3d,
	corner4 As Point3d,
	tolerance As Double
) As NurbsSurface
Parameters
corner1
Type: Rhino.Geometry.Point3d
The first corner.
corner2
Type: Rhino.Geometry.Point3d
The second corner.
corner3
Type: Rhino.Geometry.Point3d
The third corner.
corner4
Type: Rhino.Geometry.Point3d
The fourth corner.
tolerance
Type: System.Double
Minimum edge length without collapsing to a singularity.
Return Value
Type: NurbsSurface
The resulting surface or null on error.
See Also
Reference
NurbsSurface Class
CreateFromCorners Overload
Rhino.Geometry Namespace