RhinoCommon SDK
Light Methods
Rhino for Mac 5.1
The Light type exposes the following members.
Methods
Name | Description
GetAttenuation
 Gets the attenuation settings (ignored for "directional" and "ambient" lights).
attenuation = 1/(a0 + d*a1 + d^2*a2) where d = distance to light.
GetSpotLightRadii
 Gets the spot light radii.
SetAttenuation
 Sets the attenuation settings (ignored for "directional" and "ambient" lights).
attenuation = 1/(a0 + d*a1 + d^2*a2) where d = distance to light.
Top
See Also
Reference
Light Class
Rhino.Geometry Namespace