RhinoCommon SDK
BendSpaceMorph Properties
Rhino for Mac 5.1
The BendSpaceMorph type exposes the following members.
Properties
Name | Description
IsValid
 Returns true if the space morph definition is valid, false otherwise.
Top
See Also
Reference
BendSpaceMorph Class
Rhino.Geometry.Morphs Namespace