RhinoCommon SDK
RhinoDoc.GetMeshingParameters Method
Rhino for Mac 5.1
 Get MeshingParameters currently used by the document
Namespace: Rhino
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MeshingParameters GetMeshingParameters(
	MeshingParameterStyle style
)
Public Function GetMeshingParameters (
	style As MeshingParameterStyle
) As MeshingParameters
Parameters
style
Type: Rhino.Geometry.MeshingParameterStyle
[Missing <param name="style"/> documentation for "M:Rhino.RhinoDoc.GetMeshingParameters(Rhino.Geometry.MeshingParameterStyle)"]
Return Value
Type: MeshingParameters
[Missing <returns> documentation for "M:Rhino.RhinoDoc.GetMeshingParameters(Rhino.Geometry.MeshingParameterStyle)"]
See Also
Reference
RhinoDoc Class
Rhino Namespace