RhinoCommon SDK
RTree.Clear Method
Rhino for Mac 5.1
 Removes all elements.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Clear()
Public Sub Clear
See Also
Reference
RTree Class
Rhino.Geometry Namespace