RhinoCommon SDK
Brep.Compact Method
Rhino for Mac 5.1
 Deletes any unreferenced objects from arrays, reindexes as needed, and shrinks arrays to minimum required size. Uses CUllUnused* members to delete any unreferenced objects from arrays.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Compact()
Public Sub Compact
See Also
Reference
Brep Class
Rhino.Geometry Namespace