RhinoCommon SDK
Light Class
Rhino for Mac 5.1
 Represents a light that shines in the modeling space.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Light
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class Light : GeometryBase
<SerializableAttribute>
Public Class Light
	Inherits GeometryBase
The Light type exposes the following members.
Constructors
Name | Description
Light()
 Initializes a new light.
Light(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
Ambient
 Gets or sets the ambient color.
AttenuationVector
 Gets or Sets the attenuation vector.
CoordinateSystem
 Gets a value, determined by LightStyle, that explains whether the camera diretions are relative to World or Camera spaces.
Diffuse
 Gets or sets the diffuse color.
Direction
 Gets or sets the vector direction of the camera.
HotSpot
 The hot spot setting runs from 0.0 to 1.0 and is used to provides a linear interface for controling the focus or concentration of a spotlight. A hot spot setting of 0.0 corresponds to a spot exponent of 128. A hot spot setting of 1.0 corresponds to a spot exponent of 0.0.
Intensity
 Gets or sets the light intensity.
IsDirectionalLight
 Gets a value indicating whether the light style is LightStyle CameraDirectional or WorldDirectional.
IsEnabled
 Gets or sets a value that defines if the light is turned on (true) or off (false).
IsLinearLight
 Gets a value indicating whether the light style is LightStyle WorldLinear.
IsPointLight
 Gets a value indicating whether the light style is LightStyle CameraPoint or WorldPoint.
IsRectangularLight
 Gets a value indicating whether the light style is LightStyle WorldRectangular.
IsSpotLight
 Gets a value indicating whether the light style is LightStyle CameraSpot or WorldSpot.
IsSunLight
 Gets a value indicating whether this object is a Sun light.
Length
 Gets or sets the height in linear and rectangular lights.
(ignored for non-linear/rectangular lights.)
LightStyle
 Gets or sets a light style on this camera.
Location
 Gets or sets the light or 3D position or location.
Name
 Gets or sets the spot light name.
PerpendicularDirection
 Gets a perpendicular vector to the camera direction.
PowerCandela
 Gets or sets the light power in candelas (cd).
PowerLumens
 Gets or sets the light power in lumens (lm).
PowerWatts
 Gets or sets the light power in watts (W).
Specular
 Gets or sets the specular color.
SpotAngleRadians
 Gets or sets the spot angle in radians.
Ignored for non-spot lights.
angle = 0 to pi/2 (0 to 90 degrees).
SpotExponent
 The spot exponent varies from 0.0 to 128.0 and provides an exponential interface for controling the focus or concentration of a spotlight (like the OpenGL GL_SPOT_EXPONENT parameter). The spot exponent and hot spot parameters are linked; changing one will change the other. A hot spot setting of 0.0 corresponds to a spot exponent of 128. A hot spot setting of 1.0 corresponds to a spot exponent of 0.0.
SpotLightShadowIntensity
 Gets or sets the spot light shadow intensity.
(ignored for non-spot lights.)
Width
 Gets or sets the width in linear and rectangular lights.
(ignored for non-linear/rectangular lights.)
Top
Methods
Name | Description
GetAttenuation
 Gets the attenuation settings (ignored for "directional" and "ambient" lights).
attenuation = 1/(a0 + d*a1 + d^2*a2) where d = distance to light.
GetSpotLightRadii
 Gets the spot light radii.
SetAttenuation
 Sets the attenuation settings (ignored for "directional" and "ambient" lights).
attenuation = 1/(a0 + d*a1 + d^2*a2) where d = distance to light.
Top
See Also
Reference
Rhino.Geometry Namespace