RhinoCommon SDK
CachedTextureCoordinates.TryGetAt Method
Rhino for Mac 5.1
 Use this method to iterate the cached texture coordinate array.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetAt(
	int index,
	out double u,
	out double v,
	out double w
)
Public Function TryGetAt (
	index As Integer,
	<OutAttribute> ByRef u As Double,
	<OutAttribute> ByRef v As Double,
	<OutAttribute> ByRef w As Double
) As Boolean
Parameters
index
Type: System.Int32
 Index for the vertex to fetch.
u
Type: System.Double
 Output parameter which will receive the U value.
v
Type: System.Double
 Output parameter which will receive the V value.
w
Type: System.Double
 Output parameter which will receive the W value, this is only meaningful if Dim is 3.
Return Value
Type: Boolean
 Returns true if index is valid; otherwise returns false.
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace