RhinoCommon SDK
ConstructionPlane.DepthBuffered Property
Rhino for Mac 5.1
 Gets or sets whether the grid is drawn on top of geometry.
false=grid is always drawn behind 3d geometry
true=grid is drawn at its depth as a 3d plane and grid lines obscure things behind the grid.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DepthBuffered { get; set; }
Public Property DepthBuffered As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace