RhinoCommon SDK
ColorXYZ.CreateFromLCH Method
Rhino for Mac 5.1
 Create the nearest XYZ equivalent of an LCH color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static ColorXYZ CreateFromLCH(
	ColorLCH lch
)
Public Shared Function CreateFromLCH (
	lch As ColorLCH
) As ColorXYZ
Parameters
lch
Type: Rhino.Display.ColorLCH
Target color in LCH space.
Return Value
Type: ColorXYZ
The XYZ equivalent of the LCH color.
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace