RhinoCommon SDK
LinetypeTable.Delete Method (IEnumerable<Int32>, Boolean)
Rhino for Mac 5.1
Deletes multiple linetypes.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Delete(
	IEnumerable<int> indices,
	bool quiet
)
Public Function Delete (
	indices As IEnumerable(Of Integer),
	quiet As Boolean
) As Boolean
Parameters
indices
Type: System.Collections.Generic.IEnumerable<Int32>
An array, a list or any enumerable instance of linetype indices.
quiet
Type: System.Boolean
If true, no warning message box appears if a linetype the linetype cannot be deleted because it is the current linetype or it contains active geometry.
Return Value
Type: Boolean
true if operation succeeded.
See Also
Reference
LinetypeTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace