RhinoCommon SDK
Curve.IsCircle Method (Double)
Rhino for Mac 5.1
 Test a curve to see if it can be represented by a circle within the given tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsCircle(
	double tolerance
)
Public Function IsCircle (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
Tolerance to use when checking.
Return Value
Type: Boolean
 true if the curve can be represented by a circle to within tolerance.
See Also
Reference
Curve Class
IsCircle Overload
Rhino.Geometry Namespace