RhinoCommon SDK
PointCloudObject Properties
Rhino for Mac 5.1
The PointCloudObject type exposes the following members.
Properties
Name | Description
PointCloudGeometry
Top
See Also
Reference
PointCloudObject Class
Rhino.DocObjects Namespace