RhinoCommon SDK
Interop.NativeRhinoDocPointer Method
Rhino for Mac 5.1
 Gets the C++ CRhinoDoc* for a given RhinoCommon RhinoDoc class.
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static IntPtr NativeRhinoDocPointer(
	RhinoDoc doc
)
Public Shared Function NativeRhinoDocPointer (
	doc As RhinoDoc
) As IntPtr
Parameters
doc
Type: Rhino.RhinoDoc
A document.
Return Value
Type: IntPtr
A pointer value.
See Also
Reference
Interop Class
Rhino.Runtime Namespace