RhinoCommon SDK
ReplayHistoryData.HistoryVersion Property
Rhino for Mac 5.1
 ReplayHistory overrides check the version number to insure the information saved in the history record is compatible with the current implementation of ReplayHistory
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int HistoryVersion { get; }
Public ReadOnly Property HistoryVersion As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace