RhinoCommon SDK
File3dmObjectTable.AddCircle Method
Rhino for Mac 5.1
Overload List
Name | Description
AddCircle(Circle)
Adds a curve object to the document representing a circle.
AddCircle(Circle, ObjectAttributes)
Adds a curve object to the document representing a circle.
Top
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace