RhinoCommon SDK
GetObject.EnablePressEnterWhenDonePrompt Method
Rhino for Mac 5.1
 By default, when GetObject.GetObjects is called with minimumNumber > 0 and maximumNumber = 0, the command prompt automatically includes "Press Enter when done" after the user has selected at least minimumNumber of objects. If you want to prohibit the addition of the "Press Enter when done", then call EnablePressEnterWhenDonePrompt = false;
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnablePressEnterWhenDonePrompt(
	bool enable
)
Public Sub EnablePressEnterWhenDonePrompt (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
[Missing <param name="enable"/> documentation for "M:Rhino.Input.Custom.GetObject.EnablePressEnterWhenDonePrompt(System.Boolean)"]
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace