RhinoCommon SDK
MeshVertexList.ToPoint3fArray Method
Rhino for Mac 5.1
 Copies all vertices to a new array of Point3f.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3f[] ToPoint3fArray()
Public Function ToPoint3fArray As Point3f()
Return Value
Type: Point3f[]
A new array.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace