RhinoCommon SDK
MeshVertexList.ToPoint3dArray Method
Rhino for Mac 5.1
 Copies all vertices to a new array of Point3d.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d[] ToPoint3dArray()
Public Function ToPoint3dArray As Point3d()
Return Value
Type: Point3d[]
A new array.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace