RhinoCommon SDK
MeshFace.Set Method
Rhino for Mac 5.1
Overload List
Name | Description
Set(Int32, Int32, Int32)
 Sets all the corners for this face as a triangle.
Set(Int32, Int32, Int32, Int32)
 Sets all the corners for this face as a quad.
Top
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace