RhinoCommon SDK
ExtrusionObject.DuplicateExtrusionGeometry Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ExtrusionObject.DuplicateExtrusionGeometry"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Extrusion DuplicateExtrusionGeometry()
Public Function DuplicateExtrusionGeometry As Extrusion
Return Value
Type: Extrusion
[Missing <returns> documentation for "M:Rhino.DocObjects.ExtrusionObject.DuplicateExtrusionGeometry"]
See Also
Reference
ExtrusionObject Class
Rhino.DocObjects Namespace