RhinoCommon SDK
LayerTable.Find Method (Guid, Boolean)
Rhino for Mac 5.1
Finds a layer with a matching ID.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Find(
	Guid layerId,
	bool ignoreDeletedLayers
)
Public Function Find (
	layerId As Guid,
	ignoreDeletedLayers As Boolean
) As Integer
Parameters
layerId
Type: System.Guid
A valid layer ID.
ignoreDeletedLayers
Type: System.Boolean
If true, deleted layers are not checked.
Return Value
Type: Int32
 >=0 index of the layer with the given name -1 no layer has the given name.
See Also
Reference
LayerTable Class
Find Overload
Rhino.DocObjects.Tables Namespace