RhinoCommon SDK
MeshPoint.EdgeIndex Property
Rhino for Mac 5.1
 When set, EdgeIndex is an index of an edge in the mesh's edge list.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int EdgeIndex { get; }
Public ReadOnly Property EdgeIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace