RhinoCommon SDK
RhinoObject.OnPicked Method
Rhino for Mac 5.1
 Called when this object has been picked
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnPicked(
	PickContext context,
	IEnumerable<ObjRef> pickedItems
)
Protected Overridable Sub OnPicked (
	context As PickContext,
	pickedItems As IEnumerable(Of ObjRef)
)
Parameters
context
Type: Rhino.Input.Custom.PickContext
[Missing <param name="context"/> documentation for "M:Rhino.DocObjects.RhinoObject.OnPicked(Rhino.Input.Custom.PickContext,System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})"]
pickedItems
Type: System.Collections.Generic.IEnumerable<ObjRef>
 Items that were picked. This parameter is enumerable because there may have been multiple sub-objects picked
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace