RhinoCommon SDK
MeshFaceList.AddFace Method (MeshFace)
Rhino for Mac 5.1
 Appends a new mesh face to the end of the mesh face list.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddFace(
	MeshFace face
)
Public Function AddFace (
	face As MeshFace
) As Integer
Parameters
face
Type: Rhino.Geometry.MeshFace
Face to add.
Return Value
Type: Int32
The index of the newly added face.
See Also
Reference
MeshFaceList Class
AddFace Overload
Rhino.Geometry.Collections Namespace