RhinoCommon SDK
IPanelsService.PanelDockBar Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.PanelDockBar(System.Guid)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
Guid PanelDockBar(
	Guid panelId
)
Function PanelDockBar (
	panelId As Guid
) As Guid
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.IPanelsService.PanelDockBar(System.Guid)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.PanelDockBar(System.Guid)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace