RhinoCommon SDK
ObjectTable.AddMorphControl Method (MorphControl)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddMorphControl(
	MorphControl morphControl
)
Public Function AddMorphControl (
	morphControl As MorphControl
) As Guid
Parameters
morphControl
Type: Rhino.Geometry.MorphControl
[Missing <param name="morphControl"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl)"]
See Also
Reference
ObjectTable Class
AddMorphControl Overload
Rhino.DocObjects.Tables Namespace