RhinoCommon SDK
CustomCurveObject Constructor
Rhino for Mac 5.1
Initializes a new instance of the CustomCurveObject class
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected CustomCurveObject()
Protected Sub New
See Also
Reference
CustomCurveObject Class
CustomCurveObject Overload
Rhino.DocObjects.Custom Namespace