RhinoCommon SDK
Curve.IsLinear Method
Rhino for Mac 5.1
Overload List
Name | Description
IsLinear()
 Test a curve to see if it is linear to within RhinoMath.ZeroTolerance units (1e-12).
IsLinear(Double)
 Test a curve to see if it is linear to within the custom tolerance.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace