RhinoCommon SDK
MaterialRefs.GetEnumerator Method
Rhino for Mac 5.1
 Returns an enumerator that iterates through this dictionary.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<KeyValuePair<Guid, MaterialRef>> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of KeyValuePair(Of Guid, MaterialRef))
Return Value
Type: IEnumerator<KeyValuePair<Guid, MaterialRef>>
 A IEnumerator that can be used to iterate this dictionary.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace