RhinoCommon SDK
Text3d.BoundingBox Property
Rhino for Mac 5.1
 Gets the boundingbox for this Text3d object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
Text3d Class
Rhino.Display Namespace