RhinoCommon SDK
RTreeEventArgs.SearchBoundingBox Property
Rhino for Mac 5.1
 Bounding box bounds used during a search. You may modify the box in a search callback to help reduce the bounds to search.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox SearchBoundingBox { get; set; }
Public Property SearchBoundingBox As BoundingBox
	Get
	Set
Property Value
Type: BoundingBox
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace