RhinoCommon SDK
ObjectMaterialSource Enumeration
Rhino for Mac 5.1
 Defines enumerated values for the source of material of single objects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum ObjectMaterialSource
Public Enumeration ObjectMaterialSource
Members
Member name | Value | Description
MaterialFromLayer | 0 | use material assigned to layer.
MaterialFromObject | 1 | use material assigned to object.
MaterialFromParent | 3 |  for objects with parents, like definition geometry in instance references and faces in polysurfaces, this value indicates the material definition should come from the parent. If the object does not have an obvious "parent", then treat it the same as material_from_layer.
See Also
Reference
Rhino.DocObjects Namespace