RhinoCommon SDK
GetOption Methods
Rhino for Mac 5.1
The GetOption type exposes the following members.
Methods
Name | Description
Get
 Call to get an option. A return value of "option" means the user selected a valid option. Use Option() the determine which option.
Top
See Also
Reference
GetOption Class
Rhino.Input.Custom Namespace