RhinoCommon SDK
CachedTextureCoordinates.GetEnumerator Method
Rhino for Mac 5.1
 Returns an enumerator that iterates through this collection.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<Point3d> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Point3d)
Return Value
Type: IEnumerator<Point3d>
 A enumerator that can be used to iterate through this collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace