RhinoCommon SDK
TaperSpaceMorph Properties
Rhino for Mac 5.1
The TaperSpaceMorph type exposes the following members.
Properties
Name | Description
IsValid
 Returns true if the space morph definition is valid, false otherwise.
Top
See Also
Reference
TaperSpaceMorph Class
Rhino.Geometry.Morphs Namespace