RhinoCommon SDK
ObjectPropertiesPage Constructor
Rhino for Mac 5.1
Initializes a new instance of the ObjectPropertiesPage class
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected ObjectPropertiesPage()
Protected Sub New
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace