RhinoCommon SDK
DisplayPipeline.DrawPointCloud Method (PointCloud, Int32, Color)
Rhino for Mac 5.1
 Draws a point cloud.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawPointCloud(
	PointCloud cloud,
	int size,
	Color color
)
Public Sub DrawPointCloud (
	cloud As PointCloud,
	size As Integer,
	color As Color
)
Parameters
cloud
Type: Rhino.Geometry.PointCloud
Point cloud to draw.
size
Type: System.Int32
Size of points.
color
Type: System.Drawing.Color
Color of points in the cloud, if the cloud has a color array this setting is ignored.
See Also
Reference
DisplayPipeline Class
DrawPointCloud Overload
Rhino.Display Namespace