RhinoCommon SDK
Matrix Constructor (Transform)
Rhino for Mac 5.1
 Initializes a new instance of the matrix based on a 4x4 matrix Transform.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Matrix(
	Transform xform
)
Public Sub New (
	xform As Transform
)
Parameters
xform
Type: Rhino.Geometry.Transform
A 4x4 matrix to copy from.
See Also
Reference
Matrix Class
Matrix Overload
Rhino.Geometry Namespace