RhinoCommon SDK
BinaryArchiveFile.Writer Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.FileIO.BinaryArchiveFile.Writer"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BinaryArchiveWriter Writer { get; }
Public ReadOnly Property Writer As BinaryArchiveWriter
	Get
Property Value
Type: BinaryArchiveWriter
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace