RhinoCommon SDK
File3dm.ReadApplicationData Method
Rhino for Mac 5.1
 Reads only the application information from an existing 3dm file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void ReadApplicationData(
	string path,
	out string applicationName,
	out string applicationUrl,
	out string applicationDetails
)
Public Shared Sub ReadApplicationData (
	path As String,
	<OutAttribute> ByRef applicationName As String,
	<OutAttribute> ByRef applicationUrl As String,
	<OutAttribute> ByRef applicationDetails As String
)
Parameters
path
Type: System.String
A location on disk or network.
applicationName
Type: System.String
The application name. This out parameter is assigned during this call.
applicationUrl
Type: System.String
The application URL. This out parameter is assigned during this call.
applicationDetails
Type: System.String
The application details. This out parameter is assigned during this call.
See Also
Reference
File3dm Class
Rhino.FileIO Namespace