RhinoCommon SDK
AnnotationBase.TextHeight Property
Rhino for Mac 5.1
 Gets or sets the text height in model units.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double TextHeight { get; set; }
Public Property TextHeight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace