RhinoCommon SDK
PolylineCurve Methods
Rhino for Mac 5.1
The PolylineCurve type exposes the following members.
Methods
Name | Description
Point
 Gets a point at a specified index in the polyline curve.
SetPoint
 Sets a point at a specified index in the polyline curve.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The Nurbs Curves segments do not have fully multiple interior knots.
 3. Rational Nurbs curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent Colinear or Cocircular segments are combined.
Top
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace