RhinoCommon SDK
BezierCurve Constructor
Rhino for Mac 5.1
Overload List
Name | Description
BezierCurve(IEnumerable<Point2d>)
 Create bezier curve with controls defined by a list of 2d points
BezierCurve(IEnumerable<Point3d>)
 Create bezier curve with controls defined by a list of 3d points
BezierCurve(IEnumerable<Point4d>)
 Create bezier curve with controls defined by a list of 4d points
Top
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace