RhinoCommon SDK
RhinoPageView.PageHeight Property
Rhino for Mac 5.1
 Height of the page in the document's PageUnitSystem
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double PageHeight { get; set; }
Public Property PageHeight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace