RhinoCommon SDK
Text3d.Bold Property
Rhino for Mac 5.1
 Gets or sets whether this Text3d object will be drawn in Bold.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Bold { get; set; }
Public Property Bold As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Text3d Class
Rhino.Display Namespace