RhinoCommon SDK
Point3dGrid Class
Rhino for Mac 5.1
 Represents a rectangular grid of 3D points.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Point3dGrid
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class Point3dGrid : GeometryBase
<SerializableAttribute>
Public Class Point3dGrid
	Inherits GeometryBase
The Point3dGrid type exposes the following members.
Constructors
Name | Description
Point3dGrid()
 Initializes a rectangular grid of points, with no points in it.
Point3dGrid(Int32, Int32)
 Initializes a rectangular grid of points with a given number of columns and rows.
Point3dGrid(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace