RhinoCommon SDK
GetBaseClass Constructor
Rhino for Mac 5.1
Initializes a new instance of the GetBaseClass class
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected GetBaseClass()
Protected Sub New
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace