RhinoCommon SDK
Interval.Addition Operator (Double, Interval)
Rhino for Mac 5.1
 Shifts an interval by a specific amount (addition).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Interval operator +(
	double number,
	Interval interval
)
Public Shared Operator + (
	number As Double,
	interval As Interval
) As Interval
Parameters
number
Type: System.Double
The shifting value.
interval
Type: Rhino.Geometry.Interval
The interval to be used as a base.
Return Value
Type: Interval
A new interval where T0 and T1 are summed with number.
See Also
Reference
Interval Structure
Addition Overload
Rhino.Geometry Namespace