RhinoCommon SDK
Curve.Trim Method
Rhino for Mac 5.1
Overload List
Name | Description
Trim(Interval)
 Removes portions of the curve outside the specified interval.
Trim(Double, Double)
 Removes portions of the curve outside the specified interval.
Trim(CurveEnd, Double)
 Shortens a curve by a given length
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace