RhinoCommon SDK
ViewportInfo.ZoomToScreenRect Method (Rectangle)
Rhino for Mac 5.1
 Zooms to a screen zone.
View changing from screen input points. Handy for using a mouse to manipulate a view. ZoomToScreenRect() may change camera and frustum settings.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ZoomToScreenRect(
	Rectangle windowRectangle
)
Public Function ZoomToScreenRect (
	windowRectangle As Rectangle
) As Boolean
Parameters
windowRectangle
Type: System.Drawing.Rectangle
The new window rectangle in screen space.
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
ViewportInfo Class
ZoomToScreenRect Overload
Rhino.DocObjects Namespace