RhinoCommon SDK
RhinoViewport.SetConstructionPlane Method (Plane)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.SetConstructionPlane(Rhino.Geometry.Plane)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetConstructionPlane(
	Plane plane
)
Public Sub SetConstructionPlane (
	plane As Plane
)
Parameters
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Display.RhinoViewport.SetConstructionPlane(Rhino.Geometry.Plane)"]
See Also
Reference
RhinoViewport Class
SetConstructionPlane Overload
Rhino.Display Namespace