RhinoCommon SDK
Surface.IsSphere Method (Double)
Rhino for Mac 5.1
 Determines if the surface is a portion of a sphere within a given tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSphere(
	double tolerance
)
Public Function IsSphere (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the surface is a portion of a sphere.
See Also
Reference
Surface Class
IsSphere Overload
Rhino.Geometry Namespace