RhinoCommon SDK
Curve.Fair Method
Rhino for Mac 5.1
 Fairs a curve object. Fair works best on degree 3 (cubic) curves. Attempts to remove large curvature variations while limiting the geometry changes to be no more than the specified tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve Fair(
	double distanceTolerance,
	double angleTolerance,
	int clampStart,
	int clampEnd,
	int iterations
)
Public Function Fair (
	distanceTolerance As Double,
	angleTolerance As Double,
	clampStart As Integer,
	clampEnd As Integer,
	iterations As Integer
) As Curve
Parameters
distanceTolerance
Type: System.Double
Maximum allowed distance the faired curve is allowed to deviate from the input.
angleTolerance
Type: System.Double
(in radians) kinks with angles <= angleTolerance are smoothed out 0.05 is a good default.
clampStart
Type: System.Int32
The number of (control vertices-1) to preserve at start.
0 = preserve start point
1 = preserve start point and 1st derivative
2 = preserve start point, 1st and 2nd derivative
clampEnd
Type: System.Int32
Same as clampStart.
iterations
Type: System.Int32
The number of iteratoins to use in adjusting the curve.
Return Value
Type: Curve
Returns new faired Curve on success, null on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace