RhinoCommon SDK
ObjectTable.ModifyTextureMapping Method
Rhino for Mac 5.1
Overload List
Name | Description
ModifyTextureMapping(Guid, Int32, TextureMapping)
ModifyTextureMapping(ObjRef, Int32, TextureMapping)
ModifyTextureMapping(RhinoObject, Int32, TextureMapping)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace