RhinoCommon SDK
Localization.RunningAsEnglish Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.Localization.RunningAsEnglish"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool RunningAsEnglish { get; }
Public Shared ReadOnly Property RunningAsEnglish As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Localization Class
Rhino.UI Namespace