RhinoCommon SDK
BoundingBox.MakeValid Method
Rhino for Mac 5.1
 Ensures that the box is defined in an increasing fashion along X, Y and Z axes. If the Min or Max points are unset, this function will not change the box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MakeValid()
Public Function MakeValid As Boolean
Return Value
Type: Boolean
true if the box was made valid, false if the box could not be made valid.
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace