RhinoCommon SDK
Curve.IsLinear Method (Double)
Rhino for Mac 5.1
 Test a curve to see if it is linear to within the custom tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsLinear(
	double tolerance
)
Public Function IsLinear (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
Tolerance to use when checking linearity.
Return Value
Type: Boolean
 true if the ends of the curve are farther than tolerance apart and the maximum distance from any point on the curve to the line segment connecting the curve ends is <= tolerance.
See Also
Reference
Curve Class
IsLinear Overload
Rhino.Geometry Namespace