RhinoCommon SDK
PolylineCurve Constructor (IEnumerable<Point3d>)
Rhino for Mac 5.1
 Initializes a new polyline curve by copying its content from another set of points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PolylineCurve(
	IEnumerable<Point3d> points
)
Public Sub New (
	points As IEnumerable(Of Point3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable set of points to copy from. This includes a Polyline object.
See Also
Reference
PolylineCurve Class
PolylineCurve Overload
Rhino.Geometry Namespace