RhinoCommon SDK
Point3d Explicit Conversion (Point3d to Vector3d)
Rhino for Mac 5.1
 Converts a point in a vector, needing casting.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static explicit operator Vector3d (
	Point3d point
)
Public Shared Narrowing Operator CType (
	point As Point3d
) As Vector3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
Return Value
Type: Vector3d
The resulting vector.
See Also
Reference
Point3d Structure
Explicit Overload
Rhino.Geometry Namespace