RhinoCommon SDK
GetPoint Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Input.Custom.GetPoint"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetBaseClass
 Rhino.Input.Custom.GetPoint
 Rhino.Input.Custom.GetTransform
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class GetPoint : GetBaseClass
Public Class GetPoint
	Inherits GetBaseClass
The GetPoint type exposes the following members.
Constructors
Name | Description
GetPoint
Create a new GetPoint.
Top
Properties
Name | Description
DynamicDrawColor
 Color used by CRhinoGetPoint::DynamicDraw to draw the current point and the line from the base point to the current point.
FullFrameRedrawDuringGet
 In the "RARE" case that you need to draw some depth buffered geometry during a Get() operation, setting this value to true will force entire frames to be redrawn while the user moves the mouse. This allows DisplayPipeline events to be triggered as well as OnPostDrawObjects NOTE!! Setting this value to true comes with a significant performance penalty because the scene needs to be fully regenerated every frame where the standard DynamicDraw event draws temporary decorations (geometry) on top of a static scene.
Tag
 Gets or sets an arbitrary object that can be attached to this GetPoint instance. Useful for passing some/ information that you may need in a DynamicDraw event since you can get at this Tag from the GetPointDrawEventArgs.
Top
Methods
Name | Description
AddConstructionPoint
 Adds a point to the list of construction points.
AddConstructionPoints
 Adds points to the list of construction points.
AddSnapPoint
 Adds a point to the list of osnap points.
AddSnapPoints
 Adds points to the list of osnap points.
ClearConstraints
 Removes any explicit constraints added by calls to GetPoint::Constraint() and enable the built-in constraint options.
ClearConstructionPoints
 Remove all construction points.
ClearSnapPoints
 Remove all snap points.
Constrain(Arc)
Constrains the picked point to lie on an arc.
Constrain(Circle)
Constrains the picked point to lie on a circle.
Constrain(Cylinder)
Constrains the picked point to lie on a cylinder.
Constrain(Line)
Constrains the picked point to lie on a line.
Constrain(Sphere)
Constrains the picked point to lie on a sphere.
Constrain(Curve, Boolean)
Constrains the picked point to lie on a curve.
Constrain(Mesh, Boolean)
Constrains the picked point to lie on a mesh.
Constrain(Plane, Boolean)
constrain the picked point to lie on a plane.
Constrain(Point3d, Point3d)
Constrains the picked point to lie on a line.
Constrain(Surface, Boolean)
Constrains the picked point to lie on a surface.
Constrain(Brep, Int32, Int32, Boolean)
Constrains the picked point to lie on a brep.
ConstrainDistanceFromBasePoint
 Sets distance constraint from base point.
ConstrainToConstructionPlane
 If enabled, the picked point is constrained to be on the active construction plane. If the base point is set, then the point is constrained to be on the plane that contains the base point and is parallel to the active construction plane. By default this constraint is enabled.
ConstrainToTargetPlane
 Constrains point to lie on a plane that is parallel to the viewing plane and passes through the view's target point.
ConstrainToVirtualCPlaneIntersection
 If enabled, the picked point is constrained to be on the intersection of the plane and the virtual CPlane going through the plane origin. If the planes are parallel, the constraint works just like planar constraint.
DrawLineFromPoint
 Use DrawLineFromPoint() if you want a dynamic line drawn from a point to the point being picked.
EnableCurveSnapArrow
 Controls display of the curve snap arrow icon.
EnableCurveSnapPerpBar
 Controls display of the curve snap perpendicular bar icon.
EnableCurveSnapTangentBar
 Controls display of the curve snap tangent bar icon.
EnableDrawLineFromPoint
 Controls drawing of dynamic a line from the start point.
EnableSnapToCurves
 If you want GetPoint() to try to snap to curves when the mouse is near a curve (like the center point in the Circle command when the AroundCurve option is on), then enable the snap to curves option.
Get()
 After setting up options and so on, call GetPoint::Get to get a 3d point. The point is retrieved when the mouse goes down.
Get(Boolean)
 After setting up options and so on, call this method to get a 3d point.
GetConstructionPoints
 Gets current construction points.
GetSnapPoints
 Gets current snap points.
InterruptMouseMove
 If you have lengthy computations in OnMouseMove() and/or DymanicDraw() overrides, then periodically call InterruptMouseMove() to see if you should interrupt your work because the mouse has moved again.
OnDynamicDraw
Default calls the DynamicDraw event.
OnMouseDown
Default calls the MouseDown event.
OnMouseMove
Calls the MouseMove event and can/should be called by overriding implementation.
OnPostDrawObjects
 In the "rare" case that you need to draw some depth buffered geometry during a GetPoint operation, override the OnPostDrawObjects function. NOTE!! Overriding this function comes with a significant performance penalty because the scene needs to be fully regenerated every frame where the standard DynamicDraw event draws temporary decorations (geometry) on top of a static scene.
PermitConstraintOptions
 Control the availability of the built-in linear, planar, curve, and surface constraint options like "Along", "AlongPerp", "AlongTan", "AlongParallel", "Between", "OnCrv", "OnSrf", ".x", ".y", ".z", ".xy", etc.
PermitElevatorMode
 Permits the use of the control key to define a line constraint.
PermitFromOption
 Control the availability of the built-in "From" option. By default, the "From" option is enabled.
PermitObjectSnap
 By default, object snaps like "end", "near", etc. are controled by the user. If you want to disable this ability, then call PermitObjectSnap(false).
PermitOrthoSnap
 Controls availability of ortho snap. Default is true.
PermitTabMode
 Permits the use of the tab key to define a line constraint.
PointOnCurve
 Use to determine is point was on a curve.
PointOnObject
 Call this function to see if the point was on an object. If the point was on an object an ObjRef is returned; otherwise null is returned.
SetBasePoint
 Sets a base point used by ortho snap, from snap, planar snap, etc.
TryGetBasePoint
Top
Events
Name | Description
DynamicDraw
 Event to use if you want to dynamically draw things as the mouse/digitizer moves. Every time the mouse moves, DynamicDraw will be called once per viewport. The calls to DynamicDraw happen AFTER the call to MouseMove. If you are drawing anything that takes a long time, periodically call InterruptMouseMove() to see if you should stop.
MouseDown
 Called during Get2dRectangle, Get2dLine, and GetPoint(..,true) when the mouse down event for the initial point occurs. This function is not called during ordinary point getting because the mouse down event terminates an ordinary point get and returns a GetResult.Point result.
MouseMove
 Called every time the mouse moves. MouseMove is called once per mouse move and is called BEFORE any calls to OnDynamicDraw. If you are doing anything that takes a long time, periodically call InterruptMouseMove() to see if you should stop. If the view is such that the 2d screen point can't be mapped to a 3d point, the 'point' argument will be Unset.
PostDrawObjects
 Same as the DisplayPipeline.PostDrawObjects, but only works during the operation of the Get() function. NOTE: You must set FullFrameRedrawDuringGet to true in order for this event to be called.
Top
See Also
Reference
Rhino.Input.Custom Namespace