RhinoCommon SDK
GripObject.GetCageParameters Method
Rhino for Mac 5.1
 Retrieves the 2d parameter space values of this GripObject from the cage it's associated with.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetCageParameters(
	out double u,
	out double v,
	out double w
)
Public Function GetCageParameters (
	<OutAttribute> ByRef u As Double,
	<OutAttribute> ByRef v As Double,
	<OutAttribute> ByRef w As Double
) As Boolean
Parameters
u
Type: System.Double
[Missing <param name="u"/> documentation for "M:Rhino.DocObjects.GripObject.GetCageParameters(System.Double@,System.Double@,System.Double@)"]
v
Type: System.Double
[Missing <param name="v"/> documentation for "M:Rhino.DocObjects.GripObject.GetCageParameters(System.Double@,System.Double@,System.Double@)"]
w
Type: System.Double
[Missing <param name="w"/> documentation for "M:Rhino.DocObjects.GripObject.GetCageParameters(System.Double@,System.Double@,System.Double@)"]
Return Value
Type: Boolean
True on success. Output is unreliable if return is false.
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace