RhinoCommon SDK
LinearDimensionObject Properties
Rhino for Mac 5.1
The LinearDimensionObject type exposes the following members.
Properties
Name | Description
DimensionStyle
 Gets the DimensionStyle associated with this LinearDimensionObject.
Top
See Also
Reference
LinearDimensionObject Class
Rhino.DocObjects Namespace