RhinoCommon SDK
ObjectAttributes.ObjectDecoration Property
Rhino for Mac 5.1
 Used to indicate an object has a decoration (like an arrowhead on a curve)
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectDecoration ObjectDecoration { get; set; }
Public Property ObjectDecoration As ObjectDecoration
	Get
	Set
Property Value
Type: ObjectDecoration
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace