RhinoCommon SDK
RhinoDoc.AddCustomUndoEvent Method (String, EventHandler<CustomUndoEventArgs>)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.RhinoDoc.AddCustomUndoEvent(System.String,System.EventHandler{Rhino.Commands.CustomUndoEventArgs})"]
Namespace: Rhino
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool AddCustomUndoEvent(
	string description,
	EventHandler<CustomUndoEventArgs> handler
)
Public Function AddCustomUndoEvent (
	description As String,
	handler As EventHandler(Of CustomUndoEventArgs)
) As Boolean
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.RhinoDoc.AddCustomUndoEvent(System.String,System.EventHandler{Rhino.Commands.CustomUndoEventArgs})"]
handler
Type: System.EventHandler<CustomUndoEventArgs>
[Missing <param name="handler"/> documentation for "M:Rhino.RhinoDoc.AddCustomUndoEvent(System.String,System.EventHandler{Rhino.Commands.CustomUndoEventArgs})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoDoc.AddCustomUndoEvent(System.String,System.EventHandler{Rhino.Commands.CustomUndoEventArgs})"]
See Also
Reference
RhinoDoc Class
AddCustomUndoEvent Overload
Rhino Namespace