RhinoCommon SDK
PointStyle Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.PointStyle"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum PointStyle
Public Enumeration PointStyle
Members
Member name | Value | Description
Simple | 0
ControlPoint | 1
ActivePoint | 2 |  Like a control point but includes vertical/horizontal crosshair lines.
X | 3
See Also
Reference
Rhino.Display Namespace