RhinoCommon SDK
Point3f.LessThan Operator
Rhino for Mac 5.1
 Determines whether the first specified point comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator <(
	Point3f a,
	Point3f b
)
Public Shared Operator < (
	a As Point3f,
	b As Point3f
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point3f
The first point.
b
Type: Rhino.Geometry.Point3f
The second point.
Return Value
Type: Boolean
true if a.X is smaller than b.X, or a.X == b.X and a.Y is smaller than b.Y, or a.X == b.X and a.Y == b.Y and a.Z is smaller than b.Z; otherwise, false.
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace