RhinoCommon SDK
RevSurface Class
Rhino for Mac 5.1
 Represents a surface of revolution.
Revolutions can be incomplete (they can form arcs).
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.RevSurface
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class RevSurface : Surface
<SerializableAttribute>
Public Class RevSurface
	Inherits Surface
The RevSurface type exposes the following members.
Constructors
Name | Description
RevSurface
 Protected constructor for internal use.
Top
Properties
Name | Description
Top
Methods
Name | Description
Create(Curve, Line)
 Constructs a new surface of revolution from a generatrix curve and an axis.
Create(Line, Line)
 Constructs a new surface of revolution from a generatrix line and an axis.
If the operation succeeds, results can be (truncated) cones, cylinders and circular hyperboloids.
Create(Polyline, Line)
 Constructs a new surface of revolution from a generatrix polyline and an axis.
Create(Curve, Line, Double, Double)
 Constructs a new surface of revolution from a generatrix curve and an axis.
This overload accepts a slice start and end angles.
Create(Line, Line, Double, Double)
 Constructs a new surface of revolution from a generatrix line and an axis.
This overload accepts a slice start and end angles.
Results can be (truncated) cones, cylinders and circular hyperboloids, or can fail.
Create(Polyline, Line, Double, Double)
 Constructs a new surface of revolution from a generatrix polyline and an axis.
This overload accepts a slice start and end angles.
CreateFromCone
 Constructs a new surface of revolution from the values of a cone.
CreateFromCylinder
 Constructs a new surface of revolution from the values of a cylinder.
CreateFromSphere
 Constructs a new surface of revolution from the values of a sphere.
CreateFromTorus
 Constructs a new surface of revolution from the values of a torus.
Top
See Also
Reference
Rhino.Geometry Namespace