RhinoCommon SDK
Circle.IsInPlane Method
Rhino for Mac 5.1
 Evaluates whether or not this circle is co-planar with a given plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsInPlane(
	Plane plane,
	double tolerance
)
Public Function IsInPlane (
	plane As Plane,
	tolerance As Double
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
Plane.
tolerance
Type: System.Double
Tolerance to use.
Return Value
Type: Boolean
true if the circle plane is co-planar with the given plane within tolerance.
See Also
Reference
Circle Structure
Rhino.Geometry Namespace