RhinoCommon SDK
DimStyleTable.Add Method (String, Boolean)
Rhino for Mac 5.1
 Adds a new dimension style to the document. The new dimension style will be initialized with the current default dimension style properties.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	string name,
	bool reference
)
Public Function Add (
	name As String,
	reference As Boolean
) As Integer
Parameters
name
Type: System.String
 Name of the new dimension style. If null or empty, Rhino automatically generates the name.
reference
Type: System.Boolean
if true the dimstyle will not be saved in files.
Return Value
Type: Int32
index of new dimension style.
See Also
Reference
DimStyleTable Class
Add Overload
Rhino.DocObjects.Tables Namespace