RhinoCommon SDK
MeshVertexList.Hide Method
Rhino for Mac 5.1
 Hides the vertex at the given index.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Hide(
	int vertexIndex
)
Public Sub Hide (
	vertexIndex As Integer
)
Parameters
vertexIndex
Type: System.Int32
Index of vertex to hide.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace