RhinoCommon SDK
Curve.GetLength Method (Interval)
Rhino for Mac 5.1
Get the length of a sub-section of the curve with a fractional tolerance of 1e-8.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double GetLength(
	Interval subdomain
)
Public Function GetLength (
	subdomain As Interval
) As Double
Parameters
subdomain
Type: Rhino.Geometry.Interval
 The calculation is performed on the specified sub-domain of the curve (must be non-decreasing).
Return Value
Type: Double
The length of the sub-curve on success, or zero on failure.
See Also
Reference
Curve Class
GetLength Overload
Rhino.Geometry Namespace