RhinoCommon SDK
Plane Constructor (Point3d, Vector3d, Vector3d)
Rhino for Mac 5.1
 Constructs a plane from a point and two vectors in the plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Plane(
	Point3d origin,
	Vector3d xDirection,
	Vector3d yDirection
)
Public Sub New (
	origin As Point3d,
	xDirection As Vector3d,
	yDirection As Vector3d
)
Parameters
origin
Type: Rhino.Geometry.Point3d
Origin point of the plane.
xDirection
Type: Rhino.Geometry.Vector3d
 Non-zero vector in the plane that determines the x-axis direction.
yDirection
Type: Rhino.Geometry.Vector3d
 Non-zero vector not parallel to x_dir that is used to determine the yaxis direction. y_dir does not need to be perpendicular to x_dir.
See Also
Reference
Plane Structure
Plane Overload
Rhino.Geometry Namespace