RhinoCommon SDK
NurbsSurfaceKnotList.InsertKnot Method (Double, Int32)
Rhino for Mac 5.1
 Inserts a knot and update control point locations. Does not change parameterization or locus of curve.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool InsertKnot(
	double value,
	int multiplicity
)
Public Function InsertKnot (
	value As Double,
	multiplicity As Integer
) As Boolean
Parameters
value
Type: System.Double
Knot value to insert.
multiplicity
Type: System.Int32
Multiplicity of knot to insert.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsSurfaceKnotList Class
InsertKnot Overload
Rhino.Geometry.Collections Namespace