RhinoCommon SDK
RhinoObject.IsSubObjectSelectable Method
Rhino for Mac 5.1
Reports if a subobject can be selected.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSubObjectSelectable(
	ComponentIndex componentIndex,
	bool ignoreSelectionState
)
Public Function IsSubObjectSelectable (
	componentIndex As ComponentIndex,
	ignoreSelectionState As Boolean
) As Boolean
Parameters
componentIndex
Type: Rhino.Geometry.ComponentIndex
index of subobject to check.
ignoreSelectionState
Type: System.Boolean
 If true, then selected objects are selectable. If false, then selected objects are not selectable.
Return Value
Type: Boolean
true if the specified subobject can be selected.
Remarks
 Objects that are locked, hidden, or on locked or hidden layers cannot be selected. If IsSelectableWithGripsOn() returns false, then that object is not selectable if it has grips turned on.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace