RhinoCommon SDK
RhinoView.Bounds Property
Rhino for Mac 5.1
 Gets or sets the size and location of the view including its nonclient elements, in pixels, relative to the parent control.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Rectangle Bounds { get; }
Public ReadOnly Property Bounds As Rectangle
	Get
Property Value
Type: Rectangle
See Also
Reference
RhinoView Class
Rhino.Display Namespace