RhinoCommon SDK
LightTable.Add Method
Rhino for Mac 5.1
Overload List
Name | Description
Add(Light)
Add(Light, ObjectAttributes)
Top
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace