RhinoCommon SDK
Rectangle3d.ToPolyline Method
Rhino for Mac 5.1
 Constructs a polyline from this rectangle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Polyline ToPolyline()
Public Function ToPolyline As Polyline
Return Value
Type: Polyline
A polyline with the same shape as this rectangle.
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace