RhinoCommon SDK
DisplayPipeline.DrawLines Method (IEnumerable<Line>, Color)
Rhino for Mac 5.1
 Draws a set of lines with a given color and thickness. If you want the fastest possible set of lines to be drawn, pass a Line[] for lines.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawLines(
	IEnumerable<Line> lines,
	Color color
)
Public Sub DrawLines (
	lines As IEnumerable(Of Line),
	color As Color
)
Parameters
lines
Type: System.Collections.Generic.IEnumerable<Line>
Lines to draw.
color
Type: System.Drawing.Color
Color to draw with.
See Also
Reference
DisplayPipeline Class
DrawLines Overload
Rhino.Display Namespace