RhinoCommon SDK
Matrix.BackSolve Method
Rhino for Mac 5.1
 Solves M*x=b where M is upper triangular with a unit diagonal and b is a column of values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double[] BackSolve(
	double zeroTolerance,
	double[] b
)
Public Function BackSolve (
	zeroTolerance As Double,
	b As Double()
) As Double()
Parameters
zeroTolerance
Type: System.Double
(>=0.0) used to test for "zero" values in b in underdetermined systems of equations.
b
Type: System.Double[]
The values in B[RowCount],...,B[B.Length-1] are tested to make sure they are within "zeroTolerance".
Return Value
Type: Double[]
 Array of length ColumnCount on success. null on error.
See Also
Reference
Matrix Class
Rhino.Geometry Namespace