RhinoCommon SDK
Vector3d.ToString Method
Rhino for Mac 5.1
 Returns the string representation of the current vector, in the form X,Y,Z.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A string with the current location of the point.
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace