RhinoCommon SDK
Point2d.Addition Operator (Vector2d, Point2d)
Rhino for Mac 5.1
 Adds a vector with a point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point2d operator +(
	Vector2d vector,
	Point2d point
)
Public Shared Operator + (
	vector As Vector2d,
	point As Point2d
) As Point2d
Parameters
vector
Type: Rhino.Geometry.Vector2d
A vector.
point
Type: Rhino.Geometry.Point2d
A point.
Return Value
Type: Point2d
A new point that is coordinatewise summed with the vector.
See Also
Reference
Point2d Structure
Addition Overload
Rhino.Geometry Namespace