RhinoCommon SDK
TextDot Properties
Rhino for Mac 5.1
The TextDot type exposes the following members.
Properties
Name | Description
FontFace
Font face used for displaying the dot
FontHeight
 Height of font used for displaying the dot
Point
 Gets or sets the position of the textdot.
Text
 Gets or sets the text of the textdot.
Top
See Also
Reference
TextDot Class
Rhino.Geometry Namespace