RhinoCommon SDK
EarthAnchorPoint.EarthBasepointLongitude Property
Rhino for Mac 5.1
 Gets or sets the point longitude on earth, in decimal degrees.
0 = prime meridian (Greenwich meridian)
Values increase towards West
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double EarthBasepointLongitude { get; set; }
Public Property EarthBasepointLongitude As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace