RhinoCommon SDK
Vector3f.ToString Method
Rhino for Mac 5.1
 Constructs the string representation of the current vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The vector representation in the form X,Y,Z.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace