RhinoCommon SDK
RhinoView.CaptureToBitmap Method (Size, DisplayModeDescription)
Rhino for Mac 5.1
 Capture View contents to a bitmap using a display mode description to define how drawing is performed.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Bitmap CaptureToBitmap(
	Size size,
	DisplayModeDescription mode
)
Public Function CaptureToBitmap (
	size As Size,
	mode As DisplayModeDescription
) As Bitmap
Parameters
size
Type: System.Drawing.Size
The width and height of the returned bitmap.
mode
Type: Rhino.Display.DisplayModeDescription
The display mode.
Return Value
Type: Bitmap
A new bitmap.
See Also
Reference
RhinoView Class
CaptureToBitmap Overload
Rhino.Display Namespace