RhinoCommon SDK
RhinoView.CaptureToBitmap Method (DisplayPipelineAttributes)
Rhino for Mac 5.1
 Captures view contents to a bitmap using display attributes to define how drawing is performed.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Bitmap CaptureToBitmap(
	DisplayPipelineAttributes attributes
)
Public Function CaptureToBitmap (
	attributes As DisplayPipelineAttributes
) As Bitmap
Parameters
attributes
Type: Rhino.Display.DisplayPipelineAttributes
The specific display mode attributes.
Return Value
Type: Bitmap
A new bitmap.
See Also
Reference
RhinoView Class
CaptureToBitmap Overload
Rhino.Display Namespace