RhinoCommon SDK
RhinoView.CaptureToBitmap Method (Size)
Rhino for Mac 5.1
 Capture View contents to a bitmap.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Bitmap CaptureToBitmap(
	Size size
)
Public Function CaptureToBitmap (
	size As Size
) As Bitmap
Parameters
size
Type: System.Drawing.Size
Size of Bitmap to capture to.
Return Value
Type: Bitmap
The bitmap of the specified part of the view.
See Also
Reference
RhinoView Class
CaptureToBitmap Overload
Rhino.Display Namespace