RhinoCommon SDK
RhinoView.CaptureToBitmap Method (Boolean, Boolean, Boolean)
Rhino for Mac 5.1
 Captures the view contents to a bitmap allowing for visibility of grid and axes.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Bitmap CaptureToBitmap(
	bool grid,
	bool worldAxes,
	bool cplaneAxes
)
Public Function CaptureToBitmap (
	grid As Boolean,
	worldAxes As Boolean,
	cplaneAxes As Boolean
) As Bitmap
Parameters
grid
Type: System.Boolean
true if the construction plane grid should be visible.
worldAxes
Type: System.Boolean
true if the world axis should be visible.
cplaneAxes
Type: System.Boolean
true if the construction plane close the the grid should be visible.
Return Value
Type: Bitmap
A new bitmap.
Examples
using System;
using System.Windows.Forms;
using Rhino;
using Rhino.Commands;
namespace examples_cs
{
  public class CaptureViewToBitmapCommand : Rhino.Commands.Command
  {
    public override string EnglishName
    {
      get { return "csCaptureViewToBitmap"; }
    }
    protected override Result RunCommand(RhinoDoc doc, RunMode mode)
    {
      var file_name = "";
      var bitmap = doc.Views.ActiveView.CaptureToBitmap(true, true, true);
      bitmap.MakeTransparent();
      // copy bitmap to clipboard
      Clipboard.SetImage(bitmap);
      // save bitmap to file
      var save_file_dialog = new Rhino.UI.SaveFileDialog
      {
        Filter = "*.bmp",
        InitialDirectory = Environment.GetFolderPath(Environment.SpecialFolder.MyDocuments)
      };
      if (save_file_dialog.ShowDialog() == DialogResult.OK)
      {
        file_name = save_file_dialog.FileName;
      }
      if (file_name != "")
        bitmap.Save(file_name);
      return Rhino.Commands.Result.Success;
    }
  }
}
Imports System.Windows.Forms
Imports Rhino
Imports Rhino.Commands
Namespace examples_vb
  Public Class CaptureViewToBitmapCommand
    Inherits Rhino.Commands.Command
    Public Overrides ReadOnly Property EnglishName() As String
      Get
        Return "vbCaptureViewToBitmap"
      End Get
    End Property
    Protected Overrides Function RunCommand(doc As RhinoDoc, mode As RunMode) As Result
      Dim file_name = ""
      Dim bitmap = doc.Views.ActiveView.CaptureToBitmap(True, True, True)
      ' copy bitmap to clipboard
      Clipboard.SetImage(bitmap)
      ' save bitmap to file
      Dim save_file_dialog = New Rhino.UI.SaveFileDialog()
      save_file_dialog.Filter = "*.bmp"
      save_file_dialog.InitialDirectory =
        Environment.GetFolderPath(Environment.SpecialFolder.MyDocuments)
      If save_file_dialog.ShowDialog() = DialogResult.OK Then
        file_name = save_file_dialog.FileName
      End If
      If file_name <> "" Then
        bitmap.Save(file_name)
      End If
      Return Rhino.Commands.Result.Success
    End Function
  End Class
End Namespace
from scriptcontext import doc
from System.Windows.Forms import *
import Rhino.UI
from System import Environment
def RunCommand():
  file_name = "";
  bitmap = doc.Views.ActiveView.CaptureToBitmap(True, True, True)
  # copy bitmap to clipboard
  Clipboard.SetImage(bitmap)
  # save bitmap to file
  save_file_dialog = Rhino.UI.SaveFileDialog()
  save_file_dialog.Filter = "*.bmp"
  save_file_dialog.InitialDirectory = \
    Environment.GetFolderPath(Environment.SpecialFolder.MyDocuments)
  if save_file_dialog.ShowDialog() == DialogResult.OK:
    file_name = save_file_dialog.FileName
  if file_name != "":
    bitmap.Save(file_name)
  return Rhino.Commands.Result.Success
if __name__ == "__main__":
  RunCommand()
See Also
Reference
RhinoView Class
CaptureToBitmap Overload
Rhino.Display Namespace