RhinoCommon SDK
RhinoView.CaptureToBitmap Method (Size, Boolean, Boolean, Boolean)
Rhino for Mac 5.1
 Captures a part of the view contents to a bitmap allowing for visibility of grid and axes.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Bitmap CaptureToBitmap(
	Size size,
	bool grid,
	bool worldAxes,
	bool cplaneAxes
)
Public Function CaptureToBitmap (
	size As Size,
	grid As Boolean,
	worldAxes As Boolean,
	cplaneAxes As Boolean
) As Bitmap
Parameters
size
Type: System.Drawing.Size
The width and height of the returned bitmap.
grid
Type: System.Boolean
true if the construction plane grid should be visible.
worldAxes
Type: System.Boolean
true if the world axis should be visible.
cplaneAxes
Type: System.Boolean
true if the construction plane close the the grid should be visible.
Return Value
Type: Bitmap
A new bitmap.
See Also
Reference
RhinoView Class
CaptureToBitmap Overload
Rhino.Display Namespace