RhinoCommon SDK
Panels.IsPanelVisible Method (Guid)
Rhino for Mac 5.1
 Check to see if a panel is currently visible, on Windows this means you can see the tab, it does not necessarily mean it is the current tab.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool IsPanelVisible(
	Guid panelId
)
Public Shared Function IsPanelVisible (
	panelId As Guid
) As Boolean
Parameters
panelId
Type: System.Guid
 Class Id for the panel to check.
Return Value
Type: Boolean
 Returns true if the tab is visible otherwise it returns false.
See Also
Reference
Panels Class
IsPanelVisible Overload
Rhino.UI Namespace