RhinoCommon SDK
Layer Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Layer"]
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.Layer
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class Layer : CommonObject
<SerializableAttribute>
Public Class Layer
	Inherits CommonObject
The Layer type exposes the following members.
Constructors
Name | Description
Layer()
Initializes a new instance of the Layer class
Layer(SerializationInfo, StreamingContext)
Initializes a new instance of the Layer class
Top
Properties
Name | Description
Color
 Gets or sets the display color for this layer.
FullPath
 Gets the full path to this layer. The full path includes nesting information.
Id
 Gets or sets the ID of this layer object. You typically do not need to assign a custom ID.
IgesLevel
 Gets or sets the IGES level for this layer.
IsDeleted
 Gets a value indicating whether this layer has been deleted and is currently in the Undo buffer.
IsExpanded
 Gets or sets a value indicating whether this layer is expanded in the Rhino Layer dialog.
IsLocked
 Gets or sets a value indicating the locked state of this layer.
IsReference
 Gets a value indicting whether this layer is a referenced layer. Referenced layers are part of referenced documents.
IsVisible
 Gets or sets the visibility of this layer.
LayerIndex
 Gets or sets the index of this layer.
LinetypeIndex
 Gets or sets the line-type index for this layer.
Name
Gets or sets the name of this layer.
ParentLayerId
 Gets the ID of the parent layer. Layers can be origanized in a hierarchical structure, in which case this returns the parent layer ID. If the layer has no parent, Guid.Empty will be returned.
PlotColor
 Gets or sets the plot color for this layer.
PlotWeight
 Gets or sets the thickness of the plotting pen in millimeters. A thickness of 0.0 indicates the "default" pen weight should be used.
RenderMaterialIndex
 Gets or sets the index of render material for objects on this layer that have MaterialSource() == MaterialFromLayer. A material index of -1 indicates no material has been assigned and the material created by the default Material constructor should be used.
SortIndex
 Runtime index used to sort layers in layer dialog.
UserStringCount
 Gets the amount of user strings.
Top
Methods
Name | Description
CommitChanges
Default
 Sets layer to default settings.
GetChildren
 Gets immediate children of this layer. Note that child layers may have their own children.
GetDefaultLayerProperties
 Constructs a layer with the current default properties. The default layer properties are:
color = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerColor
line style = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerLineStyle
material index = -1
iges level = -1
mode = NormalLayer
name = empty
layer index = 0 (ignored by AddLayer)
GetPersistentLocking
 The persistent locking setting is used for layers that can be locked by a "parent" object. A common case is when a layer is a child layer (Layer.ParentI is not nil). In this case, when a parent layer is locked, then child layers are also locked. The persistent locking setting determines what happens when the parent is unlocked again.
GetPersistentVisibility
 The persistent visbility setting is used for layers whose visibilty can be changed by a "parent" object. A common case is when a layer is a child layer (ParentId is not nil). In this case, when a parent layer is turned off, then child layers are also turned off. The persistent visibility setting determines what happens when the parent is turned on again.
GetUserString
 Gets user string from this geometry.
GetUserStrings
 Gets a copy of all (user key string, user value string) pairs attached to this geometry.
IsChildOf(Int32)
IsChildOf(Layer)
IsParentOf(Int32)
IsParentOf(Layer)
IsValidName
 Determines if a given string is valid for a layer name.
SetPersistentLocking
 Set the persistent locking setting for this layer
SetPersistentVisibility
 Set the persistent visibility setting for this layer
SetUserString
 Attach a user string (key,value combination) to this geometry.
ToString |  (Overrides Object.ToString().)
UnsetPersistentLocking
 Remove any explicity persistent locking settings from this layer
UnsetPersistentVisibility
 Remove any explicit persistent visibility setting from this layer
Top
See Also
Reference
Rhino.DocObjects Namespace