RhinoCommon SDK
MorphControl Constructor (NurbsCurve, NurbsCurve)
Rhino for Mac 5.1
 Constructs a MorphControl that allows for morphing between two curves.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MorphControl(
	NurbsCurve originCurve,
	NurbsCurve targetCurve
)
Public Sub New (
	originCurve As NurbsCurve,
	targetCurve As NurbsCurve
)
Parameters
originCurve
Type: Rhino.Geometry.NurbsCurve
The origin curve for morphing.
targetCurve
Type: Rhino.Geometry.NurbsCurve
The target curve for morphing.
See Also
Reference
MorphControl Class
MorphControl Overload
Rhino.Geometry Namespace