RhinoCommon SDK
Material.SetEnvironmentTexture Method
Rhino for Mac 5.1
Overload List
Name | Description
SetEnvironmentTexture(String)
SetEnvironmentTexture(Texture)
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace