RhinoCommon SDK
TextLog Class
Rhino for Mac 5.1
 Used for collecting text data
Inheritance Hierarchy
System.Object
 Rhino.FileIO.TextLog
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class TextLog : IDisposable
Public Class TextLog
	Implements IDisposable
The TextLog type exposes the following members.
Constructors
Name | Description
TextLog()
 Creates a text log that stores all text in memory. Use ToString on this version of the TextLog to get the text that we written
TextLog(String)
 Creates a text log that writes all text to a file. If no filename is provided, then text is written to StdOut
Top
Properties
Name | Description
IndentSize
 0: one tab per indent. >0: number of spaces per indent
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
PopIndent
 Decrease the indentation level
Print(String)
 Send text to the textlog
Print(String, Object)
 Send formatted text to the textlog
Print(String, Object, Object)
 Send formatted text to the textlog
PrintWrappedText
 Send text wrapped at a set line length
PushIndent
 Increase the indentation level
ToString
 If the TextLog was constructed using the empty constructor, then the text information is stored in a runtime string. The contents of this string is retrieved using ToString for this case
 (Overrides Object.ToString().)
Top
See Also
Reference
Rhino.FileIO Namespace