RhinoCommon SDK
Vector2f.EpsilonEquals Method
Rhino for Mac 5.1
 Check that all values in other are withing epsilon of the values in this
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool EpsilonEquals(
	Vector2f other,
	float epsilon
)
Public Function EpsilonEquals (
	other As Vector2f,
	epsilon As Single
) As Boolean
Parameters
other
Type: Rhino.Geometry.Vector2f
epsilon
Type: System.Single
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Vector2f.EpsilonEquals(Rhino.Geometry.Vector2f,System.Single)"]
Implements
IEpsilonFComparable<T>.EpsilonEquals(T, Single)
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace