RhinoCommon SDK
NurbsSurfacePointList.EnsurePrivateCopy Method
Rhino for Mac 5.1
 If you want to keep a copy of this class around by holding onto it in a variable after a command completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can call this function as many times as you want.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnsurePrivateCopy()
Public Sub EnsurePrivateCopy
See Also
Reference
NurbsSurfacePointList Class
Rhino.Geometry.Collections Namespace