RhinoCommon SDK
Vector3f.Multiply Operator
Rhino for Mac 5.1
Overload List
Name | Description
Multiply(Single, Vector3f)
 Multiplies a vector by a number, having the effect of scaling it.
Multiply(Vector3f, Vector3f)
 Multiplies two vectors together, returning the dot product (or inner product). This differs from the cross product.
Multiply(Vector3f, Single)
 Multiplies a vector by a number, having the effect of scaling it.
Top
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace