RhinoCommon SDK
RhinoObject.IsValid Property
Rhino for Mac 5.1
 Tests an object to see if its data members are correctly initialized.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace