RhinoCommon SDK
Material.TransparentColor Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.TransparentColor"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color TransparentColor { get; set; }
Public Property TransparentColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Material Class
Rhino.DocObjects Namespace