RhinoCommon SDK
File3dm.IsValid Method
Rhino for Mac 5.1
Overload List
Name | Description
IsValid(String)
 Checks a model to make sure it is valid.
IsValid(TextLog)
 Checks a model to make sure it is valid.
Top
See Also
Reference
File3dm Class
Rhino.FileIO Namespace