RhinoCommon SDK
CustomDisplay.AddCircle Method (Circle, Color, Int32)
Rhino for Mac 5.1
 Adds a new, colored circle to the display list.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddCircle(
	Circle circle,
	Color color,
	int thickness
)
Public Sub AddCircle (
	circle As Circle,
	color As Color,
	thickness As Integer
)
Parameters
circle
Type: Rhino.Geometry.Circle
Circle to add.
color
Type: System.Drawing.Color
Color of circle.
thickness
Type: System.Int32
Thickness of circle.
See Also
Reference
CustomDisplay Class
AddCircle Overload
Rhino.Display Namespace