RhinoCommon SDK
MeshTextureCoordinateList.SetTextureCoordinates Method (Point2f[])
Rhino for Mac 5.1
 Sets all texture coordinates in one go.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetTextureCoordinates(
	Point2f[] textureCoordinates
)
Public Function SetTextureCoordinates (
	textureCoordinates As Point2f()
) As Boolean
Parameters
textureCoordinates
Type: Rhino.Geometry.Point2f[]
Texture coordinates to assign to the mesh.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshTextureCoordinateList Class
SetTextureCoordinates Overload
Rhino.Geometry.Collections Namespace