RhinoCommon SDK
GetPointMouseEventArgs.ShiftKeyDown Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.ShiftKeyDown"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ShiftKeyDown { get; }
Public ReadOnly Property ShiftKeyDown As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace