RhinoCommon SDK
GroupTableEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.GroupTableEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.Tables.GroupTableEventArgs
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class GroupTableEventArgs : EventArgs
Public Class GroupTableEventArgs
	Inherits EventArgs
The GroupTableEventArgs type exposes the following members.
Properties
Name | Description
Document
EventType
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace