RhinoCommon SDK
AreaMassProperties Class
Rhino for Mac 5.1
 Contains static initialization methods and allows access to the computed metrics of area, area centroid and area moments in closed planar curves, in meshes, in surfaces, in hatches and in boundary representations.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.AreaMassProperties
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class AreaMassProperties : IDisposable
Public Class AreaMassProperties
	Implements IDisposable
The AreaMassProperties type exposes the following members.
Properties
Name | Description
Area
 Gets the area solution.
AreaError
 Gets the uncertainty in the area calculation.
Centroid
 Gets the area centroid in the world coordinate system.
CentroidCoordinatesMomentsOfInertia
 Moments of inertia with respect to centroid coordinate system. X = integral of ((y-y0)^2 + (z-z0)^2) dm Y = integral of ((z-z0)^2 + (x-x0)^2) dm Z = integral of ((z-z0)^2 + (y-y0)^2) dm where (x0,y0,z0) = centroid.
CentroidCoordinatesMomentsOfInertiaError
 Uncertainty in centroid coordinates moments of inertia calculation.
CentroidCoordinatesRadiiOfGyration
 Radii of gyration with respect to centroid coordinate system. X = sqrt(integral of ((y-y0)^2 + (z-z0)^2) dm/M) Y = sqrt(integral of ((z-z0)^2 + (x-x0)^2) dm/M) Z = sqrt(integral of ((z-z0)^2 + (y-y0)^2) dm/M) where (x0,y0,z0) = centroid.
CentroidCoordinatesSecondMoments
 Second moments with respect to centroid coordinate system. X = integral of (x-x0)^2 dm Y = integral of (y-y0)^2 dm Z = integral of (z-z0)^2 dm where (x0,y0,z0) = centroid.
CentroidCoordinatesSecondMomentsError
 Uncertainty in centroid coordinates second moments calculation.
CentroidError
 Gets the uncertainty in the centroid calculation.
WorldCoordinatesFirstMoments
 Returns the world coordinate first moments if they were able to be calculated. X is integral of "x dm" over the area Y is integral of "y dm" over the area Z is integral of "z dm" over the area.
WorldCoordinatesFirstMomentsError
 Uncertainty in world coordinates first moments calculation.
WorldCoordinatesMomentsOfInertia
 The moments of inertia about the world coordinate axes. X = integral of (y^2 + z^2) dm Y = integral of (z^2 + x^2) dm Z = integral of (z^2 + y^2) dm.
WorldCoordinatesMomentsOfInertiaError
 Uncertainty in world coordinates moments of inertia calculation.
WorldCoordinatesProductMoments
 Returns the world coordinate product moments if they were able to be calculated. X is integral of "xy dm" over the area Y is integral of "yz dm" over the area Z is integral of "zx dm" over the area.
WorldCoordinatesProductMomentsError
 Uncertainty in world coordinates second moments calculation.
WorldCoordinatesRadiiOfGyration
 Radii of gyration with respect to world coordinate system. X = sqrt(integral of (y^2 + z^2) dm/M) Y = sqrt(integral of (z^2 + x^2) dm/M) Z = sqrt(integral of (z^2 + y^2) dm/M)
WorldCoordinatesSecondMoments
 Returns the world coordinate first moments if they were able to be calculated. X is integral of "xx dm" over the area Y is integral of "yy dm" over the area Z is integral of "zz dm" over the area.
WorldCoordinatesSecondMomentsError
 Uncertainty in world coordinates second moments calculation.
Top
Methods
Name | Description
Compute(Brep)
 Computes an AreaMassProperties for a brep.
Compute(Curve)
 Computes an AreaMassProperties for a closed planar curve.
Compute(IEnumerable<GeometryBase>)
 Computes the Area properties for a collection of geometric objects. At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
Compute(Hatch)
 Computes an AreaMassProperties for a hatch.
Compute(Mesh)
 Computes an AreaMassProperties for a mesh.
Compute(Surface)
 Computes an AreaMassProperties for a surface.
Compute(Curve, Double)
 Computes an AreaMassProperties for a closed planar curve.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Geometry Namespace