RhinoCommon SDK
Box Constructor (Plane, Interval, Interval, Interval)
Rhino for Mac 5.1
 Initializes a new box from a base Plane and three Intervals.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Box(
	Plane basePlane,
	Interval xSize,
	Interval ySize,
	Interval zSize
)
Public Sub New (
	basePlane As Plane,
	xSize As Interval,
	ySize As Interval,
	zSize As Interval
)
Parameters
basePlane
Type: Rhino.Geometry.Plane
Orientation plane of the box.
xSize
Type: Rhino.Geometry.Interval
Dimensions along the base plane X-Axis.
ySize
Type: Rhino.Geometry.Interval
Dimensions along the base plane Y-Axis.
zSize
Type: Rhino.Geometry.Interval
Dimensions along the base plane Z-Axis.
See Also
Reference
Box Structure
Box Overload
Rhino.Geometry Namespace