RhinoCommon SDK
Cylinder.TotalHeight Property
Rhino for Mac 5.1
 Gets the height of the cylinder. Infinite cylinders have a height of zero, not Double.PositiveInfinity.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double TotalHeight { get; }
Public ReadOnly Property TotalHeight As Double
	Get
Property Value
Type: Double
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace