RhinoCommon SDK
MeshVertexNormalList.Count Property
Rhino for Mac 5.1
 Gets or sets the number of mesh vertex normals.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Count { get; set; }
Public Property Count As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace