RhinoCommon SDK
RhinoObject.HighlightSubObject Method
Rhino for Mac 5.1
 Highlights a subobject.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool HighlightSubObject(
	ComponentIndex componentIndex,
	bool highlight
)
Public Function HighlightSubObject (
	componentIndex As ComponentIndex,
	highlight As Boolean
) As Boolean
Parameters
componentIndex
Type: Rhino.Geometry.ComponentIndex
A subobject component index.
highlight
Type: System.Boolean
true if the subobject should be highlighted.
Return Value
Type: Boolean
true if the subobject is now highlighted.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace