RhinoCommon SDK
LinetypeTable.LinetypeScale Property
Rhino for Mac 5.1
 For display in Rhino viewports, the linetypes are scaled by a single scale factor for all viewports. This is not used for printing, where all linetype patterns are scaled to print in their defined size 1:1 on the paper.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double LinetypeScale { get; set; }
Public Property LinetypeScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace