RhinoCommon SDK
RhinoViewport.GetWorldToScreenScale Method
Rhino for Mac 5.1
 Gets the world to screen size scaling factor at a point in frustum.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetWorldToScreenScale(
	Point3d pointInFrustum,
	out double pixelsPerUnit
)
Public Function GetWorldToScreenScale (
	pointInFrustum As Point3d,
	<OutAttribute> ByRef pixelsPerUnit As Double
) As Boolean
Parameters
pointInFrustum
Type: Rhino.Geometry.Point3d
A point in frustum.
pixelsPerUnit
Type: System.Double
 scale = number of pixels per world unit at the 3d point.
This out parameter is assigned during this call.
Return Value
Type: Boolean
true if the operation is successful.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace