RhinoCommon SDK
BendSpaceMorph Constructor (Point3d, Point3d, Point3d, Boolean, Boolean)
Rhino for Mac 5.1
 Constructs a bend space morph.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BendSpaceMorph(
	Point3d start,
	Point3d end,
	Point3d point,
	bool straight,
	bool symmetric
)
Public Sub New (
	start As Point3d,
	end As Point3d,
	point As Point3d,
	straight As Boolean,
	symmetric As Boolean
)
Parameters
start
Type: Rhino.Geometry.Point3d
Start of spine that represents the original orientation of the object.
end
Type: Rhino.Geometry.Point3d
End of spine.
point
Type: Rhino.Geometry.Point3d
Point to bend through.
straight
Type: System.Boolean
If false, then point determines the region to bend. If true, only the spine region is bent.
symmetric
Type: System.Boolean
If false, then only one end of the object bends. If true, then the object will bend symmetrically around the center if you start the spine in the middle of the object.
See Also
Reference
BendSpaceMorph Class
BendSpaceMorph Overload
Rhino.Geometry.Morphs Namespace