RhinoCommon SDK
SweepOneRail.PerformSweepRefit Method (Curve, IEnumerable<Curve>, IEnumerable<Double>, Double)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Double)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] PerformSweepRefit(
	Curve rail,
	IEnumerable<Curve> crossSections,
	IEnumerable<double> crossSectionParameters,
	double refitTolerance
)
Public Function PerformSweepRefit (
	rail As Curve,
	crossSections As IEnumerable(Of Curve),
	crossSectionParameters As IEnumerable(Of Double),
	refitTolerance As Double
) As Brep()
Parameters
rail
Type: Rhino.Geometry.Curve
[Missing <param name="rail"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Double)"]
crossSections
Type: System.Collections.Generic.IEnumerable<Curve>
[Missing <param name="crossSections"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Double)"]
crossSectionParameters
Type: System.Collections.Generic.IEnumerable<Double>
[Missing <param name="crossSectionParameters"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Double)"]
refitTolerance
Type: System.Double
[Missing <param name="refitTolerance"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Double)"]
Return Value
Type: Brep[]
[Missing <returns> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Double)"]
See Also
Reference
SweepOneRail Class
PerformSweepRefit Overload
Rhino.Geometry Namespace