RhinoCommon SDK
AreaMassProperties.Compute Method (Brep)
Rhino for Mac 5.1
 Computes an AreaMassProperties for a brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static AreaMassProperties Compute(
	Brep brep
)
Public Shared Function Compute (
	brep As Brep
) As AreaMassProperties
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to measure.
Return Value
Type: AreaMassProperties
The AreaMassProperties for the given Brep or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When brep is null.
See Also
Reference
AreaMassProperties Class
Compute Overload
Rhino.Geometry Namespace