RhinoCommon SDK
Curve.OffsetOnSurface Method (BrepFace, Double[], Double[], Double)
Rhino for Mac 5.1
 Offset a curve on a brep face surface. This curve must lie on the surface.
This overload allows to specify different offsets for different curve parameters.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] OffsetOnSurface(
	BrepFace face,
	double[] curveParameters,
	double[] offsetDistances,
	double fittingTolerance
)
Public Function OffsetOnSurface (
	face As BrepFace,
	curveParameters As Double(),
	offsetDistances As Double(),
	fittingTolerance As Double
) As Curve()
Parameters
face
Type: Rhino.Geometry.BrepFace
The brep face on which to offset.
curveParameters
Type: System.Double[]
Curve parameters corresponding to the offset distances.
offsetDistances
Type: System.Double[]
distances to offset (+)left, (-)right.
fittingTolerance
Type: System.Double
A fitting tolerance.
Return Value
Type: Curve[]
Offset curves on success, or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | If face, curveParameters or offsetDistances are null.
See Also
Reference
Curve Class
OffsetOnSurface Overload
Rhino.Geometry Namespace