RhinoCommon SDK
Point3d.Item Property
Rhino for Mac 5.1
 Gets or sets an indexed coordinate of this point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Double
	Get
	Set
Parameters
index
Type: System.Int32
 The coordinate index. Valid values are:
0 = X coordinate
1 = Y coordinate
2 = Z coordinate
 .
Property Value
Type: Double
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace