RhinoCommon SDK
Point2d.Item Property
Rhino for Mac 5.1
 Accesses the coordinates of this point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Double
	Get
	Set
Parameters
index
Type: System.Int32
Either 0 or 1.
Return Value
Type: Double
If index is 0, the X (first) coordinate. If index is 1, the Y (second) coordinate.
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace