RhinoCommon SDK
Intersection.ProjectPointsToMeshes Method
Rhino for Mac 5.1
 Projects points onto meshes.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d[] ProjectPointsToMeshes(
	IEnumerable<Mesh> meshes,
	IEnumerable<Point3d> points,
	Vector3d direction,
	double tolerance
)
Public Shared Function ProjectPointsToMeshes (
	meshes As IEnumerable(Of Mesh),
	points As IEnumerable(Of Point3d),
	direction As Vector3d,
	tolerance As Double
) As Point3d()
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
the meshes to project on to.
points
Type: System.Collections.Generic.IEnumerable<Point3d>
the points to project.
direction
Type: Rhino.Geometry.Vector3d
the direction to project.
tolerance
Type: System.Double
 Projection tolerances used for culling close points and for line-mesh intersection.
Return Value
Type: Point3d[]
 Array of projected points, or null in case of any error or invalid input.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace