RhinoCommon SDK
Interop.ToOnMesh Method
Rhino for Mac 5.1
 Constructs a Rhino_DotNet OnMesh that is a copy of a given mesh.
Namespace: Rhino.Runtime
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Object ToOnMesh(
	Mesh source
)
Public Shared Function ToOnMesh (
	source As Mesh
) As Object
Parameters
source
Type: Rhino.Geometry.Mesh
A source brep.
Return Value
Type: Object
 Rhino_DotNet object on success. This will be an independent copy.
See Also
Reference
Interop Class
Rhino.Runtime Namespace