RhinoCommon SDK
NurbsSurface.CreateFromTorus Method
Rhino for Mac 5.1
 Constructs a new NURBS surfaces from torus data.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static NurbsSurface CreateFromTorus(
	Torus torus
)
Public Shared Function CreateFromTorus (
	torus As Torus
) As NurbsSurface
Parameters
torus
Type: Rhino.Geometry.Torus
A torus value.
Return Value
Type: NurbsSurface
A new NURBS surface, or null on error.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace