RhinoCommon SDK
MeshFace Constructor (Int32, Int32, Int32)
Rhino for Mac 5.1
 Constructs a new triangular Mesh face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MeshFace(
	int a,
	int b,
	int c
)
Public Sub New (
	a As Integer,
	b As Integer,
	c As Integer
)
Parameters
a
Type: System.Int32
Index of first corner.
b
Type: System.Int32
Index of second corner.
c
Type: System.Int32
Index of third corner.
See Also
Reference
MeshFace Structure
MeshFace Overload
Rhino.Geometry Namespace