RhinoCommon SDK
BoundingBox.ClosestPoint Method
Rhino for Mac 5.1
Overload List
Name | Description
ClosestPoint(Point3d)
 Finds the closest point on or in the boundingbox.
ClosestPoint(Point3d, Boolean)
 Finds the closest point on or in the boundingbox.
Top
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace