RhinoCommon SDK
RhinoView.Handle Property
Rhino for Mac 5.1
 Gets the window handle that this view is bound to.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IntPtr Handle { get; }
Public ReadOnly Property Handle As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RhinoView Class
Rhino.Display Namespace