RhinoCommon SDK
RhinoObject.Geometry Property
Rhino for Mac 5.1
 Gets the underlying geometry for this object.
All rhino objects are composed of geometry and attributes.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GeometryBase Geometry { get; }
Public ReadOnly Property Geometry As GeometryBase
	Get
Property Value
Type: GeometryBase
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace