RhinoCommon SDK
Brep.JoinBreps Method
Rhino for Mac 5.1
 Joins the breps in the input array at any overlapping edges to form as few as possible resulting breps. There may be more than one brep in the result array.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep[] JoinBreps(
	IEnumerable<Brep> brepsToJoin,
	double tolerance
)
Public Shared Function JoinBreps (
	brepsToJoin As IEnumerable(Of Brep),
	tolerance As Double
) As Brep()
Parameters
brepsToJoin
Type: System.Collections.Generic.IEnumerable<Brep>
A list, an array or any enumerable set of breps to join.
tolerance
Type: System.Double
3d distance tolerance for detecting overlapping edges.
Return Value
Type: Brep[]
new joined breps on success, null on failure.
See Also
Reference
Brep Class
Rhino.Geometry Namespace