RhinoCommon SDK
Surface.TryGetCylinder Method
Rhino for Mac 5.1
Overload List
Name | Description
TryGetCylinder(Cylinder)
Tests a surface to see if it is a portion of a cylinder within RhinoMath.ZeroTolerance and return the cylinder.
TryGetCylinder(Cylinder, Double)
Tests a surface to see if it is a portion of a cylinder and return the cylinder.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace