RhinoCommon SDK
InstanceDefinition.CreatePreviewBitmap Method
Rhino for Mac 5.1
Overload List
Name | Description
CreatePreviewBitmap(DefinedViewportProjection, Size)
CreatePreviewBitmap(DefinedViewportProjection, DisplayMode, Size)
Top
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace