RhinoCommon SDK
PlaneSphereIntersection Enumeration
Rhino for Mac 5.1
 Represents all possible cases of a Plane|Sphere intersection event.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum PlaneSphereIntersection
Public Enumeration PlaneSphereIntersection
Members
Member name | Value | Description
None | 0 |  No intersections.
Point | 1 |  Tangent intersection.
Circle | 2 |  Circular intersection.
See Also
Reference
Rhino.Geometry.Intersect Namespace