RhinoCommon SDK
NamedViewTable.Restore Method (Int32, RhinoView, Boolean)
Rhino for Mac 5.1
 Sets the MainViewport of a standard RhinoView to a named views settings
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Restore(
	int index,
	RhinoView view,
	bool backgroundBitmap
)
Public Function Restore (
	index As Integer,
	view As RhinoView,
	backgroundBitmap As Boolean
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoView,System.Boolean)"]
view
Type: Rhino.Display.RhinoView
[Missing <param name="view"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoView,System.Boolean)"]
backgroundBitmap
Type: System.Boolean
[Missing <param name="backgroundBitmap"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoView,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoView,System.Boolean)"]
See Also
Reference
NamedViewTable Class
Restore Overload
Rhino.DocObjects.Tables Namespace