RhinoCommon SDK
RTreeEventArgs.SearchSphere Property
Rhino for Mac 5.1
 Sphere bounds used during a search. You can modify the sphere in a search callback to help reduce the bounds to search.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Sphere SearchSphere { get; set; }
Public Property SearchSphere As Sphere
	Get
	Set
Property Value
Type: Sphere
See Also
Reference
RTreeEventArgs Class
Rhino.Geometry Namespace