RhinoCommon SDK
Brep.IsValidTopology Method
Rhino for Mac 5.1
 Tests the brep to see if its topology information is valid.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValidTopology(
	out string log
)
Public Function IsValidTopology (
	<OutAttribute> ByRef log As String
) As Boolean
Parameters
log
Type: System.String
 If the brep topology is not valid, then a brief english description of the problem is appended to the log. The information appended to log is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool.
Return Value
Type: Boolean
true if the topology is valid; false otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace