RhinoCommon SDK
RhinoModifyObjectAttributesEventArgs.OldAttributes Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoModifyObjectAttributesEventArgs.OldAttributes"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectAttributes OldAttributes { get; }
Public ReadOnly Property OldAttributes As ObjectAttributes
	Get
Property Value
Type: ObjectAttributes
See Also
Reference
RhinoModifyObjectAttributesEventArgs Class
Rhino.DocObjects Namespace