RhinoCommon SDK
FileWriteOptions.SuppressDialogBoxes Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.SuppressDialogBoxes"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SuppressDialogBoxes { get; set; }
Public Property SuppressDialogBoxes As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace