RhinoCommon SDK
Vector3d.VectorAngle Method
Rhino for Mac 5.1
Overload List
Name | Description
VectorAngle(Vector3d, Vector3d)
 Compute the angle between two vectors.
This operation is commutative.
VectorAngle(Vector3d, Vector3d, Plane)
 Computes the angle on a plane between two vectors.
Top
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace