RhinoCommon SDK
StackedDialogPage.PageImage Property
Rhino for Mac 5.1
 Opitionally override to provide a image to display in the Mac Rhino UI
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual Image PageImage { get; }
Public Overridable ReadOnly Property PageImage As Image
	Get
Property Value
Type: Image
The page image.
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace