RhinoCommon SDK
Brep.CreatePatch Method (IEnumerable<GeometryBase>, Int32, Int32, Double)
Rhino for Mac 5.1
 Constructs a brep patch.
This is the simple version of fit that uses a plane with u x v spans. It makes a plane by fitting to the points from the input geometry to use as the starting surface. The surface has the specified u and v span count.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep CreatePatch(
	IEnumerable<GeometryBase> geometry,
	int uSpans,
	int vSpans,
	double tolerance
)
Public Shared Function CreatePatch (
	geometry As IEnumerable(Of GeometryBase),
	uSpans As Integer,
	vSpans As Integer,
	tolerance As Double
) As Brep
Parameters
geometry
Type: System.Collections.Generic.IEnumerable<GeometryBase>
 A combination of curves, brep trims, points, point clouds or meshes. Curves and trims are sampled to get points. Trims are sampled for points and normals.
uSpans
Type: System.Int32
The number of spans in the U direction.
vSpans
Type: System.Int32
The number of spans in the V direction.
tolerance
Type: System.Double
 Tolerance used by input analysis functions for loop finding, trimming, etc.
Return Value
Type: Brep
 A brep fit through input on success, or null on error.
See Also
Reference
Brep Class
CreatePatch Overload
Rhino.Geometry Namespace