RhinoCommon SDK
RhinoObject.InVisualAnalysisMode Method (VisualAnalysisMode)
Rhino for Mac 5.1
 Reports if a visual analysis mode is currently active for an object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool InVisualAnalysisMode(
	VisualAnalysisMode mode
)
Public Function InVisualAnalysisMode (
	mode As VisualAnalysisMode
) As Boolean
Parameters
mode
Type: Rhino.Display.VisualAnalysisMode
 The mode to check for.
Use null if you want to see if any mode is active.
Return Value
Type: Boolean
true if the specified analysis mode is active; otherwise false.
See Also
Reference
RhinoObject Class
InVisualAnalysisMode Overload
Rhino.DocObjects Namespace