RhinoCommon SDK
CustomCurveObject.Dispose Method
Rhino for Mac 5.1
Overload List
Name | Description
Dispose()
Releases all resources used by the CustomCurveObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomCurveObject and optionally releases the managed resources
Top
See Also
Reference
CustomCurveObject Class
Rhino.DocObjects.Custom Namespace