RhinoCommon SDK
File3dmTypeCodes.TCODE_TABLEREC Field
Rhino for Mac 5.1
0x20000000.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public const uint TCODE_TABLEREC
Public Const TCODE_TABLEREC As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace