RhinoCommon SDK
GetPointMouseEventArgs.Source Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.Source"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GetPoint Source { get; }
Public ReadOnly Property Source As GetPoint
	Get
Property Value
Type: GetPoint
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace