RhinoCommon SDK
PolylineCurve Properties
Rhino for Mac 5.1
The PolylineCurve type exposes the following members.
Properties
Name | Description
PointCount
 Gets the number of points in this polyline.
Top
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace