RhinoCommon SDK
SurfaceCurvature Methods
Rhino for Mac 5.1
The SurfaceCurvature type exposes the following members.
Methods
Name | Description
Direction
 Gets the principal curvature direction vector.
Kappa
 Gets the Kappa curvature value.
OsculatingCircle
 Computes the osculating circle along the given direction.
Top
See Also
Reference
SurfaceCurvature Class
Rhino.Geometry Namespace