RhinoCommon SDK
Panels.PanelDockBar Method (Guid)
Rhino for Mac 5.1
 Will always return Guid.Emty in Mac Rhino. In Windows Rhino it will look for the dock bar which contains the specified panel class Id and return the dock bar Id.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid PanelDockBar(
	Guid panelId
)
Public Shared Function PanelDockBar (
	panelId As Guid
) As Guid
Parameters
panelId
Type: System.Guid
 Panel class Id for of the panel to look for.
Return Value
Type: Guid
 Always returns Guid.Empty on Mac Rhino. On Windows Rhino it will return the Id for the dock bar which host the specified panel or Guid.Empty if the panel is not currently visible.
See Also
Reference
Panels Class
PanelDockBar Overload
Rhino.UI Namespace