RhinoCommon SDK
RhinoPageView.SetActiveDetail Method (String, Boolean)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.RhinoPageView.SetActiveDetail(System.String,System.Boolean)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetActiveDetail(
	string detailName,
	bool compareCase
)
Public Function SetActiveDetail (
	detailName As String,
	compareCase As Boolean
) As Boolean
Parameters
detailName
Type: System.String
[Missing <param name="detailName"/> documentation for "M:Rhino.Display.RhinoPageView.SetActiveDetail(System.String,System.Boolean)"]
compareCase
Type: System.Boolean
[Missing <param name="compareCase"/> documentation for "M:Rhino.Display.RhinoPageView.SetActiveDetail(System.String,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoPageView.SetActiveDetail(System.String,System.Boolean)"]
See Also
Reference
RhinoPageView Class
SetActiveDetail Overload
Rhino.Display Namespace