RhinoCommon SDK
Interval.IncludesParameter Method
Rhino for Mac 5.1
Overload List
Name | Description
IncludesParameter(Double)
 Tests a parameter for Interval inclusion.
IncludesParameter(Double, Boolean)
 Tests a parameter for Interval inclusion.
Top
See Also
Reference
Interval Structure
Rhino.Geometry Namespace