RhinoCommon SDK
PlaneSurface.CreateThroughBox Method (Line, Vector3d, BoundingBox)
Rhino for Mac 5.1
 Makes a plane that includes a line and a vector and goes through a bounding box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static PlaneSurface CreateThroughBox(
	Line lineInPlane,
	Vector3d vectorInPlane,
	BoundingBox box
)
Public Shared Function CreateThroughBox (
	lineInPlane As Line,
	vectorInPlane As Vector3d,
	box As BoundingBox
) As PlaneSurface
Parameters
lineInPlane
Type: Rhino.Geometry.Line
A line that will lie on the plane.
vectorInPlane
Type: Rhino.Geometry.Vector3d
A vector the direction of which will be in plane.
box
Type: Rhino.Geometry.BoundingBox
A box to cut through.
Return Value
Type: PlaneSurface
A new plane surface on success, or null on error.
See Also
Reference
PlaneSurface Class
CreateThroughBox Overload
Rhino.Geometry Namespace