RhinoCommon SDK
ArchivableDictionary.GetVector3d Method (String, Vector3d)
Rhino for Mac 5.1
 Get value as Vector3d, will return defaultValue unless value was created using Set(string key, Vector3d value)
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d GetVector3d(
	string key,
	Vector3d defaultValue
)
Public Function GetVector3d (
	key As String,
	defaultValue As Vector3d
) As Vector3d
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetVector3d(System.String,Rhino.Geometry.Vector3d)"]
defaultValue
Type: Rhino.Geometry.Vector3d
[Missing <param name="defaultValue"/> documentation for "M:Rhino.Collections.ArchivableDictionary.GetVector3d(System.String,Rhino.Geometry.Vector3d)"]
Return Value
Type: Vector3d
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.GetVector3d(System.String,Rhino.Geometry.Vector3d)"]
See Also
Reference
ArchivableDictionary Class
GetVector3d Overload
Rhino.Collections Namespace