RhinoCommon SDK
ArchivableDictionary.Set Method (String, BoundingBox)
Rhino for Mac 5.1
 Sets a BoundingBox.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Set(
	string key,
	BoundingBox val
)
Public Function Set (
	key As String,
	val As BoundingBox
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: Rhino.Geometry.BoundingBox
A value for that key.
Because BoundingBox has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.BoundingBox)"]
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace