RhinoCommon SDK
MeshingParameters.RelativeTolerance Property
Rhino for Mac 5.1
 Gets or sets the relative tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double RelativeTolerance { get; set; }
Public Property RelativeTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace