RhinoCommon SDK
Mesh.SplitDisjointPieces Method
Rhino for Mac 5.1
 Splits up the mesh into its unconnected pieces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Mesh[] SplitDisjointPieces()
Public Function SplitDisjointPieces As Mesh()
Return Value
Type: Mesh[]
An array containing all the disjoint pieces that make up this Mesh.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace