RhinoCommon SDK
Transform.TryGetInverse Method
Rhino for Mac 5.1
 Attempts to get the inverse transform of this transform.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetInverse(
	out Transform inverseTransform
)
Public Function TryGetInverse (
	<OutAttribute> ByRef inverseTransform As Transform
) As Boolean
Parameters
inverseTransform
Type: Rhino.Geometry.Transform
The inverse transform. This out reference will be assigned during this call.
Return Value
Type: Boolean
 true on success. If false is returned and this Transform is Invalid, inserveTransform will be set to this Transform. If false is returned and this Transform is Valid, inverseTransform will be set to a pseudo inverse.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace