RhinoCommon SDK
MeshVertexList.IsHidden Method
Rhino for Mac 5.1
 Gets a value indicating whether or not a vertex is hidden.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsHidden(
	int vertexIndex
)
Public Function IsHidden (
	vertexIndex As Integer
) As Boolean
Parameters
vertexIndex
Type: System.Int32
Index of vertex to query.
Return Value
Type: Boolean
true if the vertex is hidden, false if it is not.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace