RhinoCommon SDK
GetPoint.PermitObjectSnap Method
Rhino for Mac 5.1
 By default, object snaps like "end", "near", etc. are controled by the user. If you want to disable this ability, then call PermitObjectSnap(false).
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PermitObjectSnap(
	bool permit
)
Public Sub PermitObjectSnap (
	permit As Boolean
)
Parameters
permit
Type: System.Boolean
true to permit snapping to objects.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace