RhinoCommon SDK
MostRecentCommandDescription.DisplayString Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Commands.MostRecentCommandDescription.DisplayString"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string DisplayString { get; set; }
Public Property DisplayString As String
	Get
	Set
Property Value
Type: String
See Also
Reference
MostRecentCommandDescription Class
Rhino.Commands Namespace