RhinoCommon SDK
Material.SetEnvironmentTexture Method (String)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.SetEnvironmentTexture(System.String)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetEnvironmentTexture(
	string filename
)
Public Function SetEnvironmentTexture (
	filename As String
) As Boolean
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.DocObjects.Material.SetEnvironmentTexture(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.SetEnvironmentTexture(System.String)"]
See Also
Reference
Material Class
SetEnvironmentTexture Overload
Rhino.DocObjects Namespace