RhinoCommon SDK
ViewEventArgs.View Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.ViewEventArgs.View"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoView View { get; }
Public ReadOnly Property View As RhinoView
	Get
Property Value
Type: RhinoView
See Also
Reference
ViewEventArgs Class
Rhino.Display Namespace