RhinoCommon SDK
PanelIds.ContextHelp Property
Rhino for Mac 5.1
 Rhino context sensitive help panel.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid ContextHelp { get; }
Public Shared ReadOnly Property ContextHelp As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace