RhinoCommon SDK
DisplayModeDescription Properties
Rhino for Mac 5.1
The DisplayModeDescription type exposes the following members.
Properties
Name | Description
AllowObjectAssignment
DisplayAttributes
EnglishName
Id
InMenu
LocalName
PipelineLocked
ShadedPipelineRequired
SupportsShadeCommand
SupportsShading
WireframePipelineRequired
Top
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace