RhinoCommon SDK
Curve.IsPlanar Method (Double)
Rhino for Mac 5.1
Test a curve for planarity.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsPlanar(
	double tolerance
)
Public Function IsPlanar (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
Tolerance to use when checking.
Return Value
Type: Boolean
 true if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.
See Also
Reference
Curve Class
IsPlanar Overload
Rhino.Geometry Namespace