RhinoCommon SDK
ObjectTable.Find Method (Guid)
Rhino for Mac 5.1
 Uses the object guid to find a rhino object. Deleted objects cannot be found by id. The guid is the value that is stored on RhinoObject.Id In a single document, no two active objects have the same guid. If an object is replaced with a new object, then the guid persists. For example, if the _Move command moves an object, then the moved object inherits it's guid from the starting object. If the Copy command copies an object, then the copy gets a new guid. This guid persists through file saving/openning operations. This function will not find grip objects.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject Find(
	Guid objectId
)
Public Function Find (
	objectId As Guid
) As RhinoObject
Parameters
objectId
Type: System.Guid
ID of object to search for.
Return Value
Type: RhinoObject
Reference to the rhino object with the objectId or null if no such object could be found.
See Also
Reference
ObjectTable Class
Find Overload
Rhino.DocObjects.Tables Namespace