RhinoCommon SDK
DisplayPipeline.SupportsShading Property
Rhino for Mac 5.1
 Gets whether or not this pipeline supports shaded meshes.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SupportsShading { get; }
Public ReadOnly Property SupportsShading As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace