RhinoCommon SDK
ColorHSL Constructor
Rhino for Mac 5.1
Overload List
Name | Description
ColorHSL(Color)
 Constructs a new instance of ColorHSL that is equivalent to an RGB color.
ColorHSL(Double, Double, Double)
 Constructs a new instance of ColorHSL with custom channel values.
ColorHSL(Double, Double, Double, Double)
 Constructs a new instance of ColorHSL with custom channel values.
Top
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace