RhinoCommon SDK
Vector3d.IsTiny Method
Rhino for Mac 5.1
Overload List
Name | Description
IsTiny()
 Uses RhinoMath.ZeroTolerance for IsTiny calculation.
IsTiny(Double)
 Determines whether a vector is very short.
Top
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace