RhinoCommon SDK
Cylinder.ToNurbsSurface Method
Rhino for Mac 5.1
 Constructs a Nurbs surface representation of this cylinder. This is synonymous with calling NurbsSurface.CreateFromCylinder().
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsSurface ToNurbsSurface()
Public Function ToNurbsSurface As NurbsSurface
Return Value
Type: NurbsSurface
A Nurbs surface representation of the cylinder or null.
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace