RhinoCommon SDK
BrepRegionFaceSide.Region Property
Rhino for Mac 5.1
 The region this side belongs to.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepRegion Region { get; }
Public ReadOnly Property Region As BrepRegion
	Get
Property Value
Type: BrepRegion
See Also
Reference
BrepRegionFaceSide Class
Rhino.Geometry Namespace