RhinoCommon SDK
TextLog Constructor
Rhino for Mac 5.1
 Creates a text log that stores all text in memory. Use ToString on this version of the TextLog to get the text that we written
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TextLog()
Public Sub New
See Also
Reference
TextLog Class
TextLog Overload
Rhino.FileIO Namespace