RhinoCommon SDK
Dialogs.ShowListBox Method (String, String, IList)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.Dialogs.ShowListBox(System.String,System.String,System.Collections.IList)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Object ShowListBox(
	string title,
	string message,
	IList items
)
Public Shared Function ShowListBox (
	title As String,
	message As String,
	items As IList
) As Object
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.Dialogs.ShowListBox(System.String,System.String,System.Collections.IList)"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.Dialogs.ShowListBox(System.String,System.String,System.Collections.IList)"]
items
Type: System.Collections.IList
[Missing <param name="items"/> documentation for "M:Rhino.UI.Dialogs.ShowListBox(System.String,System.String,System.Collections.IList)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.Dialogs.ShowListBox(System.String,System.String,System.Collections.IList)"]
See Also
Reference
Dialogs Class
ShowListBox Overload
Rhino.UI Namespace