RhinoCommon SDK
Vector2d Structure
Rhino for Mac 5.1
 Represents the two components of a vector in two-dimensional space, using Double-precision floating point numbers.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct Vector2d : ISerializable, IEquatable<Vector2d>,
	IComparable<Vector2d>, IComparable, IEpsilonComparable<Vector2d>
<SerializableAttribute>
Public Structure Vector2d
	Implements ISerializable, IEquatable(Of Vector2d),
	IComparable(Of Vector2d), IComparable, IEpsilonComparable(Of Vector2d)
The Vector2d type exposes the following members.
Constructors
Name | Description
Vector2d
 Initializes a new instance of the vector based on two, X and Y, components.
Top
Properties
Name | Description
IsValid
 Gets a value indicating whether this vector is valid. A valid vector must be formed of valid component values for x, y and z.
Length
 Computes the length (or magnitude, or size) of this vector. This is an application of Pythagoras' theorem.
Unset
 Gets the value of the vector with components set as RhinoMath.UnsetValue,RhinoMath.UnsetValue.
X
 Gets or sets the X (first) component of this vector.
Y
 Gets or sets the Y (second) component of this vector.
Zero
 Gets the value of the vector with components 0,0.
Top
Methods
Name | Description
CompareTo
 Compares this Vector2d with another Vector2d.
Components evaluation priority is first X, then Y.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Vector2d and has the same value as the present vector.
 (Overrides ValueType.Equals(Object).)
Equals(Vector2d)
 Determines whether the specified vector has the same value as the present vector.
GetHashCode
 Provides a hashing value for the present vector.
 (Overrides ValueType.GetHashCode().)
ToString
 Constructs a string representation of the current vector.
 (Overrides ValueType.ToString().)
Unitize
 Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
Top
Operators
Name | Description
Equality
 Determines whether two vectors have equal values.
GreaterThan
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
GreaterThanOrEqual
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
Inequality
 Determines whether two vectors have different values.
LessThan
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
LessThanOrEqual
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
Top
See Also
Reference
Rhino.Geometry Namespace