RhinoCommon SDK
DisplayPipeline.DrawCylinder Method (Cylinder, Color, Int32)
Rhino for Mac 5.1
 Draw a wireframe cylinder.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawCylinder(
	Cylinder cylinder,
	Color color,
	int thickness
)
Public Sub DrawCylinder (
	cylinder As Cylinder,
	color As Color,
	thickness As Integer
)
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
Cylinder to draw.
color
Type: System.Drawing.Color
Color to draw with.
thickness
Type: System.Int32
Thickness (in pixels) of cylinder wires.
See Also
Reference
DisplayPipeline Class
DrawCylinder Overload
Rhino.Display Namespace