RhinoCommon SDK
MeshFace.IsTriangle Property
Rhino for Mac 5.1
 Gets a value indicating whether or not this mesh face is a triangle. A mesh face is considered to be a triangle when C equals D, thus it is possible for an Invalid mesh face to also be a triangle.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsTriangle { get; }
Public ReadOnly Property IsTriangle As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace