RhinoCommon SDK
GetPoint.ClearConstructionPoints Method
Rhino for Mac 5.1
 Remove all construction points.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void ClearConstructionPoints()
Public Sub ClearConstructionPoints
Remarks
 Construction points are like snap points except that they get snapped to even when point osnap is off. Typically, there are only a few construction points while there can be many snap points. For example, when polylines are drawn the start point is a construction point and the other points are snap points.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace