RhinoCommon SDK
GetColorEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.GetColorEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.UI.GetColorEventArgs
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class GetColorEventArgs : EventArgs
Public Class GetColorEventArgs
	Inherits EventArgs
The GetColorEventArgs type exposes the following members.
Properties
Name | Description
IncludeButtonColors
InputColor
SelectedColor
Title
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace