RhinoCommon SDK
ObjectTable.AddPolyline Method
Rhino for Mac 5.1
Overload List
Name | Description
AddPolyline(IEnumerable<Point3d>)
Adds a polyline object to Rhino.
AddPolyline(IEnumerable<Point3d>, ObjectAttributes)
Adds a polyline object to Rhino.
AddPolyline(IEnumerable<Point3d>, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace