RhinoCommon SDK
Polyline.SegmentAt Method
Rhino for Mac 5.1
 Gets the line segment at the given index.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Line SegmentAt(
	int index
)
Public Function SegmentAt (
	index As Integer
) As Line
Parameters
index
Type: System.Int32
Index of segment to retrieve.
Return Value
Type: Line
Line segment at index or Line.Unset on failure.
See Also
Reference
Polyline Class
Rhino.Geometry Namespace