RhinoCommon SDK
DisplayPipeline.DrawDottedLine Method (Point3d, Point3d, Color)
Rhino for Mac 5.1
 Draws a single dotted line.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawDottedLine(
	Point3d from,
	Point3d to,
	Color color
)
Public Sub DrawDottedLine (
	from As Point3d,
	to As Point3d,
	color As Color
)
Parameters
from
Type: Rhino.Geometry.Point3d
Line start point.
to
Type: Rhino.Geometry.Point3d
Line end point.
color
Type: System.Drawing.Color
Color of line.
See Also
Reference
DisplayPipeline Class
DrawDottedLine Overload
Rhino.Display Namespace