RhinoCommon SDK
RhinoViewport.Camera35mmLensLength Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.Camera35mmLensLength"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Camera35mmLensLength { get; set; }
Public Property Camera35mmLensLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace