RhinoCommon SDK
BrepEdge.TrimCount Property
Rhino for Mac 5.1
 Gets the number of trim-curves that use this edge.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int TrimCount { get; }
Public ReadOnly Property TrimCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace