RhinoCommon SDK
Sphere.PointAt Method
Rhino for Mac 5.1
Evaluates the sphere at specific longitude and latitude angles.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAt(
	double longitudeRadians,
	double latitudeRadians
)
Public Function PointAt (
	longitudeRadians As Double,
	latitudeRadians As Double
) As Point3d
Parameters
longitudeRadians
Type: System.Double
A number within the interval [0, 2pi].
latitudeRadians
Type: System.Double
A number within the interval [-pi/2,pi/2].
Return Value
Type: Point3d
A point value.
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace