RhinoCommon SDK
Polyline Constructor
Rhino for Mac 5.1
Overload List
Name | Description
Polyline()
 Initializes a new empty polyline.
Polyline(Int32)
 Initializes a new empty polyline with an initial capacity.
Polyline(IEnumerable<Point3d>)
 Initializes a new polyline from a collection of points.
Top
See Also
Reference
Polyline Class
Rhino.Geometry Namespace