RhinoCommon SDK
DigitizerPlugIn.SendPoint Method
Rhino for Mac 5.1
 If the digitizer is enabled, call this function to send a point to Rhino. Call this function as much as you like. The digitizers that Rhino currently supports send a point every 15 milliseconds or so. This function should be called when users press or release any digitizer button.
Namespace: Rhino.PlugIns
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SendPoint(
	Point3d point,
	MouseButton mousebuttons,
	bool shiftKey,
	bool controlKey
)
Public Sub SendPoint (
	point As Point3d,
	mousebuttons As MouseButton,
	shiftKey As Boolean,
	controlKey As Boolean
)
Parameters
point
Type: Rhino.Geometry.Point3d
3d point in digitizer coordinates.
mousebuttons
Type: Rhino.UI.MouseButton
corresponding digitizer button is down.
shiftKey
Type: System.Boolean
true if the Shift keyboard key was pressed. Otherwise, false.
controlKey
Type: System.Boolean
true if the Control keyboard key was pressed. Otherwise, false.
See Also
Reference
DigitizerPlugIn Class
Rhino.PlugIns Namespace