RhinoCommon SDK
Plane.Normal Property
Rhino for Mac 5.1
 Gets the normal of this plane. This is essentially the ZAxis of the plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d Normal { get; }
Public ReadOnly Property Normal As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Plane Structure
Rhino.Geometry Namespace