RhinoCommon SDK
Curve.ToNurbsCurve Method
Rhino for Mac 5.1
Overload List
Name | Description
ToNurbsCurve()
 Constructs a NURBS curve representation of this curve.
ToNurbsCurve(Interval)
 Constructs a NURBS curve representation of this curve.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace