RhinoCommon SDK
ToolbarFileCollection.MruSidebarIsVisible Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.ToolbarFileCollection.MruSidebarIsVisible"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool MruSidebarIsVisible { get; set; }
Public Shared Property MruSidebarIsVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace