RhinoCommon SDK
SweepTwoRail.ClosedSweep Property
Rhino for Mac 5.1
 If the input rails are closed, ClosedSweep determines if the swept breps will also be closed.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ClosedSweep { get; set; }
Public Property ClosedSweep As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace