RhinoCommon SDK
Vector3d.IsParallelTo Method (Vector3d, Double)
Rhino for Mac 5.1
 Determines whether this vector is parallel to another vector, within a provided tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int IsParallelTo(
	Vector3d other,
	double angleTolerance
)
Public Function IsParallelTo (
	other As Vector3d,
	angleTolerance As Double
) As Integer
Parameters
other
Type: Rhino.Geometry.Vector3d
Vector to use for comparison.
angleTolerance
Type: System.Double
Angle tolerance (in radians).
Return Value
Type: Int32
 Parallel indicator:
+1 = both vectors are parallel.
0 = vectors are not parallel or at least one of the vectors is zero.
-1 = vectors are anti-parallel.
See Also
Reference
Vector3d Structure
IsParallelTo Overload
Rhino.Geometry Namespace