RhinoCommon SDK
Color4f.Empty Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.Color4f.Empty"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Color4f Empty { get; }
Public Shared ReadOnly Property Empty As Color4f
	Get
Property Value
Type: Color4f
See Also
Reference
Color4f Structure
Rhino.Display Namespace