RhinoCommon SDK
RhinoGet.GetRectangle Method
Rhino for Mac 5.1
Overload List
Name | Description
GetRectangle(Point3d[])
 Gets a 3d rectangle.
GetRectangle(GetBoxMode, Point3d, IEnumerable<String>, Point3d[])
 Gets a 3d rectangle made up of four points.
Top
See Also
Reference
RhinoGet Class
Rhino.Input Namespace