RhinoCommon SDK
TwistSpaceMorph.InfiniteTwist Property
Rhino for Mac 5.1
 If true, the deformation is constant throughout the object, even if the axis is shorter than the object. If false, the deformation takes place only the length of the axis.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool InfiniteTwist { get; set; }
Public Property InfiniteTwist As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TwistSpaceMorph Class
Rhino.Geometry.Morphs Namespace