RhinoCommon SDK
GroupTable.AddToGroup Method (Int32, IEnumerable<Guid>)
Rhino for Mac 5.1
 Adds a list of objects to an existing group.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool AddToGroup(
	int groupIndex,
	IEnumerable<Guid> objectIds
)
Public Function AddToGroup (
	groupIndex As Integer,
	objectIds As IEnumerable(Of Guid)
) As Boolean
Parameters
groupIndex
Type: System.Int32
The group index value.
objectIds
Type: System.Collections.Generic.IEnumerable<Guid>
An array, a list or any enumerable set of IDs to objects.
Return Value
Type: Boolean
true if at least an operation was successful.
See Also
Reference
GroupTable Class
AddToGroup Overload
Rhino.DocObjects.Tables Namespace