RhinoCommon SDK
Light.SpotExponent Property
Rhino for Mac 5.1
 The spot exponent varies from 0.0 to 128.0 and provides an exponential interface for controling the focus or concentration of a spotlight (like the OpenGL GL_SPOT_EXPONENT parameter). The spot exponent and hot spot parameters are linked; changing one will change the other. A hot spot setting of 0.0 corresponds to a spot exponent of 128. A hot spot setting of 1.0 corresponds to a spot exponent of 0.0.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double SpotExponent { get; set; }
Public Property SpotExponent As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Light Class
Rhino.Geometry Namespace