RhinoCommon SDK
BlendContinuity Enumeration
Rhino for Mac 5.1
 Used in curve and surface blending functions
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum BlendContinuity
Public Enumeration BlendContinuity
Members
Member name | Value | Description
Position | 0
Tangency | 1
Curvature | 2
See Also
Reference
Rhino.Geometry Namespace