RhinoCommon SDK
BrepVertexList.Add Method (Point3d, Double)
Rhino for Mac 5.1
 Create and add a new vertex to this list
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepVertex Add(
	Point3d point,
	double vertexTolerance
)
Public Function Add (
	point As Point3d,
	vertexTolerance As Double
) As BrepVertex
Parameters
point
Type: Rhino.Geometry.Point3d
[Missing <param name="point"/> documentation for "M:Rhino.Geometry.Collections.BrepVertexList.Add(Rhino.Geometry.Point3d,System.Double)"]
vertexTolerance
Type: System.Double
Use RhinoMath.UnsetTolerance if you are unsure
Return Value
Type: BrepVertex
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.BrepVertexList.Add(Rhino.Geometry.Point3d,System.Double)"]
See Also
Reference
BrepVertexList Class
Add Overload
Rhino.Geometry.Collections Namespace