RhinoCommon SDK
TextLog.IndentSize Property
Rhino for Mac 5.1
 0: one tab per indent. >0: number of spaces per indent
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int IndentSize { get; set; }
Public Property IndentSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
TextLog Class
Rhino.FileIO Namespace