RhinoCommon SDK
GetTransform.ObjectList Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetTransform.ObjectList"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TransformObjectList ObjectList { get; }
Public ReadOnly Property ObjectList As TransformObjectList
	Get
Property Value
Type: TransformObjectList
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace