RhinoCommon SDK
Arc.Unset Property
Rhino for Mac 5.1
 Gets an Arc with Unset components.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Arc Unset { get; }
Public Shared ReadOnly Property Unset As Arc
	Get
Property Value
Type: Arc
See Also
Reference
Arc Structure
Rhino.Geometry Namespace