RhinoCommon SDK
ViewportInfo.GetPointDepth Method
Rhino for Mac 5.1
 Gets the clipping distance of a point. This function ignores the current value of the viewport's near and far settings. If the viewport is a perspective projection, then it intersects the semi infinite frustum volume with the bounding box and returns the near and far distances of the intersection. If the viewport is a parallel projection, it instersects the infinte view region with the bounding box and returns the near and far distances of the projection.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetPointDepth(
	Point3d point,
	out double distance
)
Public Function GetPointDepth (
	point As Point3d,
	<OutAttribute> ByRef distance As Double
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
A point to measure.
distance
Type: System.Double
distance of the point (can be < 0)
Return Value
Type: Boolean
true if the bounding box intersects the view frustum and near_dist/far_dist were set. false if the bounding box does not intesect the view frustum.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace