RhinoCommon SDK
Interpolator Constructor
Rhino for Mac 5.1
 Constructs a new, empty Interpolator.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interpolator()
Public Sub New
See Also
Reference
Interpolator Class
Interpolator Overload
Rhino.Geometry Namespace