RhinoCommon SDK
GumballDisplayConduit.SetBaseGumball Method
Rhino for Mac 5.1
Overload List
Name | Description
SetBaseGumball(GumballObject)
 Contents of the gumball are copied to the base gumball of this class.
SetBaseGumball(GumballObject, GumballAppearanceSettings)
 Contents of the gumball are copied to the base gumball of this class.
Top
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace