RhinoCommon SDK
ReplayHistoryData.TryGetBool Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetBool(System.Int32,System.Boolean@)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetBool(
	int id,
	out bool value
)
Public Function TryGetBool (
	id As Integer,
	<OutAttribute> ByRef value As Boolean
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetBool(System.Int32,System.Boolean@)"]
value
Type: System.Boolean
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetBool(System.Int32,System.Boolean@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetBool(System.Int32,System.Boolean@)"]
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace