RhinoCommon SDK
FileReadOptions Methods
Rhino for Mac 5.1
The FileReadOptions type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
FileReadOptions Class
Rhino.FileIO Namespace