RhinoCommon SDK
Panels.OnShowPanel Method
Rhino for Mac 5.1
 Call this method to raise the Show event
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void OnShowPanel(
	Guid panelId,
	bool show
)
Public Shared Sub OnShowPanel (
	panelId As Guid,
	show As Boolean
)
Parameters
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.Panels.OnShowPanel(System.Guid,System.Boolean)"]
show
Type: System.Boolean
[Missing <param name="show"/> documentation for "M:Rhino.UI.Panels.OnShowPanel(System.Guid,System.Boolean)"]
See Also
Reference
Panels Class
Rhino.UI Namespace