RhinoCommon SDK
StringTable.Delete Method (String, String)
Rhino for Mac 5.1
 Removes user data strings from the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Delete(
	string section,
	string entry
)
Public Sub Delete (
	section As String,
	entry As String
)
Parameters
section
Type: System.String
name of section to delete. If null, all sections will be deleted.
entry
Type: System.String
name of entry to delete. If null, all entries will be deleted for a given section.
See Also
Reference
StringTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace