RhinoCommon SDK
Interpolator Methods
Rhino for Mac 5.1
The Interpolator type exposes the following members.
Methods
Name | Description
InterpolateCatmullRom
 Sample the list of numbers with Catmull-Rom interpolation.
InterpolateCosine
 Sample the list of numbers with cosine interpolation.
InterpolateCubic
 Sample the list of numbers with cubic interpolation.
InterpolateLinear
 Sample the list of numbers with linear interpolation.
InterpolateNearestNeighbour
 Sample the list of numbers with Nearest Neighbour interpolation.
Top
See Also
Reference
Interpolator Class
Rhino.Geometry Namespace