RhinoCommon SDK
MaterialTable.Modify Method
Rhino for Mac 5.1
Modify material settings.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Modify(
	Material newSettings,
	int materialIndex,
	bool quiet
)
Public Function Modify (
	newSettings As Material,
	materialIndex As Integer,
	quiet As Boolean
) As Boolean
Parameters
newSettings
Type: Rhino.DocObjects.Material
This information is copied.
materialIndex
Type: System.Int32
 zero based index of material to set. This must be in the range 0 <= layerIndex < MaterialTable.Count.
quiet
Type: System.Boolean
if true, information message boxes pop up when illegal changes are attempted.
Return Value
Type: Boolean
 true if successful. false if materialIndex is out of range or the settings attempt to lock or hide the current material.
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace