RhinoCommon SDK
ObjectPropertiesPage.InitializeControls Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.ObjectPropertiesPage.InitializeControls(Rhino.DocObjects.RhinoObject)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual void InitializeControls(
	RhinoObject rhObj
)
Public Overridable Sub InitializeControls (
	rhObj As RhinoObject
)
Parameters
rhObj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhObj"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.InitializeControls(Rhino.DocObjects.RhinoObject)"]
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace