RhinoCommon SDK
EdgeAdjacency Enumeration
Rhino for Mac 5.1
 Enumerates all possible Topological Edge adjacency types.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum EdgeAdjacency
Public Enumeration EdgeAdjacency
Members
Member name | Value | Description
None | 0 |  Edge is not used by any faces and is therefore superfluous.
Naked | 1 |  Edge is used by a single face.
Interior | 2 |  Edge is used by two adjacent faces.
NonManifold | 3 |  Edge is used by three or more adjacent faces.
See Also
Reference
Rhino.Geometry Namespace