RhinoCommon SDK
RadialDimension.IsDiameterDimension Property
Rhino for Mac 5.1
 Gets a value indicating whether the value refers to the diameter, rather than the radius.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsDiameterDimension { get; }
Public ReadOnly Property IsDiameterDimension As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace