RhinoCommon SDK
ViewTable.Add Method
Rhino for Mac 5.1
 Constructs a new Rhino view and, at the same time, adds it to the list.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoView Add(
	string title,
	DefinedViewportProjection projection,
	Rectangle position,
	bool floating
)
Public Function Add (
	title As String,
	projection As DefinedViewportProjection,
	position As Rectangle,
	floating As Boolean
) As RhinoView
Parameters
title
Type: System.String
The title of the new Rhino view.
projection
Type: Rhino.Display.DefinedViewportProjection
A basic projection type.
position
Type: System.Drawing.Rectangle
A position.
floating
Type: System.Boolean
true if the view floats; false if it is docked.
Return Value
Type: RhinoView
The newly constructed Rhino view; or null on error.
See Also
Reference
ViewTable Class
Rhino.DocObjects.Tables Namespace