RhinoCommon SDK
LocalizeStringPair Properties
Rhino for Mac 5.1
The LocalizeStringPair type exposes the following members.
Properties
Name | Description
English
Local
Top
See Also
Reference
LocalizeStringPair Class
Rhino.UI Namespace