RhinoCommon SDK
ObjectTable.FindByLayer Method (Layer)
Rhino for Mac 5.1
 Finds all RhinoObjects that are in a given layer.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject[] FindByLayer(
	Layer layer
)
Public Function FindByLayer (
	layer As Layer
) As RhinoObject()
Parameters
layer
Type: Rhino.DocObjects.Layer
Layer to search.
Return Value
Type: RhinoObject[]
 Array of objects that belong to the specified group or null if no objects could be found.
See Also
Reference
ObjectTable Class
FindByLayer Overload
Rhino.DocObjects.Tables Namespace