RhinoCommon SDK
StackedDialogPage.OnDefaults Method
Rhino for Mac 5.1
Called when stacked dialog Defaults button is pressed (see ShowDefaultsButton).
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual void OnDefaults()
Public Overridable Sub OnDefaults
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace