RhinoCommon SDK
HistoryRecord.SetInt Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInt(System.Int32,System.Int32)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetInt(
	int id,
	int value
)
Public Function SetInt (
	id As Integer,
	value As Integer
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInt(System.Int32,System.Int32)"]
value
Type: System.Int32
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInt(System.Int32,System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetInt(System.Int32,System.Int32)"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace