RhinoCommon SDK
RhinoObject.MeshObjects Method (IEnumerable<RhinoObject>, MeshingParameters, Boolean, Mesh[], ObjectAttributes[])
Rhino for Mac 5.1
Mesh Rhino Objects
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result MeshObjects(
	IEnumerable<RhinoObject> rhinoObjects,
	ref MeshingParameters parameters,
	ref bool simpleDialog,
	out Mesh[] meshes,
	out ObjectAttributes[] attributes
)
Public Shared Function MeshObjects (
	rhinoObjects As IEnumerable(Of RhinoObject),
	ByRef parameters As MeshingParameters,
	ByRef simpleDialog As Boolean,
	<OutAttribute> ByRef meshes As Mesh(),
	<OutAttribute> ByRef attributes As ObjectAttributes()
) As Result
Parameters
rhinoObjects
Type: System.Collections.Generic.IEnumerable<RhinoObject>
Objects to mesh
parameters
Type: Rhino.Geometry.MeshingParameters
The parameters used to create the meshes
simpleDialog
Type: System.Boolean
[Missing <param name="simpleDialog"/> documentation for "M:Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters@,System.Boolean@,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)"]
meshes
Type: Rhino.Geometry.Mesh[]
[Missing <param name="meshes"/> documentation for "M:Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters@,System.Boolean@,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes[]
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters@,System.Boolean@,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters@,System.Boolean@,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)"]
See Also
Reference
RhinoObject Class
MeshObjects Overload
Rhino.DocObjects Namespace