RhinoCommon SDK
Box Constructor (BoundingBox)
Rhino for Mac 5.1
 Initializes a new Box that mimics a BoundingBox struct.
The orientation plane of the Box is coincident with the World XY plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Box(
	BoundingBox bbox
)
Public Sub New (
	bbox As BoundingBox
)
Parameters
bbox
Type: Rhino.Geometry.BoundingBox
BoundingBox to mimic.
See Also
Reference
Box Structure
Box Overload
Rhino.Geometry Namespace