RhinoCommon SDK
NurbsCurve Class
Rhino for Mac 5.1
 Represents a Non Uniform Rational B-Splines (NURBS) curve.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Curve
 Rhino.Geometry.NurbsCurve
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class NurbsCurve : Curve, IEpsilonComparable<NurbsCurve>
<SerializableAttribute>
Public Class NurbsCurve
	Inherits Curve
	Implements IEpsilonComparable(Of NurbsCurve)
The NurbsCurve type exposes the following members.
Constructors
Name | Description
NurbsCurve(NurbsCurve)
 Initializes a NURBS curve by copying its values from another NURBS curve.
NurbsCurve(Int32, Int32)
 Constructs a new Nurbscurve with a specific degree and control-point count.
NurbsCurve(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
NurbsCurve(Int32, Boolean, Int32, Int32)
 Constructs a new NurbsCurve with knot and CV memory allocated.
Top
Properties
Name | Description
HasBezierSpans
 Returns true if the NURBS curve has bezier spans (all distinct knots have multiplitity = degree)
IsRational
 Gets a value indicating whether or not the curve is rational. Rational curves have control-points with custom weights.
Knots
 Gets access to the knots (or "knot vector") of this nurbs curve.
Order
 Gets the order of the curve. Order = Degree + 1.
Points
 Gets access to the control points of this nurbs curve.
Top
Methods
Name | Description
Create
 Constructs a 3D NURBS curve from a list of control points.
CreateFromArc
 Gets a rational degree 2 NURBS curve representation of the arc. Note that the parameterization of NURBS curve does not match arc's transcendental paramaterization.
CreateFromCircle
 Gets a rational degree 2 NURBS curve representation of the circle. Note that the parameterization of NURBS curve does not match circle's transcendental paramaterization. Use GetRadianFromNurbFormParameter() and GetParameterFromRadian() to convert between the NURBS curve parameter and the transcendental parameter.
CreateFromEllipse
 Gets a rational degree 2 NURBS curve representation of the ellipse.
Note that the parameterization of the NURBS curve does not match with the transcendental paramaterization of the ellipsis.
CreateFromLine
 Gets a non-rational, degree 1 Nurbs curve representation of the line.
CreateSpiral(Point3d, Vector3d, Point3d, Double, Double, Double, Double)
 Creates a C1 cubic NURBS approximation of a helix or spiral. For a helix, you may have radius0 == radius1. For a spiral radius0 == radius0 produces a circle. Zero and negative radii are permissible.
CreateSpiral(Curve, Double, Double, Point3d, Double, Double, Double, Double, Int32)
 Create a C2 non-rational uniform cubic NURBS approximation of a swept helix or spiral.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
GrevilleParameter
 Gets the greville (edit point) parameter that belongs to the control point at the specified index.
GrevilleParameters
 Gets all Greville (Edit point) parameters for this curve.
GrevillePoint
 Gets the greville (edit point) parameter that belongs to the control point at the specified index.
GrevillePoints
 Gets all Greville (Edit) points for this curve.
IncreaseDegree
 Increase the degree of this curve.
IsDuplicate
 Determines if two curves are similar.
MakePiecewiseBezier
 Clamps ends and adds knots so the NURBS curve has bezier spans (all distinct knots have multiplitity = degree).
Reparameterize
 Use a linear fractional transformation to reparameterize the NURBS curve. This does not change the curve's domain.
Simplify
 Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
 1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
 2. The Nurbs Curves segments do not have fully multiple interior knots.
 3. Rational Nurbs curves do not have constant weights.
 4. Any segment for which IsLinear() or IsArc() is true is a Line, Polyline segment, or an Arc.
 5. Adjacent Colinear or Cocircular segments are combined.
Top
See Also
Reference
Rhino.Geometry Namespace