RhinoCommon SDK
UndoRedoEventArgs.IsBeginUndo Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsBeginUndo"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsBeginUndo { get; }
Public ReadOnly Property IsBeginUndo As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace