RhinoCommon SDK
RhinoObject.IsSubObjectHighlighted Method
Rhino for Mac 5.1
 Determines if a subobject is highlighted.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSubObjectHighlighted(
	ComponentIndex componentIndex
)
Public Function IsSubObjectHighlighted (
	componentIndex As ComponentIndex
) As Boolean
Parameters
componentIndex
Type: Rhino.Geometry.ComponentIndex
A subobject component index.
Return Value
Type: Boolean
true if the subobject is highlighted.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace