RhinoCommon SDK
DepthMode Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.DepthMode"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum DepthMode
Public Enumeration DepthMode
Members
Member name | Value | Description
Neutral | 0
AlwaysInFront | 1
AlwaysInBack | 2
See Also
Reference
Rhino.Display Namespace