RhinoCommon SDK
Plane.GetPlaneEquation Method
Rhino for Mac 5.1
 Gets the plane equation for this plane in the format of Ax+By+Cz+D=0.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double[] GetPlaneEquation()
Public Function GetPlaneEquation As Double()
Return Value
Type: Double[]
 Array of four values.
See Also
Reference
Plane Structure
Rhino.Geometry Namespace