RhinoCommon SDK
AnnotationBase.Index Property
Rhino for Mac 5.1
 Index of DimensionStyle in document DimStyle table used by the dimension.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Index { get; set; }
Public Property Index As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace