RhinoCommon SDK
Unroller.AddFollowingGeometry Method (IEnumerable<TextDot>)
Rhino for Mac 5.1
 Adds text dots that should be unrolled along with the surface/brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddFollowingGeometry(
	IEnumerable<TextDot> dots
)
Public Sub AddFollowingGeometry (
	dots As IEnumerable(Of TextDot)
)
Parameters
dots
Type: System.Collections.Generic.IEnumerable<TextDot>
An array, a list or any enumerable set of text dots.
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace