RhinoCommon SDK
Point4d.Multiply Operator (Point4d, Point4d)
Rhino for Mac 5.1
 Multiplies two Point4d together, returning the dot (internal) product of the two. This is not the cross product.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static double operator *(
	Point4d point1,
	Point4d point2
)
Public Shared Operator * (
	point1 As Point4d,
	point2 As Point4d
) As Double
Parameters
point1
Type: Rhino.Geometry.Point4d
The first point.
point2
Type: Rhino.Geometry.Point4d
The second point.
Return Value
Type: Double
A value that results from the coordinatewise multiplication of point1 and point2.
See Also
Reference
Point4d Structure
Multiply Overload
Rhino.Geometry Namespace