RhinoCommon SDK
PointCloud.GetColors Method
Rhino for Mac 5.1
 Copy all the point colors in this point cloud to an array.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color[] GetColors()
Public Function GetColors As Color()
Return Value
Type: Color[]
An array containing all the colors in this point cloud.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace