RhinoCommon SDK
BrepFace.TrimAwareIsoIntervals Method
Rhino for Mac 5.1
 Gets intervals where the iso curve exists on a BrepFace (trimmed surface)
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interval[] TrimAwareIsoIntervals(
	int direction,
	double constantParameter
)
Public Function TrimAwareIsoIntervals (
	direction As Integer,
	constantParameter As Double
) As Interval()
Parameters
direction
Type: System.Int32
Direction of isocurve.
0 = Isocurve connects all points with a constant U value.
1 = Isocurve connects all points with a constant V value.
constantParameter
Type: System.Double
Surface parameter that remains identical along the isocurves.
Return Value
Type: Interval[]
 If direction = 0, the parameter space iso interval connects the 2d points (intervals[i][0],iso_constant) and (intervals[i][1],iso_constant). If direction = 1, the parameter space iso interval connects the 2d points (iso_constant,intervals[i][0]) and (iso_constant,intervals[i][1]).
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace