RhinoCommon SDK
Intersection.PlanePlanePlane Method
Rhino for Mac 5.1
 Intersects three planes to find the single point they all share.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool PlanePlanePlane(
	Plane planeA,
	Plane planeB,
	Plane planeC,
	out Point3d intersectionPoint
)
Public Shared Function PlanePlanePlane (
	planeA As Plane,
	planeB As Plane,
	planeC As Plane,
	<OutAttribute> ByRef intersectionPoint As Point3d
) As Boolean
Parameters
planeA
Type: Rhino.Geometry.Plane
First plane for intersection.
planeB
Type: Rhino.Geometry.Plane
Second plane for intersection.
planeC
Type: Rhino.Geometry.Plane
Third plane for intersection.
intersectionPoint
Type: Rhino.Geometry.Point3d
Point where all three planes converge.
Return Value
Type: Boolean
true on success, false on failure. If at least two out of the three planes are parallel or coincident, failure is assumed.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace