RhinoCommon SDK
Light.Specular Property
Rhino for Mac 5.1
 Gets or sets the specular color.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color Specular { get; set; }
Public Property Specular As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Light Class
Rhino.Geometry Namespace