RhinoCommon SDK
Rectangle3d.CreateFromPolyline Method
Rhino for Mac 5.1
Overload List
Name | Description
CreateFromPolyline(IEnumerable<Point3d>)
 Attempts to create a rectangle from a polyline. In order for the polyline to qualify as a rectangle, it must have 4 or 5 corner points (i.e. it need not be closed).
CreateFromPolyline(IEnumerable<Point3d>, Double, Double)
 Attempts to create a Rectangle from a Polyline. In order for a polyline to qualify as a rectangle, it must have 4 or 5 corner points (i.e. it need not be closed).
This overload also returns deviations.
Top
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace