RhinoCommon SDK
File3dm.ApplicationName Property
Rhino for Mac 5.1
 Gets or sets the name of the application that wrote this file.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string ApplicationName { get; set; }
Public Property ApplicationName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dm Class
Rhino.FileIO Namespace