RhinoCommon SDK
ObjectPropertiesPage.SelectedObjects Property
Rhino for Mac 5.1
 Return a list of Rhino objects to be processed by this object properties page
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject[] SelectedObjects { get; }
Public ReadOnly Property SelectedObjects As RhinoObject()
	Get
Property Value
Type: RhinoObject[]
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace