RhinoCommon SDK
ObjectTable.FindByLayer Method
Rhino for Mac 5.1
Overload List
Name | Description
FindByLayer(String)
 Finds all RhinoObjects that are in a given layer.
FindByLayer(Layer)
 Finds all RhinoObjects that are in a given layer.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace