RhinoCommon SDK
MeshTopologyVertexList.IndicesFromFace Method
Rhino for Mac 5.1
 Returns TopologyVertexIndices for a given mesh face index.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] IndicesFromFace(
	int faceIndex
)
Public Function IndicesFromFace (
	faceIndex As Integer
) As Integer()
Parameters
faceIndex
Type: System.Int32
The index of a face to query.
Return Value
Type: Int32[]
An array of vertex indices.
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace