RhinoCommon SDK
NurbsCurve.Points Property
Rhino for Mac 5.1
 Gets access to the control points of this nurbs curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsCurvePointList Points { get; }
Public ReadOnly Property Points As NurbsCurvePointList
	Get
Property Value
Type: NurbsCurvePointList
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace