RhinoCommon SDK
Point2f.Equals Method (Point2f)
Rhino for Mac 5.1
 Determines whether the specified Point2f has the same values as the present point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Equals(
	Point2f point
)
Public Function Equals (
	point As Point2f
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point2f
The specified point.
Return Value
Type: Boolean
true if point has the same coordinates as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Point2f Structure
Equals Overload
Rhino.Geometry Namespace