RhinoCommon SDK
FileWriteOptions Methods
Rhino for Mac 5.1
The FileWriteOptions type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace