RhinoCommon SDK
ColorLAB.Alpha Property
Rhino for Mac 5.1
 Gets or sets the Alpha channel. The channel is limited to 0~1.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Alpha { get; set; }
Public Property Alpha As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace