RhinoCommon SDK
BezierCurve.TangentAt Method
Rhino for Mac 5.1
Evaluates the unit tangent vector at a curve parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d TangentAt(
	double t
)
Public Function TangentAt (
	t As Double
) As Vector3d
Parameters
t
Type: System.Double
Evaluation parameter.
Return Value
Type: Vector3d
Unit tangent vector of the curve at the parameter t.
Remarks
No error handling.
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace