RhinoCommon SDK
Curve.TryGetEllipse Method (Ellipse)
Rhino for Mac 5.1
 Try to convert this curve into an Ellipse within RhinoMath.ZeroTolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetEllipse(
	out Ellipse ellipse
)
Public Function TryGetEllipse (
	<OutAttribute> ByRef ellipse As Ellipse
) As Boolean
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
On success, the Ellipse will be filled in.
Return Value
Type: Boolean
true if the curve could be converted into an Ellipse.
See Also
Reference
Curve Class
TryGetEllipse Overload
Rhino.Geometry Namespace