RhinoCommon SDK
Circle.DerivativeAt Method
Rhino for Mac 5.1
 Determines the value of the Nth derivative at a parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d DerivativeAt(
	int derivative,
	double t
)
Public Function DerivativeAt (
	derivative As Integer,
	t As Double
) As Vector3d
Parameters
derivative
Type: System.Int32
Which order of derivative is wanted.
t
Type: System.Double
Parameter to evaluate derivative. Valid values are 0, 1, 2 and 3.
Return Value
Type: Vector3d
The derivative of the circle at the given parameter.
See Also
Reference
Circle Structure
Rhino.Geometry Namespace