RhinoCommon SDK
Point3f.Equals Method (Point3f)
Rhino for Mac 5.1
 Determines whether the specified Point3f has the same values as the present point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Equals(
	Point3f point
)
Public Function Equals (
	point As Point3f
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3f
The specified point.
Return Value
Type: Boolean
true if point has the same coordinates as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Point3f Structure
Equals Overload
Rhino.Geometry Namespace