RhinoCommon SDK
DrawEventArgs.RhinoDoc Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DrawEventArgs.RhinoDoc"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoDoc RhinoDoc { get; }
Public ReadOnly Property RhinoDoc As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
DrawEventArgs Class
Rhino.Display Namespace