RhinoCommon SDK
InstanceDefinition.SkipNestedLinkedDefinitions Property
Rhino for Mac 5.1
 Controls how much geometry is read when a linked InstanceDefinition is updated.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SkipNestedLinkedDefinitions { get; }
Public ReadOnly Property SkipNestedLinkedDefinitions As Boolean
	Get
Return Value
Type: Boolean
If this returns true then nested linked InstanceDefinition objects will be skipped otherwise; read everything, included nested linked InstanceDefinition objects
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace