RhinoCommon SDK
Quaternion.Multiply Operator (Quaternion, Quaternion)
Rhino for Mac 5.1
 Multiplies a quaternion with another one.
Quaternion multiplication (Hamilton product) is not commutative.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Quaternion operator *(
	Quaternion a,
	Quaternion b
)
Public Shared Operator * (
	a As Quaternion,
	b As Quaternion
) As Quaternion
Parameters
a
Type: Rhino.Geometry.Quaternion
The first term.
b
Type: Rhino.Geometry.Quaternion
The second term.
Return Value
Type: Quaternion
A new quaternion.
See Also
Reference
Quaternion Structure
Multiply Overload
Rhino.Geometry Namespace