RhinoCommon SDK
Command.BeginCommand Event
Rhino for Mac 5.1
 Called just before command.RunCommand().
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<CommandEventArgs> BeginCommand
Public Shared Event BeginCommand As EventHandler(Of CommandEventArgs)
Value
Type: System.EventHandler<CommandEventArgs>
See Also
Reference
Command Class
Rhino.Commands Namespace