RhinoCommon SDK
DimStyleTable.GetEnumerator Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.GetEnumerator"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<DimensionStyle> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of DimensionStyle)
Return Value
Type: IEnumerator<DimensionStyle>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.DimStyleTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
DimStyleTable Class
Rhino.DocObjects.Tables Namespace