RhinoCommon SDK
GetLine.SetFirstPoint Method
Rhino for Mac 5.1
 Use SetFirstPoint to specify the line's starting point and skip the start point interactive picking
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetFirstPoint(
	Point3d point
)
Public Sub SetFirstPoint (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
[Missing <param name="point"/> documentation for "M:Rhino.Input.Custom.GetLine.SetFirstPoint(Rhino.Geometry.Point3d)"]
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace