RhinoCommon SDK
BrepRegion.Brep Property
Rhino for Mac 5.1
Gets a reference to the Brep this region belongs to.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace