RhinoCommon SDK
RhinoObject.OnSpaceMorph Method
Rhino for Mac 5.1
 Called when a space morph has been applied to the geometry. Currently this only works for CustomMeshObject instances
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnSpaceMorph(
	SpaceMorph morph
)
Protected Overridable Sub OnSpaceMorph (
	morph As SpaceMorph
)
Parameters
morph
Type: Rhino.Geometry.SpaceMorph
[Missing <param name="morph"/> documentation for "M:Rhino.DocObjects.RhinoObject.OnSpaceMorph(Rhino.Geometry.SpaceMorph)"]
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace