RhinoCommon SDK
GetPoint.FullFrameRedrawDuringGet Property
Rhino for Mac 5.1
 In the "RARE" case that you need to draw some depth buffered geometry during a Get() operation, setting this value to true will force entire frames to be redrawn while the user moves the mouse. This allows DisplayPipeline events to be triggered as well as OnPostDrawObjects NOTE!! Setting this value to true comes with a significant performance penalty because the scene needs to be fully regenerated every frame where the standard DynamicDraw event draws temporary decorations (geometry) on top of a static scene.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool FullFrameRedrawDuringGet { get; set; }
Public Property FullFrameRedrawDuringGet As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace