RhinoCommon SDK
Quaternion.Addition Operator
Rhino for Mac 5.1
 Adds two quaternions.
This sums each quaternion coefficient with its correspondant and returns a new result quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Quaternion operator +(
	Quaternion a,
	Quaternion b
)
Public Shared Operator + (
	a As Quaternion,
	b As Quaternion
) As Quaternion
Parameters
a
Type: Rhino.Geometry.Quaternion
A quaternion.
b
Type: Rhino.Geometry.Quaternion
Another quaternion.
Return Value
Type: Quaternion
A new quaternion.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace