RhinoCommon SDK
Matrix.IsColumnOrthogonal Property
Rhino for Mac 5.1
 Gets a value indicating whether the matrix is column orthogonal.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsColumnOrthogonal { get; }
Public ReadOnly Property IsColumnOrthogonal As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Matrix Class
Rhino.Geometry Namespace