RhinoCommon SDK
GumballObject.SetFromBoundingBox Method (BoundingBox)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromBoundingBox(Rhino.Geometry.BoundingBox)"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFromBoundingBox(
	BoundingBox boundingBox
)
Public Function SetFromBoundingBox (
	boundingBox As BoundingBox
) As Boolean
Parameters
boundingBox
Type: Rhino.Geometry.BoundingBox
[Missing <param name="boundingBox"/> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromBoundingBox(Rhino.Geometry.BoundingBox)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromBoundingBox(Rhino.Geometry.BoundingBox)"]
See Also
Reference
GumballObject Class
SetFromBoundingBox Overload
Rhino.UI.Gumball Namespace