RhinoCommon SDK
BrepFace.DuplicateSurface Method
Rhino for Mac 5.1
 Gets a copy to the untrimmed surface that this face is based on.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface DuplicateSurface()
Public Function DuplicateSurface As Surface
Return Value
Type: Surface
A copy of this face's underlying surface.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace