RhinoCommon SDK
ColorXYZ.X Property
Rhino for Mac 5.1
 Gets or set the X channel value. Channel will be limited to 0~1.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace