RhinoCommon SDK
Mesh.VertexColors Property
Rhino for Mac 5.1
 Gets access to the (optional) vertex color collection in this mesh.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MeshVertexColorList VertexColors { get; }
Public ReadOnly Property VertexColors As MeshVertexColorList
	Get
Property Value
Type: MeshVertexColorList
See Also
Reference
Mesh Class
Rhino.Geometry Namespace