RhinoCommon SDK
HistoryRecord.Handle Property
Rhino for Mac 5.1
 Wrapped native C++ pointer to CRhinoHistory instance
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IntPtr Handle { get; }
Public ReadOnly Property Handle As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace