RhinoCommon SDK
ObjectTable.FindByDrawColor Method
Rhino for Mac 5.1
 Finds all objects whose draw color matches a given color.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject[] FindByDrawColor(
	Color drawColor,
	bool includeLights
)
Public Function FindByDrawColor (
	drawColor As Color,
	includeLights As Boolean
) As RhinoObject()
Parameters
drawColor
Type: System.Drawing.Color
The alpha value of this color is ignored.
includeLights
Type: System.Boolean
true if lights should be included.
Return Value
Type: RhinoObject[]
An array of Rhino document objects. This array can be empty.
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace