RhinoCommon SDK
ColorLCH.A Property
Rhino for Mac 5.1
 Gets or sets the Alpha channel. The Alpha channel is limited to the 0~1 range.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double A { get; set; }
Public Property A As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace