RhinoCommon SDK
GetString Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Input.Custom.GetString"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetBaseClass
 Rhino.Input.Custom.GetString
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class GetString : GetBaseClass
Public Class GetString
	Inherits GetBaseClass
The GetString type exposes the following members.
Constructors
Name | Description
GetString
 Constructs a new GetString.
Top
Methods
Name | Description
Get
Returns the string that the user typed. By default, space stops the string input.
GetLiteralString
Returns the string that the user typed. By default, space does not stop input.
Top
See Also
Reference
Rhino.Input.Custom Namespace