RhinoCommon SDK
Surface.TryGetSphere Method (Sphere, Double)
Rhino for Mac 5.1
Test a surface to see if it is a portion of a sphere and return the sphere.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetSphere(
	out Sphere sphere,
	double tolerance
)
Public Function TryGetSphere (
	<OutAttribute> ByRef sphere As Sphere,
	tolerance As Double
) As Boolean
Parameters
sphere
Type: Rhino.Geometry.Sphere
On success, the sphere parameters are filled in.
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the surface is a portion of a sphere.
See Also
Reference
Surface Class
TryGetSphere Overload
Rhino.Geometry Namespace