RhinoCommon SDK
BinaryArchiveReader.ReadSize Method
Rhino for Mac 5.1
 Reads a Size from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Size ReadSize()
Public Function ReadSize As Size
Return Value
Type: Size
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace