RhinoCommon SDK
ArchivableDictionary Constructor (UserData)
Rhino for Mac 5.1
Initializes an instance of a dictionary for writing to a 3dm archive
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ArchivableDictionary(
	UserData parentUserData
)
Public Sub New (
	parentUserData As UserData
)
Parameters
parentUserData
Type: Rhino.DocObjects.Custom.UserData
 parent user data if this dictionary is associated with user data
See Also
Reference
ArchivableDictionary Class
ArchivableDictionary Overload
Rhino.Collections Namespace