RhinoCommon SDK
Unroller.AddFollowingGeometry Method (Point3d, String)
Rhino for Mac 5.1
 Adds a text dot that should be unrolled along with the surface/brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddFollowingGeometry(
	Point3d dotLocation,
	string dotText
)
Public Sub AddFollowingGeometry (
	dotLocation As Point3d,
	dotText As String
)
Parameters
dotLocation
Type: Rhino.Geometry.Point3d
A dot point.
dotText
Type: System.String
A dot text.
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace