RhinoCommon SDK
VisualAnalysisMode.RhinoEdgeAnalysisModeId Property
Rhino for Mac 5.1
 Id for Rhino's built-in edge analysis mode. Brep and mesh edges are shown in a selected color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid RhinoEdgeAnalysisModeId { get; }
Public Shared ReadOnly Property RhinoEdgeAnalysisModeId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace