RhinoCommon SDK
BrepVertexList.Add Method
Rhino for Mac 5.1
 Create and add a new vertex to this list
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepVertex Add()
Public Function Add As BrepVertex
Return Value
Type: BrepVertex
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.BrepVertexList.Add"]
See Also
Reference
BrepVertexList Class
Add Overload
Rhino.Geometry.Collections Namespace