RhinoCommon SDK
CustomDisplay.AddCurve Method (Curve, Color, Int32)
Rhino for Mac 5.1
 Adds a new, colored curve to the display list. The curve will be duplicated so changes to the original will not affect the display.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddCurve(
	Curve curve,
	Color color,
	int thickness
)
Public Sub AddCurve (
	curve As Curve,
	color As Color,
	thickness As Integer
)
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to add.
color
Type: System.Drawing.Color
Color of curve.
thickness
Type: System.Int32
Thickness of curve.
See Also
Reference
CustomDisplay Class
AddCurve Overload
Rhino.Display Namespace