RhinoCommon SDK
Text3d Class
Rhino for Mac 5.1
 3D aligned text with font settings.
Inheritance Hierarchy
System.Object
 Rhino.Display.Text3d
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class Text3d : IDisposable
Public Class Text3d
	Implements IDisposable
The Text3d type exposes the following members.
Constructors
Name | Description
Text3d(String)
 Constructs a new instance of Text3d.
Text3d(String, Plane, Double)
 Constructs a new instance of Text3d.
Top
Properties
Name | Description
Bold
 Gets or sets whether this Text3d object will be drawn in Bold.
BoundingBox
 Gets the boundingbox for this Text3d object.
FontFace
 Gets or sets the FontFace name.
Height
 Gets or sets the height (in units) of this Text3d object. The height should be a positive number larger than zero.
Italic
 Gets or sets whether this Text3d object will be drawn in Italics.
Text
 Gets or sets the text string for this Text3d object.
TextPlane
 Gets or sets the 3D aligned plane for this Text3d object.
Top
Methods
Name | Description
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Display Namespace