RhinoCommon SDK
Plane Constructor (Plane)
Rhino for Mac 5.1
Copy constructor.
This is nothing special and performs the same as assigning to another variable.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Plane(
	Plane other
)
Public Sub New (
	other As Plane
)
Parameters
other
Type: Rhino.Geometry.Plane
The source plane value.
See Also
Reference
Plane Structure
Plane Overload
Rhino.Geometry Namespace