RhinoCommon SDK
SporphSpaceMorph Constructor (Surface, Surface)
Rhino for Mac 5.1
 Constructs a sporph space morph.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public SporphSpaceMorph(
	Surface surface0,
	Surface surface1
)
Public Sub New (
	surface0 As Surface,
	surface1 As Surface
)
Parameters
surface0
Type: Rhino.Geometry.Surface
Base surface.
surface1
Type: Rhino.Geometry.Surface
Target surface.
See Also
Reference
SporphSpaceMorph Class
SporphSpaceMorph Overload
Rhino.Geometry.Morphs Namespace