RhinoCommon SDK
GetLineMode Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Input.Custom.GetLineMode"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum GetLineMode
Public Enumeration GetLineMode
Members
Member name | Value | Description
TwoPoint | 0
SurfaceNormal | 1
Angled | 2
Vertical | 3
FourPoint | 4
Bisector | 5
Perpendicular | 6
Tangent | 7
CurveEnd | 8
CPlaneNormalVector | 9
See Also
Reference
Rhino.Input.Custom Namespace