RhinoCommon SDK
BrepFace.OuterLoop Property
Rhino for Mac 5.1
 Every face has a single outer loop.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepLoop OuterLoop { get; }
Public ReadOnly Property OuterLoop As BrepLoop
	Get
Property Value
Type: BrepLoop
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace