RhinoCommon SDK
Brep.CreatePlanarBreps Method (Curve)
Rhino for Mac 5.1
 Constructs a set of planar breps as outlines by the loops.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep[] CreatePlanarBreps(
	Curve inputLoop
)
Public Shared Function CreatePlanarBreps (
	inputLoop As Curve
) As Brep()
Parameters
inputLoop
Type: Rhino.Geometry.Curve
A curve that should form the boundaries of the surfaces or polysurfaces.
Return Value
Type: Brep[]
An array of Planar Breps.
See Also
Reference
Brep Class
CreatePlanarBreps Overload
Rhino.Geometry Namespace