RhinoCommon SDK
Brep.CreatePlanarBreps Method (IEnumerable<Curve>)
Rhino for Mac 5.1
 Constructs a set of planar breps as outlines by the loops.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep[] CreatePlanarBreps(
	IEnumerable<Curve> inputLoops
)
Public Shared Function CreatePlanarBreps (
	inputLoops As IEnumerable(Of Curve)
) As Brep()
Parameters
inputLoops
Type: System.Collections.Generic.IEnumerable<Curve>
Curve loops that delineate the planar boundaries.
Return Value
Type: Brep[]
An array of Planar Breps.
See Also
Reference
Brep Class
CreatePlanarBreps Overload
Rhino.Geometry Namespace