RhinoCommon SDK
BrepTrim.Loop Property
Rhino for Mac 5.1
 Loop that this trim belongs to
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepLoop Loop { get; }
Public ReadOnly Property Loop As BrepLoop
	Get
Property Value
Type: BrepLoop
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace