RhinoCommon SDK
Interval.Equals Method (Interval)
Rhino for Mac 5.1
 Determines whether the specified Interval is equal to the current Interval, comparing by value.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Equals(
	Interval other
)
Public Function Equals (
	other As Interval
) As Boolean
Parameters
other
Type: Rhino.Geometry.Interval
The other interval to compare with.
Return Value
Type: Boolean
true if obj is an Interval and has the same bounds; false otherwise.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Interval Structure
Equals Overload
Rhino.Geometry Namespace