RhinoCommon SDK
ControlPoint Methods
Rhino for Mac 5.1
The ControlPoint type exposes the following members.
Methods
Name | Description
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
Top
See Also
Reference
ControlPoint Structure
Rhino.Geometry Namespace