RhinoCommon SDK
Ellipse Constructor (Plane, Double, Double)
Rhino for Mac 5.1
 Initializes a new ellipse from base plane and both principal radii.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Ellipse(
	Plane plane,
	double radius1,
	double radius2
)
Public Sub New (
	plane As Plane,
	radius1 As Double,
	radius2 As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
Base plane of ellipse.
radius1
Type: System.Double
Ellipse radius along base plane X direction.
radius2
Type: System.Double
Ellipse radius along base plane Y direction.
See Also
Reference
Ellipse Structure
Ellipse Overload
Rhino.Geometry Namespace