RhinoCommon SDK
File3dm.DimStyles Property
Rhino for Mac 5.1
 Dimension Styles in this file
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IList<DimensionStyle> DimStyles { get; }
Public ReadOnly Property DimStyles As IList(Of DimensionStyle)
	Get
Property Value
Type: IList<DimensionStyle>
See Also
Reference
File3dm Class
Rhino.FileIO Namespace