RhinoCommon SDK
Transform.Translation Method (Double, Double, Double)
Rhino for Mac 5.1
 Constructs a new translation (move) tranformation. Right column is (dx, dy, dz, 1.0).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform Translation(
	double dx,
	double dy,
	double dz
)
Public Shared Function Translation (
	dx As Double,
	dy As Double,
	dz As Double
) As Transform
Parameters
dx
Type: System.Double
Distance to translate (move) geometry along the world X axis.
dy
Type: System.Double
Distance to translate (move) geometry along the world Y axis.
dz
Type: System.Double
Distance to translate (move) geometry along the world Z axis.
Return Value
Type: Transform
A transform matrix which moves geometry with the specified distances.
Examples
using Rhino.Input;
partial class Examples
{
  public static Rhino.Commands.Result TransformBrep(Rhino.RhinoDoc doc)
  {
    Rhino.DocObjects.ObjRef rhobj;
    var rc = RhinoGet.GetOneObject("Select brep", true, Rhino.DocObjects.ObjectType.Brep, out rhobj);
    if(rc!= Rhino.Commands.Result.Success)
      return rc;
    // Simple translation transformation
    var xform = Rhino.Geometry.Transform.Translation(18,-18,25);
    doc.Objects.Transform(rhobj, xform, true);
    doc.Views.Redraw();
    return Rhino.Commands.Result.Success;
  }
}
Imports Rhino.Input
Partial Class Examples
  Public Shared Function TransformBrep(doc As Rhino.RhinoDoc) As Rhino.Commands.Result
    Dim rhobj As Rhino.DocObjects.ObjRef = Nothing
    Dim rc = RhinoGet.GetOneObject("Select brep", True, Rhino.DocObjects.ObjectType.Brep, rhobj)
    If rc <> Rhino.Commands.Result.Success Then
      Return rc
    End If
    ' Simple translation transformation
    Dim xform = Rhino.Geometry.Transform.Translation(18, -18, 25)
    doc.Objects.Transform(rhobj, xform, True)
    doc.Views.Redraw()
    Return Rhino.Commands.Result.Success
  End Function
End Class
import Rhino
import scriptcontext
def TransformBrep():
    rc, objref = Rhino.Input.RhinoGet.GetOneObject("Select brep", True, Rhino.DocObjects.ObjectType.Brep)
    if rc!=Rhino.Commands.Result.Success: return
    # Simple translation transformation
    xform = Rhino.Geometry.Transform.Translation(18,-18,25)
    scriptcontext.doc.Objects.Transform(objref, xform, True)
    scriptcontext.doc.Views.Redraw()
if __name__=="__main__":
    TransformBrep()
See Also
Reference
Transform Structure
Translation Overload
Rhino.Geometry Namespace