RhinoCommon SDK
ConstructionPlane.ShowGrid Property
Rhino for Mac 5.1
 Gets or sets whether the grid itself should be visible.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ShowGrid { get; set; }
Public Property ShowGrid As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace