RhinoCommon SDK
Transform.Unset Property
Rhino for Mac 5.1
 Gets an XForm filled with RhinoMath.UnsetValue.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Transform Unset { get; }
Public Shared ReadOnly Property Unset As Transform
	Get
Property Value
Type: Transform
See Also
Reference
Transform Structure
Rhino.Geometry Namespace