RhinoCommon SDK
InstanceDefinitionTable.Delete Method
Rhino for Mac 5.1
 Deletes the instance definition.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Delete(
	int idefIndex,
	bool deleteReferences,
	bool quiet
)
Public Function Delete (
	idefIndex As Integer,
	deleteReferences As Boolean,
	quiet As Boolean
) As Boolean
Parameters
idefIndex
Type: System.Int32
 zero based index of instance definition to delete. This must be in the range 0 <= idefIndex < InstanceDefinitionTable.Count.
deleteReferences
Type: System.Boolean
 true to delete all references to this definition. false to delete definition only if there are no references.
quiet
Type: System.Boolean
 If true, no warning message box appears if an instance definition cannot be deleted because it is the current layer or it contains active geometry.
Return Value
Type: Boolean
 true if successful. false if the instance definition has active references and bDeleteReferences is false.
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace