RhinoCommon SDK
Vector2d.Equals Method (Vector2d)
Rhino for Mac 5.1
 Determines whether the specified vector has the same value as the present vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Equals(
	Vector2d vector
)
Public Function Equals (
	vector As Vector2d
) As Boolean
Parameters
vector
Type: Rhino.Geometry.Vector2d
The specified vector.
Return Value
Type: Boolean
true if vector has the same components as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Vector2d Structure
Equals Overload
Rhino.Geometry Namespace