RhinoCommon SDK
Vector2f.Equals Method (Vector2f)
Rhino for Mac 5.1
 Determines whether the specified vector has the same values as the present vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Equals(
	Vector2f vector
)
Public Function Equals (
	vector As Vector2f
) As Boolean
Parameters
vector
Type: Rhino.Geometry.Vector2f
The specified vector.
Return Value
Type: Boolean
true if obj is Vector2f and has the same coordinates as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Vector2f Structure
Equals Overload
Rhino.Geometry Namespace