RhinoCommon SDK
HatchPattern.Index Property
Rhino for Mac 5.1
 Index in the hatch pattern table for this pattern. -1 if not in the table.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace