RhinoCommon SDK
DimensionStyle.LengthFormat Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LengthFormat"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DistanceDisplayMode LengthFormat { get; set; }
Public Property LengthFormat As DistanceDisplayMode
	Get
	Set
Property Value
Type: DistanceDisplayMode
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace