RhinoCommon SDK
ClassArrayOnObjRef Class
Rhino for Mac 5.1
 Represents a wrapper to an unmanaged "array" (list) of ON_ObjRef instances.
Wrapper for a C++ ON_ClassArray of ON_ObjRef
Inheritance Hierarchy
System.Object
 Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef
Namespace: Rhino.Runtime.InteropWrappers
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class ClassArrayOnObjRef : IDisposable
Public NotInheritable Class ClassArrayOnObjRef
	Implements IDisposable
The ClassArrayOnObjRef type exposes the following members.
Constructors
Name | Description
ClassArrayOnObjRef()
 Initializes a new ClassArrayOnObjRef instance.
ClassArrayOnObjRef(IEnumerable<ObjRef>)
 Initializes a new instances from a set of ObjRefs
Top
Properties
Name | Description
Count
 Gets the number of ObjRef instances in this array.
Top
Methods
Name | Description
Add
 Adds an ObjRef to the list.
ConstPointer
 Gets the const (immutable) pointer of this array.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
NonConstPointer
 Gets the non-const pointer (for modification) of this array.
ToNonConstArray
 Copies the unmanaged array to a managed counterpart.
Top
See Also
Reference
Rhino.Runtime.InteropWrappers Namespace