RhinoCommon SDK
Mesh.TextureCoordinates Property
Rhino for Mac 5.1
 Gets access to the vertex texture coordinate collection in this mesh.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MeshTextureCoordinateList TextureCoordinates { get; }
Public ReadOnly Property TextureCoordinates As MeshTextureCoordinateList
	Get
Property Value
Type: MeshTextureCoordinateList
See Also
Reference
Mesh Class
Rhino.Geometry Namespace