RhinoCommon SDK
IPanelsService.RegisterPanel Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.RegisterPanel(Rhino.PlugIns.PlugIn,System.Type,System.String,System.Drawing.Icon)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
void RegisterPanel(
	PlugIn plugIn,
	Type panelType,
	string caption,
	Icon icon
)
Sub RegisterPanel (
	plugIn As PlugIn,
	panelType As Type,
	caption As String,
	icon As Icon
)
Parameters
plugIn
Type: Rhino.PlugIns.PlugIn
[Missing <param name="plugIn"/> documentation for "M:Rhino.UI.IPanelsService.RegisterPanel(Rhino.PlugIns.PlugIn,System.Type,System.String,System.Drawing.Icon)"]
panelType
Type: System.Type
[Missing <param name="panelType"/> documentation for "M:Rhino.UI.IPanelsService.RegisterPanel(Rhino.PlugIns.PlugIn,System.Type,System.String,System.Drawing.Icon)"]
caption
Type: System.String
[Missing <param name="caption"/> documentation for "M:Rhino.UI.IPanelsService.RegisterPanel(Rhino.PlugIns.PlugIn,System.Type,System.String,System.Drawing.Icon)"]
icon
Type: System.Drawing.Icon
[Missing <param name="icon"/> documentation for "M:Rhino.UI.IPanelsService.RegisterPanel(Rhino.PlugIns.PlugIn,System.Type,System.String,System.Drawing.Icon)"]
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace