RhinoCommon SDK
RhinoViewport.SetToPlanView Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.SetToPlanView(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetToPlanView(
	Point3d planeOrigin,
	Vector3d planeXaxis,
	Vector3d planeYaxis,
	bool setConstructionPlane
)
Public Function SetToPlanView (
	planeOrigin As Point3d,
	planeXaxis As Vector3d,
	planeYaxis As Vector3d,
	setConstructionPlane As Boolean
) As Boolean
Parameters
planeOrigin
Type: Rhino.Geometry.Point3d
[Missing <param name="planeOrigin"/> documentation for "M:Rhino.Display.RhinoViewport.SetToPlanView(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)"]
planeXaxis
Type: Rhino.Geometry.Vector3d
[Missing <param name="planeXaxis"/> documentation for "M:Rhino.Display.RhinoViewport.SetToPlanView(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)"]
planeYaxis
Type: Rhino.Geometry.Vector3d
[Missing <param name="planeYaxis"/> documentation for "M:Rhino.Display.RhinoViewport.SetToPlanView(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)"]
setConstructionPlane
Type: System.Boolean
[Missing <param name="setConstructionPlane"/> documentation for "M:Rhino.Display.RhinoViewport.SetToPlanView(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.SetToPlanView(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)"]
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace