RhinoCommon SDK
Command.Settings Property
Rhino for Mac 5.1
 Gets the settings of the command.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PersistentSettings Settings { get; }
Public ReadOnly Property Settings As PersistentSettings
	Get
Property Value
Type: PersistentSettings
See Also
Reference
Command Class
Rhino.Commands Namespace