RhinoCommon SDK
MorphControl.Morph Method
Rhino for Mac 5.1
Applies the space morph to geometry.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Morph(
	GeometryBase geometry
)
Public Function Morph (
	geometry As GeometryBase
) As Boolean
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
The geometry to be morphed.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MorphControl Class
Rhino.Geometry Namespace