RhinoCommon SDK
MeshVertexColorList.GetEnumerator Method
Rhino for Mac 5.1
 Gets an enumerator that yields all colors in this collection.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<Color> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Color)
Return Value
Type: IEnumerator<Color>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MeshVertexColorList Class
Rhino.Geometry.Collections Namespace