RhinoCommon SDK
NurbsCurveKnotList.KnotMultiplicity Method
Rhino for Mac 5.1
Get knot multiplicity.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int KnotMultiplicity(
	int index
)
Public Function KnotMultiplicity (
	index As Integer
) As Integer
Parameters
index
Type: System.Int32
Index of knot to query.
Return Value
Type: Int32
The multiplicity (valence) of the knot.
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace