RhinoCommon SDK
File3dmObject.Geometry Property
Rhino for Mac 5.1
 Gets the geometry that is linked with this document object.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GeometryBase Geometry { get; }
Public ReadOnly Property Geometry As GeometryBase
	Get
Property Value
Type: GeometryBase
See Also
Reference
File3dmObject Class
Rhino.FileIO Namespace