RhinoCommon SDK
RhinoObject.GetHighlightedSubObjects Method
Rhino for Mac 5.1
 Gets a list of all highlighted subobjects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ComponentIndex[] GetHighlightedSubObjects()
Public Function GetHighlightedSubObjects As ComponentIndex()
Return Value
Type: ComponentIndex[]
An array of all highlighted subobjects; or null is there are none.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace