RhinoCommon SDK
Texture.SetAlphaBlendValues Method
Rhino for Mac 5.1
 If the TextureCombineMode is Blend, then the blending function for alpha is determined by
 new alpha = constant + a0*(current alpha) + a1*(texture alpha) + a2*min(current alpha,texture alpha) + a3*max(current alpha,texture alpha)
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetAlphaBlendValues(
	double constant,
	double a0,
	double a1,
	double a2,
	double a3
)
Public Sub SetAlphaBlendValues (
	constant As Double,
	a0 As Double,
	a1 As Double,
	a2 As Double,
	a3 As Double
)
Parameters
constant
Type: System.Double
[Missing <param name="constant"/> documentation for "M:Rhino.DocObjects.Texture.SetAlphaBlendValues(System.Double,System.Double,System.Double,System.Double,System.Double)"]
a0
Type: System.Double
[Missing <param name="a0"/> documentation for "M:Rhino.DocObjects.Texture.SetAlphaBlendValues(System.Double,System.Double,System.Double,System.Double,System.Double)"]
a1
Type: System.Double
[Missing <param name="a1"/> documentation for "M:Rhino.DocObjects.Texture.SetAlphaBlendValues(System.Double,System.Double,System.Double,System.Double,System.Double)"]
a2
Type: System.Double
[Missing <param name="a2"/> documentation for "M:Rhino.DocObjects.Texture.SetAlphaBlendValues(System.Double,System.Double,System.Double,System.Double,System.Double)"]
a3
Type: System.Double
[Missing <param name="a3"/> documentation for "M:Rhino.DocObjects.Texture.SetAlphaBlendValues(System.Double,System.Double,System.Double,System.Double,System.Double)"]
See Also
Reference
Texture Class
Rhino.DocObjects Namespace