RhinoCommon SDK
Vector3d.MinimumCoordinate Property
Rhino for Mac 5.1
 Gets the smallest (both positive and negative) component value in this vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double MinimumCoordinate { get; }
Public ReadOnly Property MinimumCoordinate As Double
	Get
Property Value
Type: Double
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace