RhinoCommon SDK
BrepFace.DuplicateFace Method
Rhino for Mac 5.1
 Duplicate a face from the brep to create new single face brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep DuplicateFace(
	bool duplicateMeshes
)
Public Function DuplicateFace (
	duplicateMeshes As Boolean
) As Brep
Parameters
duplicateMeshes
Type: System.Boolean
If true, shading meshes will be copied as well.
Return Value
Type: Brep
A new single-face brep synonymous with the current Face.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace