RhinoCommon SDK
Particle Constructor
Rhino for Mac 5.1
 Initializes a new instance of the Particle class.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Particle()
Public Sub New
See Also
Reference
Particle Class
Rhino.Geometry Namespace