RhinoCommon SDK
Intersection.CurveSurface Method (Curve, Interval, Surface, Double, Double)
Rhino for Mac 5.1
 Intersects a (sub)curve and a surface.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static CurveIntersections CurveSurface(
	Curve curve,
	Interval curveDomain,
	Surface surface,
	double tolerance,
	double overlapTolerance
)
Public Shared Function CurveSurface (
	curve As Curve,
	curveDomain As Interval,
	surface As Surface,
	tolerance As Double,
	overlapTolerance As Double
) As CurveIntersections
Parameters
curve
Type: Rhino.Geometry.Curve
Curve for intersection.
curveDomain
Type: Rhino.Geometry.Interval
Domain of surbcurve to take into consideration for Intersections.
surface
Type: Rhino.Geometry.Surface
Surface for intersection.
tolerance
Type: System.Double
Intersection tolerance. If the curve approaches the surface to within tolerance, an intersection is assumed.
overlapTolerance
Type: System.Double
The tolerance with which the curves are tested.
Return Value
Type: CurveIntersections
A collection of intersection events.
See Also
Reference
Intersection Class
CurveSurface Overload
Rhino.Geometry.Intersect Namespace