RhinoCommon SDK
DefinedViewportProjection Enumeration
Rhino for Mac 5.1
 Defines enumerated values for parallel and perspective projections that are "standard" in Rhino.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum DefinedViewportProjection
Public Enumeration DefinedViewportProjection
Members
Member name | Value | Description
None | 0
Top | 1
Bottom | 2
Left | 3
Right | 4
Front | 5
Back | 6
Perspective | 7
TwoPointPerspective | 8
See Also
Reference
Rhino.Display Namespace