RhinoCommon SDK
CurveIntersections Class
Rhino for Mac 5.1
 Maintains an ordered list of Curve Intersection results.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Intersect.CurveIntersections
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class CurveIntersections : IDisposable,
	IList<IntersectionEvent>, ICollection<IntersectionEvent>, IEnumerable<IntersectionEvent>,
	IEnumerable
Public Class CurveIntersections
	Implements IDisposable, IList(Of IntersectionEvent),
	ICollection(Of IntersectionEvent), IEnumerable(Of IntersectionEvent), IEnumerable
The CurveIntersections type exposes the following members.
Properties
Name | Description
Count
 Gets the number of recorded intersection events.
Item
 Gets the intersection event data at the given index.
Top
Methods
Name | Description
CopyTo
 Copies all intersection results into another array, departing at an index in the target array.
Dispose()
 Actively reclaims unmanaged resources that this instance uses.
Dispose(Boolean)
 For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
Finalize
 Destructor.
 (Overrides Object.Finalize().)
GetEnumerator
 Returns an enumerator that is capable of yielding all IntersectionEvents in the collection.
Top
See Also
Reference
Rhino.Geometry.Intersect Namespace