RhinoCommon SDK
MeshFace.Item Property
Rhino for Mac 5.1
 Gets or sets the vertex index associated with an entry in this face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int this[
	int index
] { get; set; }
Public Default Property Item (
	index As Integer
) As Integer
	Get
	Set
Parameters
index
Type: System.Int32
A number in interval [0-3] that refers to an index of a vertex in this face.
Return Value
Type: Int32
The vertex index associated with this mesh face.
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace