RhinoCommon SDK
TransformObjectList.Add Method (ObjRef)
Rhino for Mac 5.1
 Add an ObjRef to this list. Use this to add Polyedges so the references are properly counted
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Add(
	ObjRef objref
)
Public Sub Add (
	objref As ObjRef
)
Parameters
objref
Type: Rhino.DocObjects.ObjRef
[Missing <param name="objref"/> documentation for "M:Rhino.Collections.TransformObjectList.Add(Rhino.DocObjects.ObjRef)"]
See Also
Reference
TransformObjectList Class
Add Overload
Rhino.Collections Namespace