RhinoCommon SDK
Curve.ProjectToMesh Method (Curve, Mesh, Vector3d, Double)
Rhino for Mac 5.1
 Projects a curve to a mesh using a direction and tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] ProjectToMesh(
	Curve curve,
	Mesh mesh,
	Vector3d direction,
	double tolerance
)
Public Shared Function ProjectToMesh (
	curve As Curve,
	mesh As Mesh,
	direction As Vector3d,
	tolerance As Double
) As Curve()
Parameters
curve
Type: Rhino.Geometry.Curve
A curve.
mesh
Type: Rhino.Geometry.Mesh
A mesh.
direction
Type: Rhino.Geometry.Vector3d
A direction vector.
tolerance
Type: System.Double
A tolerance value.
Return Value
Type: Curve[]
A curve array.
See Also
Reference
Curve Class
ProjectToMesh Overload
Rhino.Geometry Namespace