RhinoCommon SDK
PointCloud.ClearNormals Method
Rhino for Mac 5.1
 Destroys the normal vector information in this point cloud.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void ClearNormals()
Public Sub ClearNormals
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace