RhinoCommon SDK
PointCloudItem.Normal Property
Rhino for Mac 5.1
 Gets or sets the normal vector for this point cloud item.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d Normal { get; set; }
Public Property Normal As Vector3d
	Get
	Set
Property Value
Type: Vector3d
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace