RhinoCommon SDK
Texture.UvwTransform Property
Rhino for Mac 5.1
 Transform to be applied to each instance of this texture if ApplyUvw is true
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform UvwTransform { get; set; }
Public Property UvwTransform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
Texture Class
Rhino.DocObjects Namespace