RhinoCommon SDK
DisplayPipeline.PopCullFaceMode Method
Rhino for Mac 5.1
 Pop a FaceCull flag off the engine's stack.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PopCullFaceMode()
Public Sub PopCullFaceMode
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace