RhinoCommon SDK
SweepTwoRail.AngleToleranceRadians Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Geometry.SweepTwoRail.AngleToleranceRadians"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double AngleToleranceRadians { get; set; }
Public Property AngleToleranceRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace