RhinoCommon SDK
Extrusion.Profile3d Method (ComponentIndex)
Rhino for Mac 5.1
 Gets one of the profiles.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve Profile3d(
	ComponentIndex ci
)
Public Function Profile3d (
	ci As ComponentIndex
) As Curve
Parameters
ci
Type: Rhino.Geometry.ComponentIndex
The index of this profile.
Return Value
Type: Curve
The profile.
See Also
Reference
Extrusion Class
Profile3d Overload
Rhino.Geometry Namespace