RhinoCommon SDK
IntersectionEvent.IsPoint Property
Rhino for Mac 5.1
 All curve intersection events are either a single point or an overlap.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsPoint { get; }
Public ReadOnly Property IsPoint As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace