RhinoCommon SDK
File3dm.StartSectionComments Property
Rhino for Mac 5.1
 Gets or sets the start section comments, which are the comments with which the 3dm file begins.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string StartSectionComments { get; set; }
Public Property StartSectionComments As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dm Class
Rhino.FileIO Namespace