RhinoCommon SDK
File3dm.HistoryRecords Property
Rhino for Mac 5.1
 History records stored in this file
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public File3dmHistoryRecordTable HistoryRecords { get; }
Public ReadOnly Property HistoryRecords As File3dmHistoryRecordTable
	Get
Property Value
Type: File3dmHistoryRecordTable
See Also
Reference
File3dm Class
Rhino.FileIO Namespace