RhinoCommon SDK
CachedTextureCoordinates.Count Property
Rhino for Mac 5.1
 Number of cached coordinates.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
ICollection<T>.Count
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace