RhinoCommon SDK
ObjectTable.AddPoint Method (Point3f, ObjectAttributes)
Rhino for Mac 5.1
Adds a point object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddPoint(
	Point3f point,
	ObjectAttributes attributes
)
Public Function AddPoint (
	point As Point3f,
	attributes As ObjectAttributes
) As Guid
Parameters
point
Type: Rhino.Geometry.Point3f
location of point.
attributes
Type: Rhino.DocObjects.ObjectAttributes
attributes to apply to point.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddPoint Overload
Rhino.DocObjects.Tables Namespace