RhinoCommon SDK
DisplayPipeline.DrawMeshShaded Method (Mesh, DisplayMaterial, Int32[])
Rhino for Mac 5.1
 Draws the shaded faces of a given mesh.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawMeshShaded(
	Mesh mesh,
	DisplayMaterial material,
	int[] faceIndices
)
Public Sub DrawMeshShaded (
	mesh As Mesh,
	material As DisplayMaterial,
	faceIndices As Integer()
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
Mesh to draw.
material
Type: Rhino.Display.DisplayMaterial
Material to draw faces with.
faceIndices
Type: System.Int32[]
Indices of specific faces to draw
See Also
Reference
DisplayPipeline Class
DrawMeshShaded Overload
Rhino.Display Namespace