RhinoCommon SDK
DrawEventArgs Properties
Rhino for Mac 5.1
The DrawEventArgs type exposes the following members.
Properties
Name | Description
Display
RhinoDoc
Viewport
Top
See Also
Reference
DrawEventArgs Class
Rhino.Display Namespace