RhinoCommon SDK
RhinoViewport.Magnify Method
Rhino for Mac 5.1
Overload List
Name | Description
Magnify(Double, Boolean)
 Zooms or dollies in order to scale the viewport projection of observed objects.
Magnify(Double, Boolean, Point)
 Zooms or dollies in order to scale the viewport projection of observed objects.
Top
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace