RhinoCommon SDK
Intersection.PlanePlane Method
Rhino for Mac 5.1
 Intersects two planes and return the intersection line. If the planes are parallel or coincident, no intersection is assumed.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool PlanePlane(
	Plane planeA,
	Plane planeB,
	out Line intersectionLine
)
Public Shared Function PlanePlane (
	planeA As Plane,
	planeB As Plane,
	<OutAttribute> ByRef intersectionLine As Line
) As Boolean
Parameters
planeA
Type: Rhino.Geometry.Plane
First plane for intersection.
planeB
Type: Rhino.Geometry.Plane
Second plane for intersection.
intersectionLine
Type: Rhino.Geometry.Line
If this function returns true, the intersectionLine parameter will return the line where the planes intersect.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace