RhinoCommon SDK
Interval.NormalizedParameterAt Method
Rhino for Mac 5.1
Converts interval value, or pair of values, to normalized parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double NormalizedParameterAt(
	double intervalParameter
)
Public Function NormalizedParameterAt (
	intervalParameter As Double
) As Double
Parameters
intervalParameter
Type: System.Double
[Missing <param name="intervalParameter"/> documentation for "M:Rhino.Geometry.Interval.NormalizedParameterAt(System.Double)"]
Return Value
Type: Double
Normalized parameter x so that min*(1.0-x) + max*x = intervalParameter.
See Also
Reference
Interval Structure
Rhino.Geometry Namespace
ParameterAt