RhinoCommon SDK
Quaternion.Equals Method (Object)
Rhino for Mac 5.1
 Determines whether an object is a quaternion and has the same value of this quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
Another object to compare.
Return Value
Type: Boolean
true if obj is a quaternion and has exactly equal coefficients; otherwise false.
See Also
Reference
Quaternion Structure
Equals Overload
Rhino.Geometry Namespace