RhinoCommon SDK
Layer.PlotWeight Property
Rhino for Mac 5.1
 Gets or sets the thickness of the plotting pen in millimeters. A thickness of 0.0 indicates the "default" pen weight should be used.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double PlotWeight { get; set; }
Public Property PlotWeight As Double
	Get
	Set
Property Value
Type: Double
Remarks
If you are modifying a layer inside a Rhino document, you must call CommitChanges for the modifications to take effect.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace