RhinoCommon SDK
Surface.TryGetCone Method (Cone, Double)
Rhino for Mac 5.1
Tests a surface to see if it is a portion of a cone and returns the cone.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetCone(
	out Cone cone,
	double tolerance
)
Public Function TryGetCone (
	<OutAttribute> ByRef cone As Cone,
	tolerance As Double
) As Boolean
Parameters
cone
Type: Rhino.Geometry.Cone
On success, the cone parameters are filled in.
tolerance
Type: System.Double
tolerance to use when checking.
Return Value
Type: Boolean
true if the surface is a portion of a cone.
See Also
Reference
Surface Class
TryGetCone Overload
Rhino.Geometry Namespace