RhinoCommon SDK
DisplayPipeline.EnableColorWriting Method
Rhino for Mac 5.1
 Enable or disable the ColorWriting behaviour of the engine.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableColorWriting(
	bool enable
)
Public Sub EnableColorWriting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true to enable ColorWriting, false to disable.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace