RhinoCommon SDK
MouseCallbackEventArgs.ViewportPoint Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.ViewportPoint"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point ViewportPoint { get; }
Public ReadOnly Property ViewportPoint As Point
	Get
Property Value
Type: Point
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace