RhinoCommon SDK
MouseCallbackEventArgs.Button Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.Button"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MouseButton Button { get; }
Public ReadOnly Property Button As MouseButton
	Get
Property Value
Type: MouseButton
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace