RhinoCommon SDK
LinearDimension.DistanceBetweenArrowTips Property
Rhino for Mac 5.1
 Gets the distance between arrow tips.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double DistanceBetweenArrowTips { get; }
Public ReadOnly Property DistanceBetweenArrowTips As Double
	Get
Property Value
Type: Double
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace