RhinoCommon SDK
Point Class
Rhino for Mac 5.1
 Represents a geometric point.
This is fundamentally a class that derives from GeometryBase and contains a single Point3d location.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Point
 Rhino.Geometry.BrepVertex
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class Point : GeometryBase
<SerializableAttribute>
Public Class Point
	Inherits GeometryBase
The Point type exposes the following members.
Constructors
Name | Description
Point(Point3d)
 Initializes a new point instance with a location.
Point(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
Properties
Name | Description
Location
 Gets or sets the location (position) of this point.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace