RhinoCommon SDK
MeshingParameters.MinimumTolerance Property
Rhino for Mac 5.1
 Gets or sets the minimum tolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double MinimumTolerance { get; set; }
Public Property MinimumTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace