RhinoCommon SDK
BoundingBox.Union Method (Point3d)
Rhino for Mac 5.1
 Updates this BoundingBox to represent the union of itself and a point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Union(
	Point3d point
)
Public Sub Union (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
Point to include in the union.
Remarks
If this boundingbox is InValid then the union will be the BoundingBox containing only the point. If the point is InValid, this BoundingBox will remain unchanged.
See Also
Reference
BoundingBox Structure
Union Overload
Rhino.Geometry Namespace