RhinoCommon SDK
NurbsSurfaceKnotList.ClampedAtStart Property
Rhino for Mac 5.1
Determines if a knot vector is clamped.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ClampedAtStart { get; }
Public ReadOnly Property ClampedAtStart As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
NurbsSurfaceKnotList Class
Rhino.Geometry.Collections Namespace