RhinoCommon SDK
InstanceObject Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.InstanceObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.InstanceObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class InstanceObject : RhinoObject
Public Class InstanceObject
	Inherits RhinoObject
The InstanceObject type exposes the following members.
Properties
Name | Description
InsertionPoint
Basepoint coordinates of a block.
InstanceDefinition
instance definition that this object uses.
InstanceXform
 transformation applied to an instance definition for this object.
Top
Methods
Name | Description
Explode
 Explodes the instance reference into pieces.
UsesDefinition
Determine if this reference uses an instance definition
Top
See Also
Reference
Rhino.DocObjects Namespace