RhinoCommon SDK
CustomCurveObject Methods
Rhino for Mac 5.1
The CustomCurveObject type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
SetCurve
 Only for developers who are defining custom subclasses of CurveObject. Directly sets the internal curve geometry for this object. Note that this function does not work with Rhino's "undo".
Top
See Also
Reference
CustomCurveObject Class
Rhino.DocObjects.Custom Namespace