RhinoCommon SDK
Surface.Pullback Method (Curve, Double)
Rhino for Mac 5.1
 Pulls a 3d curve back to the surface's parameter space.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve Pullback(
	Curve curve3d,
	double tolerance
)
Public Function Pullback (
	curve3d As Curve,
	tolerance As Double
) As Curve
Parameters
curve3d
Type: Rhino.Geometry.Curve
The curve to pull.
tolerance
Type: System.Double
 the maximum acceptable 3d distance between from surface(curve_2d(t)) to the locus of points on the surface that are closest to curve_3d.
Return Value
Type: Curve
2d curve.
See Also
Reference
Surface Class
Pullback Overload
Rhino.Geometry Namespace