RhinoCommon SDK
MeshTopologyEdgeList.GetEdgesForFace Method (Int32, Boolean[])
Rhino for Mac 5.1
 Gets indices of edges that surround a given face.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] GetEdgesForFace(
	int faceIndex,
	out bool[] sameOrientation
)
Public Function GetEdgesForFace (
	faceIndex As Integer,
	<OutAttribute> ByRef sameOrientation As Boolean()
) As Integer()
Parameters
faceIndex
Type: System.Int32
A face index.
sameOrientation
Type: System.Boolean[]
 Same length as returned edge index array. For each edge, the sameOrientation value tells you if the edge orientation matches the face orientation (true), or is reversed (false) compared to it.
Return Value
Type: Int32[]
A new array of indices to the topological edges that are connected with the specified face.
See Also
Reference
MeshTopologyEdgeList Class
GetEdgesForFace Overload
Rhino.Geometry.Collections Namespace