RhinoCommon SDK
RevSurface.CreateFromSphere Method
Rhino for Mac 5.1
 Constructs a new surface of revolution from the values of a sphere.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static RevSurface CreateFromSphere(
	Sphere sphere
)
Public Shared Function CreateFromSphere (
	sphere As Sphere
) As RevSurface
Parameters
sphere
Type: Rhino.Geometry.Sphere
A sphere.
Return Value
Type: RevSurface
A new surface of revolution, or null if any of the inputs is invalid or on error.
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace