RhinoCommon SDK
ObjectTable.AddTextDot Method (TextDot)
Rhino for Mac 5.1
Adds a text dot object to Rhino.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddTextDot(
	TextDot dot
)
Public Function AddTextDot (
	dot As TextDot
) As Guid
Parameters
dot
Type: Rhino.Geometry.TextDot
A text dot that will be copied.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddTextDot Overload
Rhino.DocObjects.Tables Namespace