RhinoCommon SDK
ToolbarFileCollection Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.ToolbarFileCollection"]
Inheritance Hierarchy
System.Object
 Rhino.UI.ToolbarFileCollection
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class ToolbarFileCollection : IEnumerable<ToolbarFile>,
	IEnumerable
Public NotInheritable Class ToolbarFileCollection
	Implements IEnumerable(Of ToolbarFile), IEnumerable
The ToolbarFileCollection type exposes the following members.
Properties
Name | Description
Count
 Number of open toolbar files
Item
MruSidebarIsVisible
SidebarIsVisible
Top
Methods
Name | Description
FindByName
FindByPath
GetEnumerator
Open
Top
See Also
Reference
Rhino.UI Namespace