RhinoCommon SDK
RhinoObject.NextRuntimeSerialNumber Property
Rhino for Mac 5.1
 Gets the runtime serial number that will be assigned to the next Rhino Object that is created.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static uint NextRuntimeSerialNumber { get; }
Public Shared ReadOnly Property NextRuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace