RhinoCommon SDK
File3dmPlugInData.PlugInId Property
Rhino for Mac 5.1
 Plug-in this data is associated with
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid PlugInId { get; }
Public ReadOnly Property PlugInId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
File3dmPlugInData Class
Rhino.FileIO Namespace