RhinoCommon SDK
TextureType Enumeration
Rhino for Mac 5.1
 The TextureType controls how the pixels in the bitmap are interpreted.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum TextureType
Public Enumeration TextureType
Members
Member name | Value | Description
None | 0
Bitmap | 1 |  Standard image texture
Bump | 2 |  bump map
Transparency | 3 |  value = alpha
See Also
Reference
Rhino.DocObjects Namespace