RhinoCommon SDK
Surface.TryGetSphere Method
Rhino for Mac 5.1
Overload List
Name | Description
TryGetSphere(Sphere)
Test a surface to see if it is a portion of a sphere and return the sphere.
TryGetSphere(Sphere, Double)
Test a surface to see if it is a portion of a sphere and return the sphere.
Top
See Also
Reference
Surface Class
Rhino.Geometry Namespace