RhinoCommon SDK
TransformObjectList.AddObjects Method
Rhino for Mac 5.1
 Add objects to list with a GetObject
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddObjects(
	GetObject go,
	bool allowGrips
)
Public Function AddObjects (
	go As GetObject,
	allowGrips As Boolean
) As Integer
Parameters
go
Type: Rhino.Input.Custom.GetObject
Setup the GetObject, ie. prompt, geometry filter, allow pre/post select before passing it as an argument.
allowGrips
Type: System.Boolean
Specifically allow grips to be selected. if true, grips must also be included in geometry filter of the GetObject in order to be selected.
Return Value
Type: Int32
Number of objects selected.
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace