RhinoCommon SDK
ObjectEnumeratorSettings.ObjectTypeFilter Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.ObjectTypeFilter"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectType ObjectTypeFilter { get; set; }
Public Property ObjectTypeFilter As ObjectType
	Get
	Set
Property Value
Type: ObjectType
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace