RhinoCommon SDK
BinaryArchiveWriter.WriteUInt Method
Rhino for Mac 5.1
 Writes a UInt32 value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteUInt(
	uint value
)
Public Sub WriteUInt (
	value As UInteger
)
Parameters
value
Type: System.UInt32
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace