RhinoCommon SDK
File3dmObjectTable.AddPoints Method (IEnumerable<Point3d>, ObjectAttributes)
Rhino for Mac 5.1
 Adds multiple points to the document.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid[] AddPoints(
	IEnumerable<Point3d> points,
	ObjectAttributes attributes
)
Public Function AddPoints (
	points As IEnumerable(Of Point3d),
	attributes As ObjectAttributes
) As Guid()
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to add.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to point objects.
Return Value
Type: Guid[]
An array of object unique identifiers.
See Also
Reference
File3dmObjectTable Class
AddPoints Overload
Rhino.FileIO Namespace