RhinoCommon SDK
MouseButton Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.MouseButton"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[FlagsAttribute]
public enum MouseButton
<FlagsAttribute>
Public Enumeration MouseButton
Members
Member name | Value | Description
None | 0
Left | 1
Right | 2
Middle | 4
See Also
Reference
Rhino.UI Namespace