RhinoCommon SDK
CurveExtensionStyle Enumeration
Rhino for Mac 5.1
 Defines enumerated values for styles to use during curve extension, such as "Line", "Arc" or "Smooth".
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum CurveExtensionStyle
Public Enumeration CurveExtensionStyle
Members
Member name | Value | Description
Line | 0 |  Curve ends will be propagated linearly according to tangents.
Arc | 1 |  Curve ends will be propagated arc-wise according to curvature.
Smooth | 2 |  Curve ends will be propagated smoothly according to curvature.
See Also
Reference
Rhino.Geometry Namespace