RhinoCommon SDK
Cylinder Structure
Rhino for Mac 5.1
 Represents the values of a plane, a radius and two heights -on top and beneath- that define a right circular cylinder.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public struct Cylinder : IEpsilonComparable<Cylinder>
<SerializableAttribute>
Public Structure Cylinder
	Implements IEpsilonComparable(Of Cylinder)
The Cylinder type exposes the following members.
Constructors
Name | Description
Cylinder(Circle)
 Constructs a new cylinder with infinite height.
Cylinder(Circle, Double)
 Constructs a new cylinder with a finite height.
Top
Properties
Name | Description
Axis
 Gets the axis direction of the cylinder.
Center
 Gets the center point of the defining circle.
Height1
 Gets or sets the start height of the cylinder.
Height2
 Gets or sets the end height of the cylinder. If the end height equals the start height, the cylinder is presumed to be infinite.
IsFinite
 true if the cylinder is finite (Height0 != Height1) false if the cylinder is infinite.
IsValid
 Gets a boolean value indicating whether this cylinder is valid.
A valid cylinder is represented by a valid circle and two valid heights.
TotalHeight
 Gets the height of the cylinder. Infinite cylinders have a height of zero, not Double.PositiveInfinity.
Unset
 Gets an invalid Cylinder.
Top
Methods
Name | Description
CircleAt
 Compute the circle at the given elevation parameter.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
LineAt
 Compute the line at the given angle parameter. This line will be degenerate if the cylinder is infite.
ToBrep
 Constructs a Brep representation of this Cylinder. This is synonymous with calling NurbsSurface.CreateFromCylinder().
ToNurbsSurface
 Constructs a Nurbs surface representation of this cylinder. This is synonymous with calling NurbsSurface.CreateFromCylinder().
ToRevSurface
 Constructs a RevSurface representation of this Cylinder. This is synonymous with calling RevSurface.CreateFromCylinder().
Top
See Also
Reference
Rhino.Geometry Namespace