RhinoCommon SDK
GetBaseClass.AddOptionColor Method (LocalizeStringPair, OptionColor)
Rhino for Mac 5.1
 Add a command line option to get colors and automatically save the value.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int AddOptionColor(
	LocalizeStringPair optionName,
	ref OptionColor colorValue
)
Public Function AddOptionColor (
	optionName As LocalizeStringPair,
	ByRef colorValue As OptionColor
) As Integer
Parameters
optionName
Type: Rhino.UI.LocalizeStringPair
option description
colorValue
Type: Rhino.Input.Custom.OptionColor
The current color value.
Return Value
Type: Int32
option index value (>0) or 0 if option cannot be added.
See Also
Reference
GetBaseClass Class
AddOptionColor Overload
Rhino.Input.Custom Namespace