RhinoCommon SDK
GetPoint.PermitOrthoSnap Method
Rhino for Mac 5.1
 Controls availability of ortho snap. Default is true.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PermitOrthoSnap(
	bool permit
)
Public Sub PermitOrthoSnap (
	permit As Boolean
)
Parameters
permit
Type: System.Boolean
 if true, then GetPoint pays attention to the Rhino "ortho snap" and "planar snap" settings reported by ModelAidSettings.Ortho and ModelAidSettings.Planar.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace