RhinoCommon SDK
Light.GetSpotLightRadii Method
Rhino for Mac 5.1
 Gets the spot light radii.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetSpotLightRadii(
	out double innerRadius,
	out double outerRadius
)
Public Function GetSpotLightRadii (
	<OutAttribute> ByRef innerRadius As Double,
	<OutAttribute> ByRef outerRadius As Double
) As Boolean
Parameters
innerRadius
Type: System.Double
The inner radius. This out parameter is assigned during this call.
outerRadius
Type: System.Double
The outer radius. This out parameter is assigned during this call.
Return Value
Type: Boolean
true if operation succeeded; otherwise, false.
See Also
Reference
Light Class
Rhino.Geometry Namespace