RhinoCommon SDK
GripStatus Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.GripStatus"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Custom.GripStatus
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class GripStatus
Public Class GripStatus
The GripStatus type exposes the following members.
Properties
Name | Description
Culled
Visible
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace