RhinoCommon SDK
ObjectTable.Lock Method (Guid, Boolean)
Rhino for Mac 5.1
 If objref.Object().IsNormal() is true, then the object will be locked.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Lock(
	Guid objectId,
	bool ignoreLayerMode
)
Public Function Lock (
	objectId As Guid,
	ignoreLayerMode As Boolean
) As Boolean
Parameters
objectId
Type: System.Guid
Id of normal object to lock.
ignoreLayerMode
Type: System.Boolean
 if true, the object will be locked even if it is on a layer that is locked or off.
Return Value
Type: Boolean
true if the object was successfully locked.
See Also
Reference
ObjectTable Class
Lock Overload
Rhino.DocObjects.Tables Namespace