RhinoCommon SDK
Rectangle3d.ClosestPoint Method
Rhino for Mac 5.1
Overload List
Name | Description
ClosestPoint(Point3d)
 Gets the point on the rectangle that is closest to a test-point.
ClosestPoint(Point3d, Boolean)
 Gets the point on the rectangle that is closest to a test-point.
Top
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace