RhinoCommon SDK
BinaryArchiveReader.SeekFromCurrentPosition Method (UInt64, Boolean)
Rhino for Mac 5.1
 seek from current position ( like fseek( ,SEEK_CUR) )
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SeekFromCurrentPosition(
	ulong byteOffset,
	bool forward
)
Public Function SeekFromCurrentPosition (
	byteOffset As ULong,
	forward As Boolean
) As Boolean
Parameters
byteOffset
Type: System.UInt64
[Missing <param name="byteOffset"/> documentation for "M:Rhino.FileIO.BinaryArchiveReader.SeekFromCurrentPosition(System.UInt64,System.Boolean)"]
forward
Type: System.Boolean
seek forward of backward in the archive
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.FileIO.BinaryArchiveReader.SeekFromCurrentPosition(System.UInt64,System.Boolean)"]
See Also
Reference
BinaryArchiveReader Class
SeekFromCurrentPosition Overload
Rhino.FileIO Namespace