RhinoCommon SDK
PointCloudItem Class
Rhino for Mac 5.1
 Represents a single item in a pointcloud. A PointCloud item always has a location, but it has an optional normal vector and color.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.PointCloudItem
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class PointCloudItem
Public Class PointCloudItem
The PointCloudItem type exposes the following members.
Properties
Name | Description
Color
 Gets or sets the color of this point cloud item.
Hidden
 Gets or sets the hidden flag of this point cloud item.
Index
 Gets the index of this point cloud item.
Location
 Gets or sets the location of this point cloud item.
Normal
 Gets or sets the normal vector for this point cloud item.
X
 Gets or sets the X component of this point cloud item location.
Y
 Gets or sets the Y component of this point cloud item location.
Z
 Gets or sets the Z component of this point cloud item location.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace