RhinoCommon SDK
BrepFace.IsPointOnFace Method
Rhino for Mac 5.1
 Tests if a parameter space point is on the interior of a trimmed face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PointFaceRelation IsPointOnFace(
	double u,
	double v
)
Public Function IsPointOnFace (
	u As Double,
	v As Double
) As PointFaceRelation
Parameters
u
Type: System.Double
Parameter space point u value.
v
Type: System.Double
Parameter space point v value.
Return Value
Type: PointFaceRelation
A value describing the spatial relationship between the point and the face.
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace