RhinoCommon SDK
Command.LookupCommandId Method
Rhino for Mac 5.1
 Returns the ID of a command.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid LookupCommandId(
	string name,
	bool searchForEnglishName
)
Public Shared Function LookupCommandId (
	name As String,
	searchForEnglishName As Boolean
) As Guid
Parameters
name
Type: System.String
The name of the command.
searchForEnglishName
Type: System.Boolean
true if the name is to searched in English. This ensures that a '_' is prepended to the name.
Return Value
Type: Guid
An of the command, or Empty on error.
See Also
Reference
Command Class
Rhino.Commands Namespace