RhinoCommon SDK
BinaryArchiveReader.ReadRectangle Method
Rhino for Mac 5.1
 Reads a Rectangle from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Rectangle ReadRectangle()
Public Function ReadRectangle As Rectangle
Return Value
Type: Rectangle
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace