RhinoCommon SDK
GetObject.Objects Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetObject.Objects"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjRef[] Objects()
Public Function Objects As ObjRef()
Return Value
Type: ObjRef[]
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetObject.Objects"]
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace