RhinoCommon SDK
Mesh.CreateContourCurves Method (Mesh, Plane)
Rhino for Mac 5.1
 Constructs contour curves for a mesh, sectioned at a plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] CreateContourCurves(
	Mesh meshToContour,
	Plane sectionPlane
)
Public Shared Function CreateContourCurves (
	meshToContour As Mesh,
	sectionPlane As Plane
) As Curve()
Parameters
meshToContour
Type: Rhino.Geometry.Mesh
A mesh to contour.
sectionPlane
Type: Rhino.Geometry.Plane
A cutting plane.
Return Value
Type: Curve[]
An array of curves. This array can be empty.
See Also
Reference
Mesh Class
CreateContourCurves Overload
Rhino.Geometry Namespace