RhinoCommon SDK
WaitCursor Constructor
Rhino for Mac 5.1
Initializes a new instance of the WaitCursor class
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public WaitCursor()
Public Sub New
See Also
Reference
WaitCursor Class
Rhino.UI Namespace