RhinoCommon SDK
Quaternion.Unitize Method
Rhino for Mac 5.1
 Scales the quaternion's coordinates so that a*a + b*b + c*c + d*d = 1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Unitize()
Public Function Unitize As Boolean
Return Value
Type: Boolean
 true if successful. false if the quaternion is zero and cannot be unitized.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace