RhinoCommon SDK
BrepLoopList Methods
Rhino for Mac 5.1
The BrepLoopList type exposes the following members.
Methods
Name | Description
Add(BrepLoopType)
 Create a new outer boundary loop that runs along the edges of the underlying surface.
Add(BrepLoopType, BrepFace)
 Create a new boundary loop on a face. After you get this BrepLoop, you still need to create the vertices, edges, and trims that define the loop.
AddOuterLoop
 Create a new outer boundary loop that runs along the sides of the face's surface. All the necessary trims, edges, and vertices are created and added to the brep.
AddPlanarFaceLoop
 Add a planar trimming loop to a planar face
GetEnumerator
 Gets an enumerator that visits all edges.
Top
See Also
Reference
BrepLoopList Class
Rhino.Geometry.Collections Namespace