RhinoCommon SDK
Localization.LocalizeString Method (String, Int32)
Rhino for Mac 5.1
 Returns localized version of a given English string. This function should be autogenerated by the RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string LocalizeString(
	string english,
	int contextId
)
Public Shared Function LocalizeString (
	english As String,
	contextId As Integer
) As String
Parameters
english
Type: System.String
The text in English.
contextId
Type: System.Int32
The context ID.
Return Value
Type: String
The localized string.
See Also
Reference
Localization Class
LocalizeString Overload
Rhino.UI Namespace