RhinoCommon SDK
Linetype Properties
Rhino for Mac 5.1
The Linetype type exposes the following members.
Properties
Name | Description
Id
 Gets the ID of this linetype object.
IsDeleted
 Gets a value indicating whether this linetype has been deleted and is currently in the Undo buffer.
IsModified
 true if this linetype has been modified by LinetypeTable.ModifyLinetype() and the modifications can be undone.
IsReference
 Gets a value indicting whether this linetype is a referenced linetype. Referenced linetypes are part of referenced documents.
LinetypeIndex
The index of this linetype.
Name
The name of this linetype.
PatternLength
Total length of one repeat of the pattern.
SegmentCount
Number of segments in the pattern.
Top
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace