RhinoCommon SDK
Dialogs.ShowCheckListBox Method
Rhino for Mac 5.1
 Displays Rhino's check list box.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool[] ShowCheckListBox(
	string title,
	string message,
	IList items,
	IList<bool> checkState
)
Public Shared Function ShowCheckListBox (
	title As String,
	message As String,
	items As IList,
	checkState As IList(Of Boolean)
) As Boolean()
Parameters
title
Type: System.String
The dialog title.
message
Type: System.String
The dialog message.
items
Type: System.Collections.IList
A list of items to show.
checkState
Type: System.Collections.Generic.IList<Boolean>
A list of true/false boolean values.
Return Value
Type: Boolean[]
An array or boolean values determining if the user checked the corresponding box. On error, null.
See Also
Reference
Dialogs Class
Rhino.UI Namespace