RhinoCommon SDK
InstanceDefinitionTable.ModifyGeometry Method (Int32, GeometryBase, ObjectAttributes)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifyGeometry(System.Int32,Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ModifyGeometry(
	int idefIndex,
	GeometryBase newGeometry,
	ObjectAttributes newAttributes
)
Public Function ModifyGeometry (
	idefIndex As Integer,
	newGeometry As GeometryBase,
	newAttributes As ObjectAttributes
) As Boolean
Parameters
idefIndex
Type: System.Int32
[Missing <param name="idefIndex"/> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifyGeometry(System.Int32,Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes)"]
newGeometry
Type: Rhino.Geometry.GeometryBase
[Missing <param name="newGeometry"/> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifyGeometry(System.Int32,Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes)"]
newAttributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="newAttributes"/> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifyGeometry(System.Int32,Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifyGeometry(System.Int32,Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
InstanceDefinitionTable Class
ModifyGeometry Overload
Rhino.DocObjects.Tables Namespace