RhinoCommon SDK
BezierCurve.MakeRational Method
Rhino for Mac 5.1
Make bezier rational
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MakeRational()
Public Function MakeRational As Boolean
Return Value
Type: Boolean
true if successful
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace