RhinoCommon SDK
ObjectAttributes.DrawColor Method (RhinoDoc, Guid)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.DrawColor(Rhino.RhinoDoc,System.Guid)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color DrawColor(
	RhinoDoc document,
	Guid viewportId
)
Public Function DrawColor (
	document As RhinoDoc,
	viewportId As Guid
) As Color
Parameters
document
Type: Rhino.RhinoDoc
[Missing <param name="document"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.DrawColor(Rhino.RhinoDoc,System.Guid)"]
viewportId
Type: System.Guid
[Missing <param name="viewportId"/> documentation for "M:Rhino.DocObjects.ObjectAttributes.DrawColor(Rhino.RhinoDoc,System.Guid)"]
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.DocObjects.ObjectAttributes.DrawColor(Rhino.RhinoDoc,System.Guid)"]
See Also
Reference
ObjectAttributes Class
DrawColor Overload
Rhino.DocObjects Namespace