RhinoCommon SDK
RenderSettings.AmbientLight Property
Rhino for Mac 5.1
 Gets or sets the ambient light color used in rendering.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color AmbientLight { get; set; }
Public Property AmbientLight As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
RenderSettings Class
Rhino.Render Namespace