RhinoCommon SDK
ObjectTable.AddCircle Method (Circle, ObjectAttributes)
Rhino for Mac 5.1
Adds a curve object to the document representing a circle.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddCircle(
	Circle circle,
	ObjectAttributes attributes
)
Public Function AddCircle (
	circle As Circle,
	attributes As ObjectAttributes
) As Guid
Parameters
circle
Type: Rhino.Geometry.Circle
A circle value.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to circle.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddCircle Overload
Rhino.DocObjects.Tables Namespace