RhinoCommon SDK
CommandLineOption.EnglishName Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Input.Custom.CommandLineOption.EnglishName"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string EnglishName { get; }
Public ReadOnly Property EnglishName As String
	Get
Property Value
Type: String
See Also
Reference
CommandLineOption Class
Rhino.Input.Custom Namespace