RhinoCommon SDK
DisplayPipelineAttributes.MeshDisplayAttributes.MeshWireThickness Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes.MeshWireThickness"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int MeshWireThickness { get; set; }
Public Property MeshWireThickness As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DisplayPipelineAttributes.MeshDisplayAttributes Class
Rhino.Display Namespace