RhinoCommon SDK
UserDictionary.OnDuplicate Method
Rhino for Mac 5.1
 Clones the user data.
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected override void OnDuplicate(
	UserData source
)
Protected Overrides Sub OnDuplicate (
	source As UserData
)
Parameters
source
Type: Rhino.DocObjects.Custom.UserData
The source data.
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace