RhinoCommon SDK
TextureMapping Class
Rhino for Mac 5.1
 Represents a texture mapping.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Render.TextureMapping
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class TextureMapping : CommonObject
Public Class TextureMapping
	Inherits CommonObject
The TextureMapping type exposes the following members.
Properties
Name | Description
Id
 The unique Id for this texture mapping object.
MappingType
 Texture mapping type associated with this Mapping object.
NormalTransform
 For primitive based mappings, these transformations are used to map the world coordinate (x,y,z) point P and surface normal N before it is projected to the normalized mapping primitive. The surface normal transformation, m_Nxyz, is always calculated from m_Pxyz. It is a runtime setting that is not saved in 3dm files. If m_type is srfp_mapping, then m_Pxyz and m_Nxyz are ignored.
PrimativeTransform
 For primitive based mappings, these transformations are used to map the world coordinate (x,y,z) point P and surface normal N before it is projected to the normalized mapping primitive. The surface normal transformation, m_Nxyz, is always calculated from m_Pxyz. It is a runtime setting that is not saved in 3dm files. If m_type is srfp_mapping, then m_Pxyz and m_Nxyz are ignored.
UvwTransform
 Transform applied to mapping coordinate (u,v,w) to convert it into a texture coordinate.
Top
Methods
Name | Description
CreateBoxMapping
Create a box projection texture mapping.
CreateCylinderMapping
Create a cylindrical projection texture mapping.
CreatePlaneMapping
Create a planar projection texture mapping
CreateSphereMapping
 Create a spherical projection texture mapping.
TryGetMappingBox
 Get a box projection from the texture mapping.
TryGetMappingCylinder
 Get a cylindrical projection parameters from this texture mapping.
TryGetMappingPlane
 Get plane mapping parameters from this texture mapping.
TryGetMappingSphere
 Get a spherical projection parameters from this texture mapping.
Top
See Also
Reference
Rhino.Render Namespace