RhinoCommon SDK
Brep.SolidOrientation Property
Rhino for Mac 5.1
 Gets the solid orientation state of this Brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepSolidOrientation SolidOrientation { get; }
Public ReadOnly Property SolidOrientation As BrepSolidOrientation
	Get
Property Value
Type: BrepSolidOrientation
See Also
Reference
Brep Class
Rhino.Geometry Namespace