RhinoCommon SDK
GumballObject.SetFromArc Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromArc(Rhino.Geometry.Arc)"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFromArc(
	Arc arc
)
Public Function SetFromArc (
	arc As Arc
) As Boolean
Parameters
arc
Type: Rhino.Geometry.Arc
[Missing <param name="arc"/> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromArc(Rhino.Geometry.Arc)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromArc(Rhino.Geometry.Arc)"]
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace