RhinoCommon SDK
ToolbarFile.Close Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFile.Close(System.Boolean)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Close(
	bool prompt
)
Public Function Close (
	prompt As Boolean
) As Boolean
Parameters
prompt
Type: System.Boolean
[Missing <param name="prompt"/> documentation for "M:Rhino.UI.ToolbarFile.Close(System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFile.Close(System.Boolean)"]
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace