RhinoCommon SDK
CommandStyleAttribute Properties
Rhino for Mac 5.1
The CommandStyleAttribute type exposes the following members.
Properties
Name | Description
Styles
 Gets the associated style.
Top
See Also
Reference
CommandStyleAttribute Class
Rhino.Commands Namespace