RhinoCommon SDK
RhinoObject.ObjectType Property
Rhino for Mac 5.1
 Gets the Rhino-based object type.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectType ObjectType { get; }
Public ReadOnly Property ObjectType As ObjectType
	Get
Property Value
Type: ObjectType
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace