RhinoCommon SDK
Light.PerpendicularDirection Property
Rhino for Mac 5.1
 Gets a perpendicular vector to the camera direction.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d PerpendicularDirection { get; }
Public ReadOnly Property PerpendicularDirection As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
Light Class
Rhino.Geometry Namespace