RhinoCommon SDK
ClippingPlaneSurface Class
Rhino for Mac 5.1
 Represents a planar surface that is used as clipping plane in viewports.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.PlaneSurface
 Rhino.Geometry.ClippingPlaneSurface
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class ClippingPlaneSurface : PlaneSurface
<SerializableAttribute>
Public Class ClippingPlaneSurface
	Inherits PlaneSurface
The ClippingPlaneSurface type exposes the following members.
Constructors
Name | Description
ClippingPlaneSurface
 Protected constructor for internal use.
Top
Properties
Name | Description
Plane
 Gets or sets the clipping plane.
Top
Methods
Name | Description
ViewportIds
 Returns Ids of viewports that this clipping plane is supposed to clip.
Top
See Also
Reference
Rhino.Geometry Namespace