RhinoCommon SDK
MaterialTable Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.MaterialTable"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.MaterialTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class MaterialTable : IEnumerable<Material>,
	IEnumerable
Public NotInheritable Class MaterialTable
	Implements IEnumerable(Of Material), IEnumerable
The MaterialTable type exposes the following members.
Properties
Name | Description
Count
 Returns number of materials in the material table, including deleted materials.
CurrentMaterialIndex
 At all times, there is a "current" material. Unless otherwise specified, new objects are assigned to the current material. The current material is never locked, hidden, or deleted.
CurrentMaterialSource
 Gets or sets the current material source.
Document
Document that owns this table.
Item
 Conceptually, the material table is an array of materials. The operator[] can be used to get individual materials. A material is either active or deleted and this state is reported by Material.IsDeleted.
Top
Methods
Name | Description
Add()
 Adds a new material to the table based on the default material.
Add(Material)
 Adds a new material to the table based on a given material.
Add(Material, Boolean)
 Adds a new material to the table based on a given material.
DeleteAt
 Removes a material at a specific position from this material table.
Find(Guid, Boolean)
Finds a material with a matching id.
Find(String, Boolean)
 Finds a meterial with a given name.
GetEnumerator
Modify
Modify material settings.
ResetMaterial
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace