RhinoCommon SDK
TextDisplayAlignment Enumeration
Rhino for Mac 5.1
 Defines enumerated values for the line alignment of text.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum TextDisplayAlignment
Public Enumeration TextDisplayAlignment
Members
Member name | Value | Description
Normal | 0 |  Normal alignment.
Horizontal | 1 |  Horizontal alignment.
AboveLine | 2 |  Above line alignment.
InLine | 3 |  In line alignment.
See Also
Reference
Rhino.DocObjects Namespace