RhinoCommon SDK
BinaryArchiveReader.ReadTransform Method
Rhino for Mac 5.1
 Reads a Transform from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform ReadTransform()
Public Function ReadTransform As Transform
Return Value
Type: Transform
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace