RhinoCommon SDK
BrepRegion.BoundaryBrep Method
Rhino for Mac 5.1
 Gets the boundary of a region as a brep object. If the region is finite, the boundary will be a closed manifold brep. The boundary may have more than one connected component.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep BoundaryBrep()
Public Function BoundaryBrep As Brep
Return Value
Type: Brep
A brep or null on error.
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace