RhinoCommon SDK
Command.OnHelp Method
Rhino for Mac 5.1
 Is called when the user needs assistance with this command.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void OnHelp()
Protected Overridable Sub OnHelp
See Also
Reference
Command Class
Rhino.Commands Namespace