RhinoCommon SDK
BinaryArchiveWriter.WriteDoubleArray Method
Rhino for Mac 5.1
 Writes a list, an array, or any enumerable of Double to the archive.
The return will always be an array.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteDoubleArray(
	IEnumerable<double> value
)
Public Sub WriteDoubleArray (
	value As IEnumerable(Of Double)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<Double>
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace