RhinoCommon SDK
Brep.ClosestPoint Method (Point3d)
Rhino for Mac 5.1
 Finds a point on the brep that is closest to testPoint.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d ClosestPoint(
	Point3d testPoint
)
Public Function ClosestPoint (
	testPoint As Point3d
) As Point3d
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Base point to project to brep.
Return Value
Type: Point3d
The point on the Brep closest to testPoint or Point3d.Unset if the operation failed.
See Also
Reference
Brep Class
ClosestPoint Overload
Rhino.Geometry Namespace