RhinoCommon SDK
Arc Constructor (Circle, Interval)
Rhino for Mac 5.1
 Initializes a new instance of an arc from a base circle and an interval of angles.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Arc(
	Circle circle,
	Interval angleIntervalRadians
)
Public Sub New (
	circle As Circle,
	angleIntervalRadians As Interval
)
Parameters
circle
Type: Rhino.Geometry.Circle
Circle to base arc upon.
angleIntervalRadians
Type: Rhino.Geometry.Interval
 Increasing angle interval in radians with angleIntervalRadians.Length() <= 2.0*Math.PI.
See Also
Reference
Arc Structure
Arc Overload
Rhino.Geometry Namespace