RhinoCommon SDK
MaterialRefs.Add Method (Guid, MaterialRef)
Rhino for Mac 5.1
 Add or replace an element with the provided key and value to this dictionary.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Add(
	Guid key,
	MaterialRef value
)
Public Sub Add (
	key As Guid,
	value As MaterialRef
)
Parameters
key
Type: System.Guid
 The plug-in associated with this MaterialRef
value
Type: Rhino.DocObjects.MaterialRef
 MaterialRef to add to this dictionary
Implements
IDictionary<TKey, TValue>.Add(TKey, TValue)
Exceptions
Exception | Condition
ArgumentNullException |  value is null.
ArgumentException |  key is empty.
See Also
Reference
MaterialRefs Class
Add Overload
Rhino.DocObjects Namespace