RhinoCommon SDK
OrdinateDimension Class
Rhino for Mac 5.1
 Represents the geometry of a dimension that displays a coordinate of a point.
This class refers to the geometric element that is independent from the document.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.OrdinateDimension
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class OrdinateDimension : AnnotationBase
<SerializableAttribute>
Public Class OrdinateDimension
	Inherits AnnotationBase
The OrdinateDimension type exposes the following members.
Constructors
Name | Description
OrdinateDimension
 Protected constructor used in serialization.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace