RhinoCommon SDK
LightTable.GetEnumerator Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LightTable.GetEnumerator"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<LightObject> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of LightObject)
Return Value
Type: IEnumerator<LightObject>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LightTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace