RhinoCommon SDK
DisplayPipeline.Draw2dText Method (String, Color, Point3d, Boolean, Int32)
Rhino for Mac 5.1
 Draws 2D text on the viewport.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Draw2dText(
	string text,
	Color color,
	Point3d worldCoordinate,
	bool middleJustified,
	int height
)
Public Sub Draw2dText (
	text As String,
	color As Color,
	worldCoordinate As Point3d,
	middleJustified As Boolean,
	height As Integer
)
Parameters
text
Type: System.String
the string to draw.
color
Type: System.Drawing.Color
text color.
worldCoordinate
Type: Rhino.Geometry.Point3d
definition point in world coordinates.
middleJustified
Type: System.Boolean
if true text is centered around the definition point, otherwise it is lower-left justified.
height
Type: System.Int32
height in pixels (good default is 12)
See Also
Reference
DisplayPipeline Class
Draw2dText Overload
Rhino.Display Namespace