RhinoCommon SDK
Matrix.Scale Method
Rhino for Mac 5.1
 Modifies the current matrix by multiplying its values by a number.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Scale(
	double s
)
Public Sub Scale (
	s As Double
)
Parameters
s
Type: System.Double
A scale factor.
See Also
Reference
Matrix Class
Rhino.Geometry Namespace