RhinoCommon SDK
LightTable.Modify Method
Rhino for Mac 5.1
Overload List
Name | Description
Modify(Guid, Light)
Modify(Int32, Light)
Top
See Also
Reference
LightTable Class
Rhino.DocObjects.Tables Namespace