RhinoCommon SDK
BinaryArchiveReader.ReadColor Method
Rhino for Mac 5.1
 Reads a Color from the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color ReadColor()
Public Function ReadColor As Color
Return Value
Type: Color
The element that was read.
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace