RhinoCommon SDK
EarthAnchorPoint.Name Property
Rhino for Mac 5.1
 Gets or sets the short form of the identifying information about this location.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace