RhinoCommon SDK
RhinoReplaceObjectEventArgs.OldRhinoObject Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoReplaceObjectEventArgs.OldRhinoObject"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject OldRhinoObject { get; }
Public ReadOnly Property OldRhinoObject As RhinoObject
	Get
Property Value
Type: RhinoObject
See Also
Reference
RhinoReplaceObjectEventArgs Class
Rhino.DocObjects Namespace