RhinoCommon SDK
CustomMeshObject Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.CustomMeshObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.MeshObject
 Rhino.DocObjects.Custom.CustomMeshObject
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class CustomMeshObject : MeshObject,
	IDisposable
Public MustInherit Class CustomMeshObject
	Inherits MeshObject
	Implements IDisposable
The CustomMeshObject type exposes the following members.
Constructors
Name | Description
CustomMeshObject()
Initializes a new instance of the CustomMeshObject class
CustomMeshObject(Mesh)
Initializes a new instance of the CustomMeshObject class
Top
Properties
Name | Description
Top
Methods
Name | Description
Dispose()
Releases all resources used by the CustomMeshObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomMeshObject and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace