RhinoCommon SDK
BinaryArchiveReader.ReadErrorOccured Property
Rhino for Mac 5.1
 Gets or sets whether en error occurred during reading.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ReadErrorOccured { get; set; }
Public Property ReadErrorOccured As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace