RhinoCommon SDK
ObjectAttributes.SetDisplayModeOverride Method (DisplayModeDescription)
Rhino for Mac 5.1
 By default, objects are drawn using the display mode of the viewport that the object is being drawn in. Setting a specific display mode, instructs Rhino to always use that display mode, regardless of the viewport's mode. This version affects the object's display mode for all viewports.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetDisplayModeOverride(
	DisplayModeDescription mode
)
Public Function SetDisplayModeOverride (
	mode As DisplayModeDescription
) As Boolean
Parameters
mode
Type: Rhino.Display.DisplayModeDescription
The display mode.
Return Value
Type: Boolean
true if setting was successful.
See Also
Reference
ObjectAttributes Class
SetDisplayModeOverride Overload
Rhino.DocObjects Namespace