RhinoCommon SDK
GetPoint.InterruptMouseMove Method
Rhino for Mac 5.1
 If you have lengthy computations in OnMouseMove() and/or DymanicDraw() overrides, then periodically call InterruptMouseMove() to see if you should interrupt your work because the mouse has moved again.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool InterruptMouseMove()
Public Function InterruptMouseMove As Boolean
Return Value
Type: Boolean
true if you should interrupt your work; false otherwise.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace