RhinoCommon SDK
NurbsCurve Constructor (Int32, Int32)
Rhino for Mac 5.1
 Constructs a new Nurbscurve with a specific degree and control-point count.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public NurbsCurve(
	int degree,
	int pointCount
)
Public Sub New (
	degree As Integer,
	pointCount As Integer
)
Parameters
degree
Type: System.Int32
Degree of curve. Must be equal to or larger than 1 and smaller than or equal to 11.
pointCount
Type: System.Int32
Number of control-points.
See Also
Reference
NurbsCurve Class
NurbsCurve Overload
Rhino.Geometry Namespace