RhinoCommon SDK
Curve.CreateBooleanUnion Method
Rhino for Mac 5.1
 Calculates the boolean union of two or more closed, planar curves. Note, curves must be co-planar.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Curve[] CreateBooleanUnion(
	IEnumerable<Curve> curves
)
Public Shared Function CreateBooleanUnion (
	curves As IEnumerable(Of Curve)
) As Curve()
Parameters
curves
Type: System.Collections.Generic.IEnumerable<Curve>
The co-planar curves to union.
Return Value
Type: Curve[]
Result curves on success, empty array if no union could be calculated.
See Also
Reference
Curve Class
Rhino.Geometry Namespace