RhinoCommon SDK
BrepLoopList Class
Rhino for Mac 5.1
 Provides access to all the Loops in a Brep object.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.BrepLoopList
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class BrepLoopList : IEnumerable<BrepLoop>,
	IEnumerable
Public Class BrepLoopList
	Implements IEnumerable(Of BrepLoop), IEnumerable
The BrepLoopList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of brep loops.
Item
 Gets the BrepLoop at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
Methods
Name | Description
Add(BrepLoopType)
 Create a new outer boundary loop that runs along the edges of the underlying surface.
Add(BrepLoopType, BrepFace)
 Create a new boundary loop on a face. After you get this BrepLoop, you still need to create the vertices, edges, and trims that define the loop.
AddOuterLoop
 Create a new outer boundary loop that runs along the sides of the face's surface. All the necessary trims, edges, and vertices are created and added to the brep.
AddPlanarFaceLoop
 Add a planar trimming loop to a planar face
GetEnumerator
 Gets an enumerator that visits all edges.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace