RhinoCommon SDK
GetColorEventArgs.IncludeButtonColors Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.GetColorEventArgs.IncludeButtonColors"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IncludeButtonColors { get; }
Public ReadOnly Property IncludeButtonColors As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
GetColorEventArgs Class
Rhino.UI Namespace