RhinoCommon SDK
Surface.CreateExtrusionToPoint Method
Rhino for Mac 5.1
 Constructs a surface by extruding a curve to a point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Surface CreateExtrusionToPoint(
	Curve profile,
	Point3d apexPoint
)
Public Shared Function CreateExtrusionToPoint (
	profile As Curve,
	apexPoint As Point3d
) As Surface
Parameters
profile
Type: Rhino.Geometry.Curve
Profile curve to extrude.
apexPoint
Type: Rhino.Geometry.Point3d
Apex point of extrusion.
Return Value
Type: Surface
A Surface on success or null on failure.
See Also
Reference
Surface Class
Rhino.Geometry Namespace