RhinoCommon SDK
ToolbarGroup Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.ToolbarGroup"]
Inheritance Hierarchy
System.Object
 Rhino.UI.ToolbarGroup
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class ToolbarGroup
Public NotInheritable Class ToolbarGroup
The ToolbarGroup type exposes the following members.
Properties
Name | Description
Id
IsDocked
Name
Visible
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.UI Namespace