RhinoCommon SDK
CustomDisplay.AddPolygon Method
Rhino for Mac 5.1
 Adds a polygon to the drawing list. Polygons are not like Hatches, when you supply a concave polygon, the shading probably won't work.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddPolygon(
	IEnumerable<Point3d> polygon,
	Color fillColor,
	Color edgeColor,
	bool drawFill,
	bool drawEdge
)
Public Sub AddPolygon (
	polygon As IEnumerable(Of Point3d),
	fillColor As Color,
	edgeColor As Color,
	drawFill As Boolean,
	drawEdge As Boolean
)
Parameters
polygon
Type: System.Collections.Generic.IEnumerable<Point3d>
Points that define the corners of the polygon.
fillColor
Type: System.Drawing.Color
Fill color of polygon.
edgeColor
Type: System.Drawing.Color
Edge color of polygon.
drawFill
Type: System.Boolean
If true, the polygon contents will be drawn.
drawEdge
Type: System.Boolean
If true, the polygon edge will be drawn.
See Also
Reference
CustomDisplay Class
Rhino.Display Namespace