RhinoCommon SDK
FlowSpaceMorph Constructor (Curve, Curve, Boolean)
Rhino for Mac 5.1
 Constructs a flow space morph.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public FlowSpaceMorph(
	Curve curve0,
	Curve curve1,
	bool preventStretching
)
Public Sub New (
	curve0 As Curve,
	curve1 As Curve,
	preventStretching As Boolean
)
Parameters
curve0
Type: Rhino.Geometry.Curve
Base curve.
curve1
Type: Rhino.Geometry.Curve
Target curve.
preventStretching
Type: System.Boolean
[Missing <param name="preventStretching"/> documentation for "M:Rhino.Geometry.Morphs.FlowSpaceMorph.#ctor(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean)"]
See Also
Reference
FlowSpaceMorph Class
FlowSpaceMorph Overload
Rhino.Geometry.Morphs Namespace