RhinoCommon SDK
Point4d Constructor (Point3d)
Rhino for Mac 5.1
 Initializes a new instance of the Point4d class from the coordinates of a point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point4d(
	Point3d point
)
Public Sub New (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
.
See Also
Reference
Point4d Structure
Point4d Overload
Rhino.Geometry Namespace