RhinoCommon SDK
Point2d Constructor (Point2d)
Rhino for Mac 5.1
 Initializes a new instance of Point2d by copying another Point2d.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point2d(
	Point2d point
)
Public Sub New (
	point As Point2d
)
Parameters
point
Type: Rhino.Geometry.Point2d
The point that will be copied.
See Also
Reference
Point2d Structure
Point2d Overload
Rhino.Geometry Namespace