RhinoCommon SDK
ObjectAttributes.Duplicate Method
Rhino for Mac 5.1
 Constructs a copy of this ObjectAttributes instance.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectAttributes Duplicate()
Public Function Duplicate As ObjectAttributes
Return Value
Type: ObjectAttributes
A new instance on success, or null on failure.
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace