RhinoCommon SDK
Point3d Constructor (Point3d)
Rhino for Mac 5.1
 Initializes a new point by copying coordinates from another point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d(
	Point3d point
)
Public Sub New (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
See Also
Reference
Point3d Structure
Point3d Overload
Rhino.Geometry Namespace