RhinoCommon SDK
Arc.Reverse Method
Rhino for Mac 5.1
 Reverses the orientation of the arc. Changes the domain from [a,b] to [-b,-a].
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Reverse()
Public Sub Reverse
See Also
Reference
Arc Structure
Rhino.Geometry Namespace