RhinoCommon SDK
Surface.Reverse Method (Int32, Boolean)
Rhino for Mac 5.1
 Same as Reverse, but if inPlace is set to true this Surface is modified instead of a new copy being created.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Surface Reverse(
	int direction,
	bool inPlace
)
Public Function Reverse (
	direction As Integer,
	inPlace As Boolean
) As Surface
Parameters
direction
Type: System.Int32
 0 for first parameter's domain, 1 for second parameter's domain.
inPlace
Type: System.Boolean
[Missing <param name="inPlace"/> documentation for "M:Rhino.Geometry.Surface.Reverse(System.Int32,System.Boolean)"]
Return Value
Type: Surface
 If inPlace is False, a new reversed surface on success. If inPlace is true, this surface instance is returned on success.
See Also
Reference
Surface Class
Reverse Overload
Rhino.Geometry Namespace