RhinoCommon SDK
Unroller Constructor (Brep)
Rhino for Mac 5.1
 Initializes a new instance of the Unroller class with a brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Unroller(
	Brep brep
)
Public Sub New (
	brep As Brep
)
Parameters
brep
Type: Rhino.Geometry.Brep
A brep to be unrolled.
See Also
Reference
Unroller Class
Unroller Overload
Rhino.Geometry Namespace