RhinoCommon SDK
LightObject Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.LightObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.LightObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class LightObject : RhinoObject
Public Class LightObject
	Inherits RhinoObject
The LightObject type exposes the following members.
Properties
Name | Description
LightGeometry
Top
Methods
Name | Description
DuplicateLightGeometry
Top
See Also
Reference
Rhino.DocObjects Namespace