RhinoCommon SDK
BrepFaceList.GetEnumerator Method
Rhino for Mac 5.1
 Gets an enumerators that yields BrepFace objects.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<BrepFace> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of BrepFace)
Return Value
Type: IEnumerator<BrepFace>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace