RhinoCommon SDK
CustomDisplay Class
Rhino for Mac 5.1
 Provides some basic (indeed, very basic) mechanisms for drawing custom geometry in viewports.
Inheritance Hierarchy
System.Object
 Rhino.Display.CustomDisplay
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class CustomDisplay : IDisposable
Public Class CustomDisplay
	Implements IDisposable
The CustomDisplay type exposes the following members.
Constructors
Name | Description
CustomDisplay
 Constructs a new CustomDisplay instance. You must call Dispose() when you are done with this instance, otherwise the display methods will never be switched off.
Top
Properties
Name | Description
ClippingBox
 Gets the clipping box of this CustomDisplay.
Enabled
 Gets or sets the Enabled state of this CustomDisplay instance. If you wish to terminate this CustomDisplay, place a call to Dispose() instead.
IsDisposed
 Gets a value indicating whether this CustomDisplay instance has been disposed. Once a CustomDisplay has been disposed, you can no longer use it.
Top
Methods
Name | Description
AddArc(Arc)
 Adds a new, black arc to the display list.
AddArc(Arc, Color)
 Adds a new, colored arc to the display list.
AddArc(Arc, Color, Int32)
 Adds a new, colored arc to the display list.
AddCircle(Circle)
 Adds a new, black circle to the display list.
AddCircle(Circle, Color)
 Adds a new, colored arc to the display list.
AddCircle(Circle, Color, Int32)
 Adds a new, colored circle to the display list.
AddCurve(Curve)
 Adds a new, black curve to the display list. The curve will be duplicated so changes to the original will not affect the display.
AddCurve(Curve, Color)
 Adds a new, colored curve to the display list. The curve will be duplicated so changes to the original will not affect the display.
AddCurve(Curve, Color, Int32)
 Adds a new, colored curve to the display list. The curve will be duplicated so changes to the original will not affect the display.
AddLine(Line)
 Adds a new, black line to the display list.
AddLine(Line, Color)
 Adds a new, colored line to the display list.
AddLine(Line, Color, Int32)
 Adds a new, colored line to the display list.
AddPoint(Point3d)
 Adds a new, black point to the display list.
AddPoint(Point3d, Color)
 Adds a new colored point to the display list.
AddPoint(Point3d, Color, PointStyle, Int32)
 Adds a new stylized point to the display list.
AddPoints(IEnumerable<Point3d>)
 Adds a collection of black points to the display list.
AddPoints(IEnumerable<Point3d>, Color)
 Adds a collection of colored points to the display list.
AddPoints(IEnumerable<Point3d>, Color, PointStyle, Int32)
 Adds a collection of stylized points to the display list.
AddPolygon
 Adds a polygon to the drawing list. Polygons are not like Hatches, when you supply a concave polygon, the shading probably won't work.
AddText(Text3d, Color)
 Adds a new 3D text object to the display list.
AddText(String, Plane, Double)
 Adds a new, black 3D text object to the display list.
AddText(String, Plane, Double, Color)
 Adds a new, colored 3D text object to the display list.
AddVector(Point3d, Vector3d)
 Adds a new, black vector to the display list.
AddVector(Point3d, Vector3d, Color)
 Adds a new, colored vector to the display list.
AddVector(Point3d, Vector3d, Color, Boolean)
 Adds a new, colored vector to the display list.
Clear
 Clear the drawing lists.
Dispose
 Dispose this CustomDisplay instance. You must call this function in order to properly shut down the CustomDisplay.
Top
See Also
Reference
Rhino.Display Namespace