RhinoCommon SDK
ReplayHistoryResult.UpdateToCurve Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToCurve(
	Curve curve,
	ObjectAttributes attributes
)
Public Function UpdateToCurve (
	curve As Curve,
	attributes As ObjectAttributes
) As Boolean
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace