RhinoCommon SDK
MeshFaceList.GetFaceVertices Method
Rhino for Mac 5.1
 Gets the 3D location of the vertices forming a face.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetFaceVertices(
	int faceIndex,
	out Point3f a,
	out Point3f b,
	out Point3f c,
	out Point3f d
)
Public Function GetFaceVertices (
	faceIndex As Integer,
	<OutAttribute> ByRef a As Point3f,
	<OutAttribute> ByRef b As Point3f,
	<OutAttribute> ByRef c As Point3f,
	<OutAttribute> ByRef d As Point3f
) As Boolean
Parameters
faceIndex
Type: System.Int32
A face index.
a
Type: Rhino.Geometry.Point3f
A first point. This out argument is assigned during the call.
b
Type: Rhino.Geometry.Point3f
A second point. This out argument is assigned during the call.
c
Type: Rhino.Geometry.Point3f
A third point. This out argument is assigned during the call.
d
Type: Rhino.Geometry.Point3f
A fourth point. This out argument is assigned during the call.
Return Value
Type: Boolean
true if the operation succeeded, otherwise false.
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace