RhinoCommon SDK
Matrix.Zero Method
Rhino for Mac 5.1
 Sets all values inside the matrix to zero.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Zero()
Public Sub Zero
See Also
Reference
Matrix Class
Rhino.Geometry Namespace