RhinoCommon SDK
GripObject Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.GripObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.GripObject
 Rhino.DocObjects.Custom.CustomGripObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class GripObject : RhinoObject
Public Class GripObject
	Inherits RhinoObject
The GripObject type exposes the following members.
Properties
Name | Description
CurrentLocation
Index
Moved
 true if the grip has moved from OriginalLocation.
OriginalLocation
OwnerId
Weight
 The weight of a NURBS control point grip or RhinoMath.UnsetValue if the grip is not a NURBS control point grip.
Top
Methods
Name | Description
GetCageParameters
 Retrieves the 2d parameter space values of this GripObject from the cage it's associated with.
GetCurveParameters
 Retrieves the 2d parameter space values of this GripObject from the curve it's associated with.
GetGripDirections
 Sometimes grips have directions. These directions can have any length and do not have to be orthoganal.
GetSurfaceParameters
 Retrieves the 2d parameter space values of this GripObject from the surface it's associated with.
Move(Point3d)
 Moves the grip to a new location.
Move(Transform)
 Moves the grip to a new location.
Move(Vector3d)
 Moves the grip to a new location.
NeighborGrip
 Used to get a grip's logical neighbors, like NURBS curve, suface, and cage control point grips.
UndoMove
 Undoes any grip moves made by calling Move.
Top
See Also
Reference
Rhino.DocObjects Namespace