RhinoCommon SDK
DisplayMaterial.SetBumpTexture Method
Rhino for Mac 5.1
Overload List
Name | Description
SetBumpTexture(String, Boolean)
SetBumpTexture(Texture, Boolean)
Top
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace