RhinoCommon SDK
MaterialRefCreateParams.FrontFaceMaterialId Property
Rhino for Mac 5.1
 The Id of the Material used to render the front of an object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid FrontFaceMaterialId { get; set; }
Public Property FrontFaceMaterialId As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace