RhinoCommon SDK
MeshClash.Search Method (IEnumerable<Mesh>, IEnumerable<Mesh>, Double, Int32)
Rhino for Mac 5.1
 Searches for locations where the distance from a mesh in one set of meshes is less than distance to another mesh in a second set of meshes.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static MeshClash[] Search(
	IEnumerable<Mesh> setA,
	IEnumerable<Mesh> setB,
	double distance,
	int maxEventCount
)
Public Shared Function Search (
	setA As IEnumerable(Of Mesh),
	setB As IEnumerable(Of Mesh),
	distance As Double,
	maxEventCount As Integer
) As MeshClash()
Parameters
setA
Type: System.Collections.Generic.IEnumerable<Mesh>
The first set of meshes.
setB
Type: System.Collections.Generic.IEnumerable<Mesh>
The second set of meshes.
distance
Type: System.Double
The largest distance at which there is a clash. All values smaller than this cause a clash as well.
maxEventCount
Type: System.Int32
The maximum number of clash objects.
Return Value
Type: MeshClash[]
An array of clash objects.
See Also
Reference
MeshClash Class
Search Overload
Rhino.Geometry.Intersect Namespace