RhinoCommon SDK
MeshClash.Search Method (Mesh, IEnumerable<Mesh>, Double, Int32)
Rhino for Mac 5.1
 Searches the locations where the distance from the first mesh to a mesh in the second set of meshes is less than the provided value.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static MeshClash[] Search(
	Mesh meshA,
	IEnumerable<Mesh> setB,
	double distance,
	int maxEventCount
)
Public Shared Function Search (
	meshA As Mesh,
	setB As IEnumerable(Of Mesh),
	distance As Double,
	maxEventCount As Integer
) As MeshClash()
Parameters
meshA
Type: Rhino.Geometry.Mesh
The first mesh.
setB
Type: System.Collections.Generic.IEnumerable<Mesh>
The second set of meshes.
distance
Type: System.Double
The largest distance at which there is a clash. All values smaller than this cause a clash as well.
maxEventCount
Type: System.Int32
The maximum number of clash objects.
Return Value
Type: MeshClash[]
An array of clash objects.
See Also
Reference
MeshClash Class
Search Overload
Rhino.Geometry.Intersect Namespace