RhinoCommon SDK
DisplayBitmapDrawList.BoundingBox Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayBitmapDrawList.BoundingBox"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace