RhinoCommon SDK
NurbsCurvePointList.MakeNonRational Method
Rhino for Mac 5.1
 Sets all the control points to 1.0.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MakeNonRational()
Public Function MakeNonRational As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace