RhinoCommon SDK
Point3d.ToString Method
Rhino for Mac 5.1
 Constructs the string representation for the current point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
The point representation in the form X,Y,Z.
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace