RhinoCommon SDK
ObjectTable.Select Method
Rhino for Mac 5.1
Overload List
Name | Description
Select(IEnumerable<Guid>)
 Selects a collection of objects.
Select(Guid)
 Select a single object.
Select(ObjRef)
 Select a single object.
Select(IEnumerable<ObjRef>)
 Selects a collection of objects.
Select(IEnumerable<Guid>, Boolean)
 Selects or deselects a collection of objects.
Select(Guid, Boolean)
 Select or deselects a single object.
Select(ObjRef, Boolean)
 Select or deselects a single object.
Select(IEnumerable<ObjRef>, Boolean)
 Selects or deselects a collection of objects.
Select(Guid, Boolean, Boolean)
 Select or deselects a single object.
Select(ObjRef, Boolean, Boolean)
 Select or deselects a single object.
Select(Guid, Boolean, Boolean, Boolean)
 Select or deselects a single object.
Select(ObjRef, Boolean, Boolean, Boolean)
 Select or deselects a single object.
Select(Guid, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Select or deselects a single object.
Select(ObjRef, Boolean, Boolean, Boolean, Boolean, Boolean, Boolean)
 Select or deselects a single object.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace