RhinoCommon SDK
Box.ToBrep Method
Rhino for Mac 5.1
 Constructs a brep representation of this box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep ToBrep()
Public Function ToBrep As Brep
Return Value
Type: Brep
A Brep representation of this box or null.
See Also
Reference
Box Structure
Rhino.Geometry Namespace