RhinoCommon SDK
Quaternion.GetRotation Method (Plane)
Rhino for Mac 5.1
 Returns the frame created by applying the quaternion's rotation to the canonical world frame (1,0,0),(0,1,0),(0,0,1).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetRotation(
	out Plane plane
)
Public Function GetRotation (
	<OutAttribute> ByRef plane As Plane
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
A plane. This out value will be assigned during this call.
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
See Also
Reference
Quaternion Structure
GetRotation Overload
Rhino.Geometry Namespace