RhinoCommon SDK
Point2d.GreaterThanOrEqual Operator
Rhino for Mac 5.1
 Determines whether the first specified Point2d comes after (has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator >=(
	Point2d a,
	Point2d b
)
Public Shared Operator >= (
	a As Point2d,
	b As Point2d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point2d
First point.
b
Type: Rhino.Geometry.Point2d
Second point.
Return Value
Type: Boolean
true if a.X is larger than b.X, or a.X == b.X and a.Y >= b.Y; otherwise, false.
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace