RhinoCommon SDK
Layer.GetChildren Method
Rhino for Mac 5.1
 Gets immediate children of this layer. Note that child layers may have their own children.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Layer[] GetChildren()
Public Function GetChildren As Layer()
Return Value
Type: Layer[]
Array of child layers. null if this layer does not have any children.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace