RhinoCommon SDK
Curve.ToPolyline Method
Rhino for Mac 5.1
Overload List
Name | Description
ToPolyline(Int32, Int32, Double, Double, Double, Double, Double, Double, Boolean)
 Gets a polyline approximation of a curve.
ToPolyline(Int32, Int32, Double, Double, Double, Double, Double, Double, Boolean, Interval)
 Gets a polyline approximation of a curve.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace