RhinoCommon SDK
BrepTrim.TrimIndex Property
Rhino for Mac 5.1
 Gets the index of this trim in the Brep.Trims collection.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int TrimIndex { get; }
Public ReadOnly Property TrimIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace