RhinoCommon SDK
InstanceObject.Explode Method
Rhino for Mac 5.1
 Explodes the instance reference into pieces.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Explode(
	bool explodeNestedInstances,
	out RhinoObject[] pieces,
	out ObjectAttributes[] pieceAttributes,
	out Transform[] pieceTransforms
)
Public Sub Explode (
	explodeNestedInstances As Boolean,
	<OutAttribute> ByRef pieces As RhinoObject(),
	<OutAttribute> ByRef pieceAttributes As ObjectAttributes(),
	<OutAttribute> ByRef pieceTransforms As Transform()
)
Parameters
explodeNestedInstances
Type: System.Boolean
 If true, then nested instance references are recursively exploded into pieces until actual geometry is found. If false, an InstanceObject is added to the pieces out parameter when this InstanceObject has nested references.
pieces
Type: Rhino.DocObjects.RhinoObject[]
An array of Rhino objects will be assigned to this out parameter during this call.
pieceAttributes
Type: Rhino.DocObjects.ObjectAttributes[]
An array of object attributes will be assigned to this out parameter during this call.
pieceTransforms
Type: Rhino.Geometry.Transform[]
An array of the previously applied transform matrices will be assigned to this out parameter during this call.
See Also
Reference
InstanceObject Class
Rhino.DocObjects Namespace