RhinoCommon SDK
File3dmObjectTable.FindByLayer Method
Rhino for Mac 5.1
 Finds all File3dmObject that are in a given layer.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public File3dmObject[] FindByLayer(
	string layer
)
Public Function FindByLayer (
	layer As String
) As File3dmObject()
Parameters
layer
Type: System.String
Layer to search.
Return Value
Type: File3dmObject[]
 Array of objects that belong to the specified group or null if no objects could be found.
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace