RhinoCommon SDK
Arc.ClosestPoint Method
Rhino for Mac 5.1
 Computes the point on an arc that is closest to a test point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d ClosestPoint(
	Point3d testPoint
)
Public Function ClosestPoint (
	testPoint As Point3d
) As Point3d
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point to get close to.
Return Value
Type: Point3d
 The point on the arc that is closest to testPoint. If testPoint is the center of the arc, then the starting point of the arc is returned. UnsetPoint on failure.
See Also
Reference
Arc Structure
Rhino.Geometry Namespace