RhinoCommon SDK
ReplayHistoryData Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.ReplayHistoryData"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.ReplayHistoryData
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class ReplayHistoryData : IDisposable
Public Class ReplayHistoryData
	Implements IDisposable
The ReplayHistoryData type exposes the following members.
Properties
Name | Description
Document
The document this record belongs to
HistoryVersion
 ReplayHistory overrides check the version number to insure the information saved in the history record is compatible with the current implementation of ReplayHistory
RecordId
 Each history record has a unique id that Rhino assigns when it adds the history record to the history record table
Results
Top
Methods
Name | Description
Dispose
Releases all resources used by the ReplayHistoryData
GetRhinoObjRef
 In ReplayHistory, use GetRhinoObjRef to convert the information in a history record into the ObjRef that has up to date RhinoObject pointers
TryGetBool
TryGetColor
TryGetDouble
TryGetGuid
TryGetInt
TryGetPoint3d
TryGetString
TryGetTransform
TryGetVector3d
Top
See Also
Reference
Rhino.DocObjects Namespace