RhinoCommon SDK
Rectangle3d Methods
Rhino for Mac 5.1
The Rectangle3d type exposes the following members.
Methods
Name | Description
ClosestPoint(Point3d)
 Gets the point on the rectangle that is closest to a test-point.
ClosestPoint(Point3d, Boolean)
 Gets the point on the rectangle that is closest to a test-point.
Contains(Point3d)
 Determines if a point is included in this rectangle.
Contains(Double, Double)
 Determines if two plane parameters are included in this rectangle.
Corner
 Gets the corner at the given index.
CreateFromPolyline(IEnumerable<Point3d>)
 Attempts to create a rectangle from a polyline. In order for the polyline to qualify as a rectangle, it must have 4 or 5 corner points (i.e. it need not be closed).
CreateFromPolyline(IEnumerable<Point3d>, Double, Double)
 Attempts to create a Rectangle from a Polyline. In order for a polyline to qualify as a rectangle, it must have 4 or 5 corner points (i.e. it need not be closed).
This overload also returns deviations.
EpsilonEquals
 Check that all values in other are within epsilon of the values in this
MakeIncreasing
 Ensures the X and Y dimensions are increasing or singleton intervals.
PointAt(Double)
 Gets a point along the rectangle boundary.
PointAt(Double, Double)
 Gets a point in Rectangle space.
RecenterPlane(Int32)
 Recenters the base plane on one of the corners.
RecenterPlane(Point3d)
 Recenters the base plane on a new origin.
ToNurbsCurve
 Constructs a nurbs curve representation of this rectangle.
ToPolyline
 Constructs a polyline from this rectangle.
Transform
 Transforms this rectangle. Note that rectangles cannot be skewed or tapered.
Top
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace