RhinoCommon SDK
ObjectAttributes.PlotColorSource Property
Rhino for Mac 5.1
 The color used to plot an object on paper is specified in one of three ways. If PlotColorSource is ON::plot_color_from_layer, then the object's layer ON_Layer::PlotColor() is used. If PlotColorSource is ON::plot_color_from_object, then value of PlotColor() is used.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectPlotColorSource PlotColorSource { get; set; }
Public Property PlotColorSource As ObjectPlotColorSource
	Get
	Set
Property Value
Type: ObjectPlotColorSource
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace