RhinoCommon SDK
GumballFrame.ScaleMode Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballFrame.ScaleMode"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GumballScaleMode ScaleMode { get; set; }
Public Property ScaleMode As GumballScaleMode
	Get
	Set
Property Value
Type: GumballScaleMode
See Also
Reference
GumballFrame Structure
Rhino.UI.Gumball Namespace