RhinoCommon SDK
StatusBar Class
Rhino for Mac 5.1
 Contains static methods to control the application status bar.
Inheritance Hierarchy
System.Object
 Rhino.UI.StatusBar
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static class StatusBar
Public NotInheritable Class StatusBar
The StatusBar type exposes the following members.
Methods
Name | Description
ClearMessagePane
 Removes the message from the message pane.
HideProgressMeter
 Ends, or hides, Rhino's status bar progress meter.
SetDistancePane
 Sets the distance pane to a distance value.
SetMessagePane
 Sets the message pane to a message.
SetPointPane
 Sets the point pane to a point value.
ShowProgressMeter
 Starts, or shows, Rhino's status bar progress meter.
UpdateProgressMeter
 Sets the current position of Rhino's status bar progress meter.
Top
See Also
Reference
Rhino.UI Namespace