RhinoCommon SDK
NamedViewTable.RestoreAnimated Method (Int32, RhinoViewport, Boolean)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimated(System.Int32,Rhino.Display.RhinoViewport,System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool RestoreAnimated(
	int index,
	RhinoViewport viewport,
	bool backgroundBitmap
)
Public Function RestoreAnimated (
	index As Integer,
	viewport As RhinoViewport,
	backgroundBitmap As Boolean
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimated(System.Int32,Rhino.Display.RhinoViewport,System.Boolean)"]
viewport
Type: Rhino.Display.RhinoViewport
[Missing <param name="viewport"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimated(System.Int32,Rhino.Display.RhinoViewport,System.Boolean)"]
backgroundBitmap
Type: System.Boolean
[Missing <param name="backgroundBitmap"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimated(System.Int32,Rhino.Display.RhinoViewport,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimated(System.Int32,Rhino.Display.RhinoViewport,System.Boolean)"]
See Also
Reference
NamedViewTable Class
RestoreAnimated Overload
Rhino.DocObjects.Tables Namespace