RhinoCommon SDK
GetPoint.EnableCurveSnapPerpBar Method
Rhino for Mac 5.1
 Controls display of the curve snap perpendicular bar icon.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableCurveSnapPerpBar(
	bool drawPerpBarAtSnapPoint,
	bool drawEndPoints
)
Public Sub EnableCurveSnapPerpBar (
	drawPerpBarAtSnapPoint As Boolean,
	drawEndPoints As Boolean
)
Parameters
drawPerpBarAtSnapPoint
Type: System.Boolean
 true to draw a tangent bar icon whenever GetPoint snaps to a curve.
drawEndPoints
Type: System.Boolean
 true to draw points at the end of the tangent bar.
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace