RhinoCommon SDK
Point3d.Subtraction Operator
Rhino for Mac 5.1
Overload List
Name | Description
Subtraction(Point3d, Point3d)
 Subtracts a point from another point.
Subtraction(Point3d, Vector3d)
 Subtracts a vector from a point.
Top
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace