RhinoCommon SDK
GroupTable.GroupMembers Method
Rhino for Mac 5.1
 Gets an array of all of the objects in a group.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject[] GroupMembers(
	int groupIndex
)
Public Function GroupMembers (
	groupIndex As Integer
) As RhinoObject()
Parameters
groupIndex
Type: System.Int32
The index of the group in this table.
Return Value
Type: RhinoObject[]
An array with all the objects in the specified group.
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace