RhinoCommon SDK
CustomGripObject.Index Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Custom.CustomGripObject.Index"]
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Index { get; set; }
Public Property Index As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
CustomGripObject Class
Rhino.DocObjects.Custom Namespace