RhinoCommon SDK
CustomCurveObject.SetCurve Method
Rhino for Mac 5.1
 Only for developers who are defining custom subclasses of CurveObject. Directly sets the internal curve geometry for this object. Note that this function does not work with Rhino's "undo".
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected Curve SetCurve(
	Curve curve
)
Protected Function SetCurve (
	curve As Curve
) As Curve
Parameters
curve
Type: Rhino.Geometry.Curve
[Missing <param name="curve"/> documentation for "M:Rhino.DocObjects.Custom.CustomCurveObject.SetCurve(Rhino.Geometry.Curve)"]
Return Value
Type: Curve
 The old curve geometry that was set for this object
Remarks
 Note that this function does not work with Rhino's "undo". The typical approach for adjusting the curve geometry is to modify the object that you get when you call the CurveGeometry property and then call CommitChanges.
See Also
Reference
CustomCurveObject Class
Rhino.DocObjects.Custom Namespace