RhinoCommon SDK
CommandEventArgs.CommandLocalName Property
Rhino for Mac 5.1
 Gets the name of the command that raised this event in the local language.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string CommandLocalName { get; }
Public ReadOnly Property CommandLocalName As String
	Get
Property Value
Type: String
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace