RhinoCommon SDK
OptionToggle Constructor (Boolean, LocalizeStringPair, LocalizeStringPair)
Rhino for Mac 5.1
Initializes a new instance of the OptionToggle class
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public OptionToggle(
	bool initialValue,
	LocalizeStringPair offValue,
	LocalizeStringPair onValue
)
Public Sub New (
	initialValue As Boolean,
	offValue As LocalizeStringPair,
	onValue As LocalizeStringPair
)
Parameters
initialValue
Type: System.Boolean
[Missing <param name="initialValue"/> documentation for "M:Rhino.Input.Custom.OptionToggle.#ctor(System.Boolean,Rhino.UI.LocalizeStringPair,Rhino.UI.LocalizeStringPair)"]
offValue
Type: Rhino.UI.LocalizeStringPair
[Missing <param name="offValue"/> documentation for "M:Rhino.Input.Custom.OptionToggle.#ctor(System.Boolean,Rhino.UI.LocalizeStringPair,Rhino.UI.LocalizeStringPair)"]
onValue
Type: Rhino.UI.LocalizeStringPair
[Missing <param name="onValue"/> documentation for "M:Rhino.Input.Custom.OptionToggle.#ctor(System.Boolean,Rhino.UI.LocalizeStringPair,Rhino.UI.LocalizeStringPair)"]
See Also
Reference
OptionToggle Class
OptionToggle Overload
Rhino.Input.Custom Namespace