RhinoCommon SDK
Curve.MakeClosed Method
Rhino for Mac 5.1
 If IsClosed, just return true. Otherwise, decide if curve can be closed as follows: Linear curves polylinear curves with 2 segments, Nurbs with 3 or less control points cannot be made closed. Also, if tolerance > 0 and the gap between start and end is larger than tolerance, curve cannot be made closed. Adjust the curve's endpoint to match its start point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MakeClosed(
	double tolerance
)
Public Function MakeClosed (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
 If nonzero, and the gap is more than tolerance, curve cannot be made closed.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Curve Class
Rhino.Geometry Namespace