RhinoCommon SDK
CustomUndoEventArgs.CreatedByRedo Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Commands.CustomUndoEventArgs.CreatedByRedo"]
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool CreatedByRedo { get; }
Public ReadOnly Property CreatedByRedo As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
CustomUndoEventArgs Class
Rhino.Commands Namespace