RhinoCommon SDK
Point4d.Inequality Operator
Rhino for Mac 5.1
 Determines whether two Point4d have different values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator !=(
	Point4d a,
	Point4d b
)
Public Shared Operator <> (
	a As Point4d,
	b As Point4d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point4d
The first point.
b
Type: Rhino.Geometry.Point4d
The second point.
Return Value
Type: Boolean
true if the two points differ in any coordinate; false otherwise.
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace