RhinoCommon SDK
Command Methods
Rhino for Mac 5.1
The Command type exposes the following members.
Methods
Name | Description
DisplayHelp
 Displays help for a command.
GetCommandNames
 Gets list of command names in Rhino. This list does not include Test, Alpha, or System commands.
GetCommandStack
 Determines if Rhino is currently running a command. Because Rhino allow for transparent commands (commands that can be run from inside of other commands), this method returns the total ids of active commands.
GetMostRecentCommands
 Gets an array of most recent command descriptions.
InCommand
 Determines if Rhino is currently running a command.
InScriptRunnerCommand
 This is a low level tool to determine if Rhino is currently running a script running command like "ReadCommandFile" or the RhinoScript plug-in's "RunScript".
IsCommand
 Determines is a string is a command.
IsValidCommandName
 Determines if a string is a valid command name.
LookupCommandId
 Returns the ID of a command.
LookupCommandName
 Returns the command name given a command ID.
OnHelp
 Is called when the user needs assistance with this command.
ReplayHistory
 Repeats an operation of a command.
RunCommand
 Executes the command.
Top
See Also
Reference
Command Class
Rhino.Commands Namespace