RhinoCommon SDK
RhinoObject.Highlight Method
Rhino for Mac 5.1
 Modifies the highlighting of the object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Highlight(
	bool enable
)
Public Function Highlight (
	enable As Boolean
) As Boolean
Parameters
enable
Type: System.Boolean
true if highlighting should be enabled.
Return Value
Type: Boolean
true if the object is now highlighted.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace