RhinoCommon SDK
Rectangle3d.EpsilonEquals Method
Rhino for Mac 5.1
 Check that all values in other are within epsilon of the values in this
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool EpsilonEquals(
	Rectangle3d other,
	double epsilon
)
Public Function EpsilonEquals (
	other As Rectangle3d,
	epsilon As Double
) As Boolean
Parameters
other
Type: Rhino.Geometry.Rectangle3d
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.Rectangle3d.EpsilonEquals(Rhino.Geometry.Rectangle3d,System.Double)"]
epsilon
Type: System.Double
[Missing <param name="epsilon"/> documentation for "M:Rhino.Geometry.Rectangle3d.EpsilonEquals(Rhino.Geometry.Rectangle3d,System.Double)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Rectangle3d.EpsilonEquals(Rhino.Geometry.Rectangle3d,System.Double)"]
Implements
IEpsilonComparable<T>.EpsilonEquals(T, Double)
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace