RhinoCommon SDK
RhinoGet.GetLinearDimension Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetLinearDimension(Rhino.Geometry.LinearDimension@)"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetLinearDimension(
	out LinearDimension dimension
)
Public Shared Function GetLinearDimension (
	<OutAttribute> ByRef dimension As LinearDimension
) As Result
Parameters
dimension
Type: Rhino.Geometry.LinearDimension
[Missing <param name="dimension"/> documentation for "M:Rhino.Input.RhinoGet.GetLinearDimension(Rhino.Geometry.LinearDimension@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetLinearDimension(Rhino.Geometry.LinearDimension@)"]
Examples
using System;
partial class Examples
{
  public static Rhino.Commands.Result AddLinearDimension(Rhino.RhinoDoc doc)
  {
    Rhino.Geometry.LinearDimension dimension;
    Rhino.Commands.Result rc = Rhino.Input.RhinoGet.GetLinearDimension(out dimension);
    if (rc == Rhino.Commands.Result.Success && dimension != null)
    {
      if (doc.Objects.AddLinearDimension(dimension) == Guid.Empty)
        rc = Rhino.Commands.Result.Failure;
      else
        doc.Views.Redraw();
    }
    return rc;
  }
}
Partial Class Examples
  Public Shared Function AddLinearDimension(ByVal doc As Rhino.RhinoDoc) As Rhino.Commands.Result
    Dim dimension As Rhino.Geometry.LinearDimension = Nothing
    Dim rc As Rhino.Commands.Result = Rhino.Input.RhinoGet.GetLinearDimension(dimension)
    If rc = Rhino.Commands.Result.Success AndAlso dimension IsNot Nothing Then
      If doc.Objects.AddLinearDimension(dimension) = Guid.Empty Then
        rc = Rhino.Commands.Result.Failure
      Else
        doc.Views.Redraw()
      End If
    End If
    Return rc
  End Function
End Class
import Rhino
import scriptcontext
import System.Guid
def AddLinearDimension():
    rc, dimension = Rhino.Input.RhinoGet.GetLinearDimension()
    if rc==Rhino.Commands.Result.Success:
        if scriptcontext.doc.Objects.AddLinearDimension(dimension)==System.Guid.Empty:
            rc = Rhino.Commands.Result.Failure
        else:
            scriptcontext.doc.Views.Redraw()
    return rc
if __name__=="__main__":
    AddLinearDimension()
See Also
Reference
RhinoGet Class
Rhino.Input Namespace