RhinoCommon SDK
File3dm.IsValid Method (String)
Rhino for Mac 5.1
 Checks a model to make sure it is valid.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsValid(
	out string errors
)
Public Function IsValid (
	<OutAttribute> ByRef errors As String
) As Boolean
Parameters
errors
Type: System.String
 if errors are found, a description of the problem is put in this variable.
Return Value
Type: Boolean
true if the model is valid.
See Also
Reference
File3dm Class
IsValid Overload
Rhino.FileIO Namespace