RhinoCommon SDK
MeshTopologyVertexList.IsHidden Method
Rhino for Mac 5.1
 Returns true if the topological vertex is hidden. The mesh topology vertex is hidden if and only if all the ON_Mesh vertices it represents is hidden.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsHidden(
	int topologyVertexIndex
)
Public Function IsHidden (
	topologyVertexIndex As Integer
) As Boolean
Parameters
topologyVertexIndex
Type: System.Int32
index of a topology vertex in Mesh.TopologyVertices.
Return Value
Type: Boolean
true if mesh topology vertex is hidden.
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace