RhinoCommon SDK
DisplayPipeline.PopClipTesting Method
Rhino for Mac 5.1
 Pop a ClipTesting flag off the engine's stack.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PopClipTesting()
Public Sub PopClipTesting
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace