RhinoCommon SDK
NurbsCurve.Order Property
Rhino for Mac 5.1
 Gets the order of the curve. Order = Degree + 1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Order { get; }
Public ReadOnly Property Order As Integer
	Get
Property Value
Type: Int32
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace