RhinoCommon SDK
BrepFaceList.ShrinkFaces Method
Rhino for Mac 5.1
 Shrinks all the faces in this Brep. Sometimes the surfaces extend far beyond the trimming boundaries of the Brep Face. This function will remove those portions of the surfaces that are not used.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ShrinkFaces()
Public Function ShrinkFaces As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace