RhinoCommon SDK
RhinoObjectSelectionEventArgs Properties
Rhino for Mac 5.1
The RhinoObjectSelectionEventArgs type exposes the following members.
Properties
Name | Description
Document
RhinoObjects
Selected
 Returns true if objects are being selected. Returns false if objects are being deseleced.
Top
See Also
Reference
RhinoObjectSelectionEventArgs Class
Rhino.DocObjects Namespace