RhinoCommon SDK
ArchivableDictionary.Set Method (String, Ray3d)
Rhino for Mac 5.1
 Sets a Ray3d.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Set(
	string key,
	Ray3d val
)
Public Function Set (
	key As String,
	val As Ray3d
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: Rhino.Geometry.Ray3d
A value for that key.
Because Ray3d has value semantics and is immutable, no changes to this object are possible.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Ray3d)"]
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace