RhinoCommon SDK
ArchivableDictionary.Set Method (String, Point4d)
Rhino for Mac 5.1
 Sets a Point4d.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Set(
	string key,
	Point4d val
)
Public Function Set (
	key As String,
	val As Point4d
) As Boolean
Parameters
key
Type: System.String
A text key.
val
Type: Rhino.Geometry.Point4d
A value for that key.
Because Point4d has value semantics, changes to the assigning value will leave this entry unchanged.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,Rhino.Geometry.Point4d)"]
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace