RhinoCommon SDK
ObjectTable.Find Method
Rhino for Mac 5.1
Overload List
Name | Description
Find(Guid)
 Uses the object guid to find a rhino object. Deleted objects cannot be found by id. The guid is the value that is stored on RhinoObject.Id In a single document, no two active objects have the same guid. If an object is replaced with a new object, then the guid persists. For example, if the _Move command moves an object, then the moved object inherits it's guid from the starting object. If the Copy command copies an object, then the copy gets a new guid. This guid persists through file saving/openning operations. This function will not find grip objects.
Find(UInt32)
 Use the object runtime serial number to find a rhino object in the document. This is the value stored on RhinoObject.RuntimeObjectSerialNumber. The RhinoObject constructor sets the runtime serial number and every instance of a RhinoObject class will have a unique serial number for the duration of the Rhino application. If an object is replaced with a new object, then the new object will have a different runtime serial number. Deleted objects stored in the undo list maintain their runtime serial numbers and this funtion will return pointers to these objects. Call RhinoObject.IsDeleted if you need to determine if the returned object is active or deleted. The runtime serial number is not saved in files.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace