RhinoCommon SDK
Curve.OffsetOnSurface Method (Surface, Double[], Double[], Double)
Rhino for Mac 5.1
 Offset this curve on a surface. This curve must lie on the surface.
This overload allows to specify different offsets for different curve parameters.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] OffsetOnSurface(
	Surface surface,
	double[] curveParameters,
	double[] offsetDistances,
	double fittingTolerance
)
Public Function OffsetOnSurface (
	surface As Surface,
	curveParameters As Double(),
	offsetDistances As Double(),
	fittingTolerance As Double
) As Curve()
Parameters
surface
Type: Rhino.Geometry.Surface
A surface on which to offset.
curveParameters
Type: System.Double[]
Curve parameters corresponding to the offset distances.
offsetDistances
Type: System.Double[]
Distances to offset (+)left, (-)right.
fittingTolerance
Type: System.Double
A fitting tolerance.
Return Value
Type: Curve[]
Offset curves on success, or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | If surface, curveParameters or offsetDistances are null.
See Also
Reference
Curve Class
OffsetOnSurface Overload
Rhino.Geometry Namespace