RhinoCommon SDK
ObjRef.Point Method
Rhino for Mac 5.1
 Gets the point if the referenced geometry is one.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point Point()
Public Function Point As Point
Return Value
Type: Point
A point; or null if the referenced object is not a point, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace