RhinoCommon SDK
Arc.EndPoint Property
Rhino for Mac 5.1
 Gets the end point of the arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d EndPoint { get; }
Public ReadOnly Property EndPoint As Point3d
	Get
Property Value
Type: Point3d
See Also
Reference
Arc Structure
Rhino.Geometry Namespace