RhinoCommon SDK
Interval.IsSingleton Property
Rhino for Mac 5.1
 Returns true if T0 == T1 != ON.UnsetValue.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsSingleton { get; }
Public ReadOnly Property IsSingleton As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Interval Structure
Rhino.Geometry Namespace