RhinoCommon SDK
GumballObject.Frame Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballObject.Frame"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GumballFrame Frame { get; set; }
Public Property Frame As GumballFrame
	Get
	Set
Property Value
Type: GumballFrame
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace