RhinoCommon SDK
PointCloud.GetPoints Method
Rhino for Mac 5.1
 Copy all the point coordinates in this point cloud to an array.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d[] GetPoints()
Public Function GetPoints As Point3d()
Return Value
Type: Point3d[]
An array containing all the points in this point cloud.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace