RhinoCommon SDK
Point3d.Interpolate Method
Rhino for Mac 5.1
 Interpolate between two points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Interpolate(
	Point3d pA,
	Point3d pB,
	double t
)
Public Sub Interpolate (
	pA As Point3d,
	pB As Point3d,
	t As Double
)
Parameters
pA
Type: Rhino.Geometry.Point3d
First point.
pB
Type: Rhino.Geometry.Point3d
Second point.
t
Type: System.Double
Interpolation parameter. If t=0 then this point is set to pA. If t=1 then this point is set to pB. Values of t in between 0.0 and 1.0 result in points between pA and pB.
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace