RhinoCommon SDK
ViewportInfo.FrustumWidth Property
Rhino for Mac 5.1
 Gets the frustum width. This is FrustumRight - FrustumLeft.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double FrustumWidth { get; }
Public ReadOnly Property FrustumWidth As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace