RhinoCommon SDK
RhinoObject.GripsOn Property
Rhino for Mac 5.1
Gets or sets the activation state of object default editing grips.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GripsOn { get; set; }
Public Property GripsOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace