RhinoCommon SDK
ViewportInfo.CameraY Property
Rhino for Mac 5.1
 Gets the unit "up" vector.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Vector3d CameraY { get; }
Public ReadOnly Property CameraY As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace