RhinoCommon SDK
SelCommand Constructor
Rhino for Mac 5.1
Initializes a new instance of the SelCommand class
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected SelCommand()
Protected Sub New
See Also
Reference
SelCommand Class
Rhino.Commands Namespace