RhinoCommon API
Command.BeginCommand Event
 Called just before command.RunCommand().
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<CommandEventArgs> BeginCommand
Public Shared Event BeginCommand As EventHandler(Of CommandEventArgs)
Value
Type: System.EventHandler<CommandEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Command Class
Rhino.Commands Namespace