RhinoCommon API
RhinoDoc.DeselectObjects Event
 Called when object(s) are deselected.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RhinoObjectSelectionEventArgs> DeselectObjects
Public Shared Event DeselectObjects As EventHandler(Of RhinoObjectSelectionEventArgs)
Value
Type: System.EventHandler<RhinoObjectSelectionEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace