RhinoCommon API
RhinoView.Modified Event
[Missing <summary> documentation for "E:Rhino.Display.RhinoView.Modified"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<ViewEventArgs> Modified
Public Shared Event Modified As EventHandler(Of ViewEventArgs)
Value
Type: System.EventHandler<ViewEventArgs>
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoView Class
Rhino.Display Namespace