RhinoCommon API
RhinoDoc.InstanceDefinitionTableEvent Event
 Called when any modification happens to a document's light table.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<InstanceDefinitionTableEventArgs> InstanceDefinitionTableEvent
Public Shared Event InstanceDefinitionTableEvent As EventHandler(Of InstanceDefinitionTableEventArgs)
Value
Type: System.EventHandler<InstanceDefinitionTableEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace