RhinoCommon API
RenderContent.ContentChanged Event
 Used to monitor render content modifications.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RenderContentChangedEventArgs> ContentChanged
Public Shared Event ContentChanged As EventHandler(Of RenderContentChangedEventArgs)
Value
Type: System.EventHandler<RenderContentChangedEventArgs>
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderContent Class
Rhino.Render Namespace