RhinoCommon API
CustomEvent.OnCustomEvent Event
 This event is raised when a Custom Event is triggered in rdk.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static event EventHandler<RenderCustomEventArgs> OnCustomEvent
Public Shared Event OnCustomEvent As EventHandler(Of RenderCustomEventArgs)
Value
Type: System.EventHandler<RenderCustomEventArgs>
See Also
Reference
CustomEvent Class
Rhino.Render Namespace