RhinoCommon API
RhinoDoc.DeleteRhinoObject Event
 Called if an object is deleted. At some later point the object can be un-deleted.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RhinoObjectEventArgs> DeleteRhinoObject
Public Shared Event DeleteRhinoObject As EventHandler(Of RhinoObjectEventArgs)
Value
Type: System.EventHandler<RhinoObjectEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace