RhinoCommon API
RhinoApp.RdkPlugInUnloading Event
 Monitors when RDK client plug-ins are unloaded.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler RdkPlugInUnloading
Public Shared Event RdkPlugInUnloading As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoApp Class
Rhino Namespace