RhinoCommon API
RhinoDoc.CloseDocument Event
[Missing <summary> documentation for "E:Rhino.RhinoDoc.CloseDocument"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<DocumentEventArgs> CloseDocument
Public Shared Event CloseDocument As EventHandler(Of DocumentEventArgs)
Value
Type: System.EventHandler<DocumentEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace