RhinoCommon API
RenderContent.ContentDeleting Event
 Used to monitor render content deletion from the document.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RenderContentEventArgs> ContentDeleting
Public Shared Event ContentDeleting As EventHandler(Of RenderContentEventArgs)
Value
Type: System.EventHandler<RenderContentEventArgs>
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderContent Class
Rhino.Render Namespace