RhinoCommon API
RealtimeDisplayMode.HudProductNamePressed Event
 Listen tot his event if you want to handle a press on the product name component
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public event EventHandler HudProductNamePressed
Public Event HudProductNamePressed As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace