RhinoCommon API
RhinoApp.Initialized Event
 Is raised when the apllication is fully initialized.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler Initialized
Public Shared Event Initialized As EventHandler
Value
Type: System.EventHandler
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoApp Class
Rhino Namespace