RhinoCommon API
RenderContent.ContentRenamed Event
 Used to monitor render content renaming in the document.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RenderContentEventArgs> ContentRenamed
Public Shared Event ContentRenamed As EventHandler(Of RenderContentEventArgs)
Value
Type: System.EventHandler<RenderContentEventArgs>
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderContent Class
Rhino.Render Namespace