RhinoCommon API
RhinoDoc.AddRhinoObject Event
Called if a new object is added to the document.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event EventHandler<RhinoObjectEventArgs> AddRhinoObject
Public Shared Event AddRhinoObject As EventHandler(Of RhinoObjectEventArgs)
Value
Type: System.EventHandler<RhinoObjectEventArgs>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace