RhinoCommon API
RealtimeDisplayMode.HudStatusTextPressed Event
 Listen tot his event if you want to handle a press on the status text component
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public event EventHandler HudStatusTextPressed
Public Event HudStatusTextPressed As EventHandler
Value
Type: System.EventHandler
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace