RhinoCommon API
HostUtils.OnExceptionReport Event
 Is raised when an exception is reported with one of the ExceptionReport(Exception) method.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static event HostUtils.ExceptionReportDelegate OnExceptionReport
Public Shared Event OnExceptionReport As HostUtils.ExceptionReportDelegate
Value
Type: Rhino.Runtime.HostUtils.ExceptionReportDelegate
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace