RhinoCommon SDK
GetObject.InactiveDetailPickEnabled Property
Rhino for Mac 5.1
 By default, objects in inactive details are not permitted to be picked. In a few rare cases this is used (ex. picking circles during DimRadius)
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool InactiveDetailPickEnabled { get; set; }
Public Property InactiveDetailPickEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetObject Class
Rhino.Input.Custom Namespace