RhinoCommon SDK
SweepOneRail.PerformSweepRebuild Method (Curve, Curve, Double, Int32)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Int32)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] PerformSweepRebuild(
	Curve rail,
	Curve crossSection,
	double crossSectionParameter,
	int rebuildCount
)
Public Function PerformSweepRebuild (
	rail As Curve,
	crossSection As Curve,
	crossSectionParameter As Double,
	rebuildCount As Integer
) As Brep()
Parameters
rail
Type: Rhino.Geometry.Curve
[Missing <param name="rail"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Int32)"]
crossSection
Type: Rhino.Geometry.Curve
[Missing <param name="crossSection"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Int32)"]
crossSectionParameter
Type: System.Double
[Missing <param name="crossSectionParameter"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Int32)"]
rebuildCount
Type: System.Int32
[Missing <param name="rebuildCount"/> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Int32)"]
Return Value
Type: Brep[]
[Missing <returns> documentation for "M:Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Int32)"]
See Also
Reference
SweepOneRail Class
PerformSweepRebuild Overload
Rhino.Geometry Namespace