RhinoCommon SDK
Curve.DivideByCount Method (Int32, Boolean)
Rhino for Mac 5.1
 Divide the curve into a number of equal-length segments.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double[] DivideByCount(
	int segmentCount,
	bool includeEnds
)
Public Function DivideByCount (
	segmentCount As Integer,
	includeEnds As Boolean
) As Double()
Parameters
segmentCount
Type: System.Int32
Segment count. Note that the number of division points may differ from the segment count.
includeEnds
Type: System.Boolean
If true, then the points at the start and end of the curve are included.
Return Value
Type: Double[]
 List of curve parameters at the division points on success, null on failure.
See Also
Reference
Curve Class
DivideByCount Overload
Rhino.Geometry Namespace