RhinoCommon SDK
ObjectPropertiesPage Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.ObjectPropertiesPage"]
Inheritance Hierarchy
System.Object
 Rhino.UI.ObjectPropertiesPage
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class ObjectPropertiesPage
Public MustInherit Class ObjectPropertiesPage
The ObjectPropertiesPage type exposes the following members.
Constructors
Name | Description
ObjectPropertiesPage
Initializes a new instance of the ObjectPropertiesPage class
Top
Properties
Name | Description
EnglishPageTitle
Icon
LocalPageTitle
PageControl
 Return the control that represents this page. This will typically be a custom user control.
SelectedObjects
 Return a list of Rhino objects to be processed by this object properties page
Top
Methods
Name | Description
InitializeControls
OnActivate
Called when this page is activated/deactivated.
OnCreateParent
OnHelp
OnSizeParent
ShouldDisplay
Top
See Also
Reference
Rhino.UI Namespace