RhinoCommon SDK
GetBaseClass.AddOption Method
Rhino for Mac 5.1
Overload List
Name | Description
AddOption(String)
 Adds a command line option.
AddOption(LocalizeStringPair)
 Adds a command line option.
AddOption(String, String)
 Adds a command line option.
AddOption(LocalizeStringPair, LocalizeStringPair)
 Adds a command line option.
Top
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace