RhinoCommon SDK
RhinoDeselectAllObjectsEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.RhinoDeselectAllObjectsEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoDeselectAllObjectsEventArgs
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class RhinoDeselectAllObjectsEventArgs : EventArgs
Public Class RhinoDeselectAllObjectsEventArgs
	Inherits EventArgs
The RhinoDeselectAllObjectsEventArgs type exposes the following members.
Properties
Name | Description
Document
ObjectCount
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace