RhinoCommon SDK
DistanceDisplayMode Enumeration
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.UI.DistanceDisplayMode"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum DistanceDisplayMode
Public Enumeration DistanceDisplayMode
Members
Member name | Value | Description
Decimal | 0
Fractional | 1
FeetInches | 2
See Also
Reference
Rhino.UI Namespace