RhinoCommon SDK
Quaternion Constructor
Rhino for Mac 5.1
 Initializes a new quaternion with the provided coefficients.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Quaternion(
	double a,
	double b,
	double c,
	double d
)
Public Sub New (
	a As Double,
	b As Double,
	c As Double,
	d As Double
)
Parameters
a
Type: System.Double
A number. This is the real part.
b
Type: System.Double
Another number. This is the first coefficient of the imaginary part.
c
Type: System.Double
Another number. This is the second coefficient of the imaginary part.
d
Type: System.Double
Another number. This is the third coefficient of the imaginary part.
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace