RhinoCommon SDK
ColorCMYK Constructor
Rhino for Mac 5.1
Overload List
Name | Description
ColorCMYK(Color)
 Initializes a new instance of ColorCMYK that is equivalent to an RGB color.
ColorCMYK(Double, Double, Double)
 Initializes a new instance of ColorCMYK with custom channel values. The cyan, magenta and yellow values will be adjusted based on their combined darkness.
ColorCMYK(Double, Double, Double, Double)
 Initializes a new instance of ColorCMYK with custom channel values.
ColorCMYK(Double, Double, Double, Double, Double)
 Initializes a new instance of ColorCMYK with custom channel values.
Top
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace