RhinoCommon SDK
Curve.SetStartPoint Method
Rhino for Mac 5.1
Forces the curve to start at a specified point. Not all curve types support this operation.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetStartPoint(
	Point3d point
)
Public Function SetStartPoint (
	point As Point3d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
New start point of curve.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
Some start points cannot be moved. Be sure to check return code.
See Also
Reference
Curve Class
Rhino.Geometry Namespace