RhinoCommon SDK
CurveOrientation Enumeration
Rhino for Mac 5.1
 Defines enumerated values for closed curve orientations.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum CurveOrientation
Public Enumeration CurveOrientation
Members
Member name | Value | Description
Undefined | 0 |  Orientation is undefined.
Clockwise | -1 |  The curve's orientation is clockwise in the xy plane.
CounterClockwise | 1 |  The curve's orientation is counter clockwise in the xy plane.
See Also
Reference
Rhino.Geometry Namespace