RhinoCommon SDK
DetailView Class
Rhino for Mac 5.1
 Represents a view of the model placed on a page layout.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.DetailView
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class DetailView : GeometryBase
<SerializableAttribute>
Public Class DetailView
	Inherits GeometryBase
The DetailView type exposes the following members.
Constructors
Name | Description
DetailView
 Protected serialization constructor for internal use.
Top
Properties
Name | Description
IsParallelProjection
 Gets or sets whether the view is parallel.
IsPerspectiveProjection
 Gets or sets whether the view is perspective.
IsProjectionLocked
 Gets or sets whether the view projection is locked.
PageToModelRatio
 Gets the page units/model units quotient.
Top
Methods
Name | Description
SetScale
 Sets the detail viewport's projection so geometry is displayed at a certain scale.
Top
See Also
Reference
Rhino.Geometry Namespace