RhinoCommon SDK
Polyline Constructor
Rhino for Mac 5.1
 Initializes a new empty polyline.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Polyline()
Public Sub New
See Also
Reference
Polyline Class
Polyline Overload
Rhino.Geometry Namespace