RhinoCommon SDK
ClassArrayOnObjRef.Add Method
Rhino for Mac 5.1
 Adds an ObjRef to the list.
Namespace: Rhino.Runtime.InteropWrappers
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Add(
	ObjRef objref
)
Public Sub Add (
	objref As ObjRef
)
Parameters
objref
Type: Rhino.DocObjects.ObjRef
An ObjRef to add.
See Also
Reference
ClassArrayOnObjRef Class
Rhino.Runtime.InteropWrappers Namespace