RhinoCommon SDK
Brep.GetArea Method (Double, Double)
Rhino for Mac 5.1
 Compute the Area of the Brep. If you want proper Area data with moments and error information, use the AreaMassProperties class.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double GetArea(
	double relativeTolerance,
	double absoluteTolerance
)
Public Function GetArea (
	relativeTolerance As Double,
	absoluteTolerance As Double
) As Double
Parameters
relativeTolerance
Type: System.Double
Relative tolerance to use for area calculation.
absoluteTolerance
Type: System.Double
Absolute tolerance to use for area calculation.
Return Value
Type: Double
The area of the Brep.
See Also
Reference
Brep Class
GetArea Overload
Rhino.Geometry Namespace