RhinoCommon SDK
PickContext Class
Rhino for Mac 5.1
 Provides storage for picking operations.
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.PickContext
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class PickContext : IDisposable
Public Class PickContext
	Implements IDisposable
The PickContext type exposes the following members.
Constructors
Name | Description
PickContext
Initializes a new instance of the PickContext class
Top
Properties
Name | Description
GetObjectUsed
PickGroupsEnabled
 Thue if GroupObjects should be added to the pick list
PickLine
 pick chord starts on near clipping plane and ends on far clipping plane.
PickMode
PickStyle
SubObjectSelectionEnabled
 True if the user had activated subobject selection
View
 This view can be a model view or a page view. When view is a page view, then you need to distingish between the viewports MainViewport() and ActiveViewport(). When m_view is a model view, both MainViewport() and ActiveViewport() return the world view's viewport.
Top
Methods
Name | Description
Dispose()
Releases all resources used by the PickContext
Dispose(Boolean)
Releases the unmanaged resources used by the PickContext and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
PickFrustumTest(BoundingBox, Boolean)
 Fast test to check if a bounding box intersects a pick frustum.
PickFrustumTest(Point3d, Double, Double)
Utility for picking 3d point
PickFrustumTest(BezierCurve, Double, Double, Double)
PickFrustumTest(Line, Double, Double, Double)
PickFrustumTest(NurbsCurve, Double, Double, Double)
PickFrustumTest(Point3d[], Int32, Double, Double)
PickFrustumTest(PointCloud, Int32, Double, Double)
PickFrustumTest(Mesh, PickContext.MeshPickStyle, Point3d, Double, Double, PickContext.MeshHitFlag, Int32)
Utility for picking meshes
PickFrustumTest(Mesh, PickContext.MeshPickStyle, Point3d, Point2d, Point2d, Double, Double, PickContext.MeshHitFlag, Int32)
Utility for picking meshes
PickMeshTopologyVertices
 Utility for picking mesh vertices
SetPickTransform
UpdateClippingPlanes
 Updates the clipping plane information in pick region. The SetClippingPlanes and View fields must be called before calling UpdateClippingPlanes().
Top
See Also
Reference
Rhino.Input.Custom Namespace