RhinoCommon SDK
Brep.MergeCoplanarFaces Method
Rhino for Mac 5.1
 Merges adjacent coplanar faces into single faces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MergeCoplanarFaces(
	double tolerance
)
Public Function MergeCoplanarFaces (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
3d tolerance for determining when edges are adjacent.
Return Value
Type: Boolean
true if faces were merged. false if no faces were merged.
See Also
Reference
Brep Class
Rhino.Geometry Namespace