RhinoCommon SDK
BinaryArchiveWriter.WriteDictionary Method
Rhino for Mac 5.1
 Delivers the complete content of a dictionary to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteDictionary(
	ArchivableDictionary dictionary
)
Public Sub WriteDictionary (
	dictionary As ArchivableDictionary
)
Parameters
dictionary
Type: Rhino.Collections.ArchivableDictionary
A dictionary to archive.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace