RhinoCommon SDK
Rectangle3d.X Property
Rhino for Mac 5.1
 Gets or sets the dimensions of the rectangle along the base plane X-Axis (i.e. the width).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Interval X { get; set; }
Public Property X As Interval
	Get
	Set
Property Value
Type: Interval
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace