RhinoCommon SDK
PlaneSurface Class
Rhino for Mac 5.1
 Represents a plane surface, with plane and two intervals.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.Surface
 Rhino.Geometry.PlaneSurface
 Rhino.Geometry.ClippingPlaneSurface
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class PlaneSurface : Surface
<SerializableAttribute>
Public Class PlaneSurface
	Inherits Surface
The PlaneSurface type exposes the following members.
Constructors
Name | Description
PlaneSurface(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
PlaneSurface(Plane, Interval, Interval)
 Initializes a plane surface with x and y intervals.
Top
Properties
Name | Description
Top
Methods
Name | Description
CreateThroughBox(Plane, BoundingBox)
 Extends a plane into a plane surface so that the latter goes through a bounding box.
CreateThroughBox(Line, Vector3d, BoundingBox)
 Makes a plane that includes a line and a vector and goes through a bounding box.
Top
See Also
Reference
Rhino.Geometry Namespace