RhinoCommon SDK
Brep.DuplicateEdgeCurves Method
Rhino for Mac 5.1
Overload List
Name | Description
DuplicateEdgeCurves()
 Duplicate all the edges of this Brep.
DuplicateEdgeCurves(Boolean)
 Duplicate edges of this Brep.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace