RhinoCommon SDK
Vector2d.LessThan Operator
Rhino for Mac 5.1
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator <(
	Vector2d a,
	Vector2d b
)
Public Shared Operator < (
	a As Vector2d,
	b As Vector2d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector2d
First vector.
b
Type: Rhino.Geometry.Vector2d
Second vector.
Return Value
Type: Boolean
true if a.X is smaller than b.X, or a.X == b.X and a.Y is smaller than b.Y; otherwise, false.
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace