RhinoCommon SDK
OptionDouble Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Input.Custom.OptionDouble"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.OptionDouble
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class OptionDouble : IDisposable
Public Class OptionDouble
	Implements IDisposable
The OptionDouble type exposes the following members.
Constructors
Name | Description
OptionDouble(Double)
Initializes a new instance of the OptionDouble class
OptionDouble(Double, Boolean, Double)
 Initializes a new instance of the double option class.
OptionDouble(Double, Double, Double)
 Initializes a new instance of the OptionDouble class with lower and upper limits.
Top
Properties
Name | Description
CurrentValue
InitialValue
Top
Methods
Name | Description
Dispose()
Releases all resources used by the OptionDouble
Dispose(Boolean)
Releases the unmanaged resources used by the OptionDouble and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Input.Custom Namespace