RhinoCommon SDK
PlugIn.DocumentPropertiesDialogPages Method
Rhino for Mac 5.1
 Override this function if you want to extend the document properties sections of the options dialog. This function is called whenever the user brings up the Options dialog.
Namespace: Rhino.PlugIns
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void DocumentPropertiesDialogPages(
	RhinoDoc doc,
	List<OptionsDialogPage> pages
)
Protected Overridable Sub DocumentPropertiesDialogPages (
	doc As RhinoDoc,
	pages As List(Of OptionsDialogPage)
)
Parameters
doc
Type: Rhino.RhinoDoc
document that the pages are set up for
pages
Type: System.Collections.Generic.List<OptionsDialogPage>
list of pages to add your custom options dialog page(s) to.
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace