RhinoCommon SDK
GumballObject Constructor
Rhino for Mac 5.1
Initializes a new instance of the GumballObject class
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GumballObject()
Public Sub New
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace