RhinoCommon SDK
ViewportInfo.FrustumFar Property
Rhino for Mac 5.1
 Gets the frustum far-cutting value.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double FrustumFar { get; }
Public ReadOnly Property FrustumFar As Double
	Get
Property Value
Type: Double
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace