RhinoCommon SDK
ReplayHistoryResult.UpdateToCircle Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToCircle(Rhino.Geometry.Circle,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToCircle(
	Circle circle,
	ObjectAttributes attributes
)
Public Function UpdateToCircle (
	circle As Circle,
	attributes As ObjectAttributes
) As Boolean
Parameters
circle
Type: Rhino.Geometry.Circle
[Missing <param name="circle"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToCircle(Rhino.Geometry.Circle,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToCircle(Rhino.Geometry.Circle,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToCircle(Rhino.Geometry.Circle,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace