RhinoCommon SDK
DisplayPipeline.DrawLineArrow Method
Rhino for Mac 5.1
 Draws an arrow made up of three line segments.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawLineArrow(
	Line line,
	Color color,
	int thickness,
	double size
)
Public Sub DrawLineArrow (
	line As Line,
	color As Color,
	thickness As Integer,
	size As Double
)
Parameters
line
Type: Rhino.Geometry.Line
Base line for arrow.
color
Type: System.Drawing.Color
Color of arrow.
thickness
Type: System.Int32
Thickness (in pixels) of the arrow line segments.
size
Type: System.Double
Size (in world units) of the arrow tip lines.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace