RhinoCommon SDK
Layer.GetPersistentLocking Method
Rhino for Mac 5.1
 The persistent locking setting is used for layers that can be locked by a "parent" object. A common case is when a layer is a child layer (Layer.ParentI is not nil). In this case, when a parent layer is locked, then child layers are also locked. The persistent locking setting determines what happens when the parent is unlocked again.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetPersistentLocking()
Public Function GetPersistentLocking As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Layer.GetPersistentLocking"]
See Also
Reference
Layer Class
Rhino.DocObjects Namespace