RhinoCommon SDK
VisualAnalysisMode.DrawNurbsSurface Method
Rhino for Mac 5.1
 Draws a NURBS surface. This is a good function to override to display object-related meshes.
The default implementation does nothing.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void DrawNurbsSurface(
	RhinoObject obj,
	NurbsSurface surface,
	DisplayPipeline pipeline
)
Protected Overridable Sub DrawNurbsSurface (
	obj As RhinoObject,
	surface As NurbsSurface,
	pipeline As DisplayPipeline
)
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
A Rhino object corresponding to the surface.
surface
Type: Rhino.Geometry.NurbsSurface
The surface geometry.
pipeline
Type: Rhino.Display.DisplayPipeline
The current display pipeline.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace