RhinoCommon SDK
BrepTrim.IsoStatus Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Geometry.BrepTrim.IsoStatus"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IsoStatus IsoStatus { get; set; }
Public Property IsoStatus As IsoStatus
	Get
	Set
Property Value
Type: IsoStatus
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace