RhinoCommon SDK
ClassArrayObjRef.Count Property
Rhino for Mac 5.1
 Gets the number of CRhinoObjRef instances in this array.
Namespace: Rhino.Runtime.InteropWrappers
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ClassArrayObjRef Class
Rhino.Runtime.InteropWrappers Namespace