RhinoCommon SDK
CommandEventArgs.CommandResult Property
Rhino for Mac 5.1
 Gets the result of the command that raised this event. This value is only meaningful during EndCommand events.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Result CommandResult { get; }
Public ReadOnly Property CommandResult As Result
	Get
Property Value
Type: Result
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace