RhinoCommon SDK
StackedDialogPage Properties
Rhino for Mac 5.1
The StackedDialogPage type exposes the following members.
Properties
Name | Description
Children
EnglishPageTitle
HasChildren
LocalPageTitle
PageControl
 Return the control that represents this page. Currently only classes derived from System.Windows.Forms.Control are allowed
PageImage
 Opitionally override to provide a image to display in the Mac Rhino UI
ShowDefaultsButton
Called when this page is activated.
Top
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace