RhinoCommon SDK
Vector3f.LessThan Operator
Rhino for Mac 5.1
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector.
Components evaluation priority is first X, then Y, then Z.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator <(
	Vector3f a,
	Vector3f b
)
Public Shared Operator < (
	a As Vector3f,
	b As Vector3f
) As Boolean
Parameters
a
Type: Rhino.Geometry.Vector3f
The first vector.
b
Type: Rhino.Geometry.Vector3f
The second vector.
Return Value
Type: Boolean
true if a.X is smaller than b.X, or a.X == b.X and a.Y is smaller than b.Y, or a.X == b.X and a.Y == b.Y and a.Z is smaller than b.Z; otherwise, false.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace