RhinoCommon SDK
Intersection.MeshPolyline Method
Rhino for Mac 5.1
 Finds the intersection of a mesh and a polyline.
Namespace: Rhino.Geometry.Intersect
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3d[] MeshPolyline(
	Mesh mesh,
	PolylineCurve curve,
	out int[] faceIds
)
Public Shared Function MeshPolyline (
	mesh As Mesh,
	curve As PolylineCurve,
	<OutAttribute> ByRef faceIds As Integer()
) As Point3d()
Parameters
mesh
Type: Rhino.Geometry.Mesh
A mesh to intersect.
curve
Type: Rhino.Geometry.PolylineCurve
A polyline curves to intersect.
faceIds
Type: System.Int32[]
The indices of the intersecting faces. This out reference is assigned during the call.
Return Value
Type: Point3d[]
An array of points: one for each face that was passed by the faceIds out reference.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace