RhinoCommon SDK
SurfaceCurvature Class
Rhino for Mac 5.1
 Maintains computed information for surface curvature evaluation.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SurfaceCurvature
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class SurfaceCurvature
Public Class SurfaceCurvature
The SurfaceCurvature type exposes the following members.
Properties
Name | Description
Gaussian
 Gets the Gaussian curvature value at UV.
Mean
 Gets the Mean curvature value at UV.
Normal
 Gets the surface normal at UV.
Point
 Gets the surface point at UV.
UVPoint
 Gets the UV location where the curvature was computed.
Top
Methods
Name | Description
Direction
 Gets the principal curvature direction vector.
Kappa
 Gets the Kappa curvature value.
OsculatingCircle
 Computes the osculating circle along the given direction.
Top
See Also
Reference
Rhino.Geometry Namespace