RhinoCommon SDK
NamedViewTable.Add Method
Rhino for Mac 5.1
Overload List
Name | Description
Add(ViewInfo)
Add(String, Guid)
 Adds named view to document which is based on an existing viewport.
Top
See Also
Reference
NamedViewTable Class
Rhino.DocObjects.Tables Namespace