RhinoCommon SDK
Interval.Unset Property
Rhino for Mac 5.1
 Gets an Interval whose limits are RhinoMath.UnsetValue.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Interval Unset { get; }
Public Shared ReadOnly Property Unset As Interval
	Get
Property Value
Type: Interval
See Also
Reference
Interval Structure
Rhino.Geometry Namespace