RhinoCommon SDK
MeshTextureCoordinateList.SetTextureCoordinate Method (Int32, Double, Double)
Rhino for Mac 5.1
 Sets or adds a texture coordinate to the Texture Coordinate List.
If [index] is less than [Count], the existing coordinate at [index] will be modified.
If [index] equals [Count], a new coordinate is appended to the end of the coordinate list.
If [index] is larger than [Count], the function will return false.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetTextureCoordinate(
	int index,
	double s,
	double t
)
Public Function SetTextureCoordinate (
	index As Integer,
	s As Double,
	t As Double
) As Boolean
Parameters
index
Type: System.Int32
Index of texture coordinate to set.
s
Type: System.Double
S component of texture coordinate.
t
Type: System.Double
T component of texture coordinate.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshTextureCoordinateList Class
SetTextureCoordinate Overload
Rhino.Geometry.Collections Namespace