RhinoCommon SDK
DisplayPipelineAttributes Class
Rhino for Mac 5.1
 Represents display pipeline settings, such as "show transparency" and "show grips".
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayPipelineAttributes
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class DisplayPipelineAttributes : IDisposable,
	ISerializable
<SerializableAttribute>
Public Class DisplayPipelineAttributes
	Implements IDisposable, ISerializable
The DisplayPipelineAttributes type exposes the following members.
Constructors
Name | Description
DisplayPipelineAttributes
Initializes a new instance of the DisplayPipelineAttributes class
Top
Properties
Name | Description
CurveColor
Color used for drawing curves
CurveThickness
Pixel thickness for curves
DisableConduits
DisableTransparency
EnglishName
Id
IgnoreHighlights
LocalName
LockedObjectsDrawBehindOthers
Locked object are drawn behind other objects
MeshSpecificAttributes
ObjectColor
ShadingEnabled
Draw shaded meshes and surfaces
ShowCurves
Draw curves
ShowGrips
ViewSpecificAttributes
XrayAllObjects
Top
Methods
Name | Description
Dispose()
Releases all resources used by the DisplayPipelineAttributes
Dispose(Boolean)
Releases the unmanaged resources used by the DisplayPipelineAttributes and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
GetObjectData
Top
See Also
Reference
Rhino.Display Namespace