RhinoCommon SDK
CustomPointObject Methods
Rhino for Mac 5.1
The CustomPointObject type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
CustomPointObject Class
Rhino.DocObjects.Custom Namespace