RhinoCommon SDK
Cone Constructor
Rhino for Mac 5.1
 Initializes a new cone with a specified base plane, height and radius.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Cone(
	Plane plane,
	double height,
	double radius
)
Public Sub New (
	plane As Plane,
	height As Double,
	radius As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
Base plane of cone.
height
Type: System.Double
Height of cone.
radius
Type: System.Double
Radius of cone.
See Also
Reference
Cone Structure
Rhino.Geometry Namespace