RhinoCommon SDK
OptionDouble Properties
Rhino for Mac 5.1
The OptionDouble type exposes the following members.
Properties
Name | Description
CurrentValue
InitialValue
Top
See Also
Reference
OptionDouble Class
Rhino.Input.Custom Namespace