RhinoCommon SDK
Light.PowerWatts Property
Rhino for Mac 5.1
 Gets or sets the light power in watts (W).
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double PowerWatts { get; set; }
Public Property PowerWatts As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Light Class
Rhino.Geometry Namespace