RhinoCommon SDK
BrepFace.Split Method
Rhino for Mac 5.1
Overload List
Name | Description
Split(IEnumerable<Curve>, Double)
 Split this face using 3D trimming curves.
Top
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace