RhinoCommon SDK
Brep.CullUnusedSurfaces Method
Rhino for Mac 5.1
Culls surfaces not referenced by a face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool CullUnusedSurfaces()
Public Function CullUnusedSurfaces As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
See Also
Reference
Brep Class
Rhino.Geometry Namespace