RhinoCommon SDK
GumballPickResult Methods
Rhino for Mac 5.1
The GumballPickResult type exposes the following members.
Methods
Name | Description
SetToDefault
Top
See Also
Reference
GumballPickResult Class
Rhino.UI.Gumball Namespace