RhinoCommon SDK
ReplayHistoryResult.UpdateToSurface Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSurface(Rhino.Geometry.Surface,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToSurface(
	Surface surface,
	ObjectAttributes attributes
)
Public Function UpdateToSurface (
	surface As Surface,
	attributes As ObjectAttributes
) As Boolean
Parameters
surface
Type: Rhino.Geometry.Surface
[Missing <param name="surface"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSurface(Rhino.Geometry.Surface,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSurface(Rhino.Geometry.Surface,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSurface(Rhino.Geometry.Surface,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace