RhinoCommon SDK
RhinoTransformObjectsEventArgs.ObjectCount Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoTransformObjectsEventArgs.ObjectCount"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ObjectCount { get; }
Public ReadOnly Property ObjectCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace