RhinoCommon SDK
GetBaseClass.Rectangle2d Method
Rhino for Mac 5.1
 Returns the location in the view of the 2d rectangle selected in GetPoint::Get2dRectangle(). rect.left < rect.right and rect.top < rect.bottom (0,0) = upper left corner of window.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Rectangle Rectangle2d()
Public Function Rectangle2d As Rectangle
Return Value
Type: Rectangle
The rectangle.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace