RhinoCommon SDK
MaterialRef.BackFaceMaterialIndex Property
Rhino for Mac 5.1
 The index of the material used to render the back of an object
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int BackFaceMaterialIndex { get; }
Public ReadOnly Property BackFaceMaterialIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace