RhinoCommon SDK
ObjectColorSource Enumeration
Rhino for Mac 5.1
 Defines enumerated values for the source of display color of single objects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum ObjectColorSource
Public Enumeration ObjectColorSource
Members
Member name | Value | Description
ColorFromLayer | 0 | use color assigned to layer.
ColorFromObject | 1 | use color assigned to object.
ColorFromMaterial | 2 | use diffuse render material color.
ColorFromParent | 3 |  for objects with parents (like objects in instance references, use parent linetype) if no parent, treat as color_from_layer.
See Also
Reference
Rhino.DocObjects Namespace