RhinoCommon SDK
NamedViewTable.Delete Method (Int32)
Rhino for Mac 5.1
Remove named view from the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Delete(
	int index
)
Public Function Delete (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
index of the named view in the named view table.
Return Value
Type: Boolean
true if successful.
See Also
Reference
NamedViewTable Class
Delete Overload
Rhino.DocObjects.Tables Namespace