RhinoCommon SDK
Intersection.CurveSurface Method
Rhino for Mac 5.1
Overload List
Name | Description
CurveSurface(Curve, Surface, Double, Double)
 Intersects a curve and a surface.
CurveSurface(Curve, Interval, Surface, Double, Double)
 Intersects a (sub)curve and a surface.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace