RhinoCommon SDK
Curve.CreateControlPointCurve Method
Rhino for Mac 5.1
Overload List
Name | Description
CreateControlPointCurve(IEnumerable<Point3d>)
 Constructs a control-point of degree=3 (or less).
CreateControlPointCurve(IEnumerable<Point3d>, Int32)
 Constructs a curve from a set of control-point locations.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace