RhinoCommon SDK
StackedDialogPage.ShowDefaultsButton Property
Rhino for Mac 5.1
Called when this page is activated.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual bool ShowDefaultsButton { get; }
Public Overridable ReadOnly Property ShowDefaultsButton As Boolean
	Get
Return Value
Type: Boolean
 true : if the page wants the "Defaults" button to appear. false : if the page does not want the "Defaults" button to appear. Default returns false Note: returning false implies that OnDefaults() method will never get called.
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace