RhinoCommon SDK
DisplayPipeline.DrawPointCloud Method
Rhino for Mac 5.1
Overload List
Name | Description
DrawPointCloud(PointCloud, Int32)
 Draws a point cloud.
DrawPointCloud(PointCloud, Int32, Color)
 Draws a point cloud.
Top
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace