RhinoCommon SDK
CullObjectEventArgs.CullObject Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.CullObjectEventArgs.CullObject"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool CullObject { get; set; }
Public Property CullObject As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CullObjectEventArgs Class
Rhino.Display Namespace