RhinoCommon SDK
Line.MaximumDistanceTo Method
Rhino for Mac 5.1
Overload List
Name | Description
MaximumDistanceTo(Line)
 Finds the largest distance between this line as a finite segment and another finite segment.
MaximumDistanceTo(Point3d)
 Finds the largest distance between this line as a finite segment and a test point.
Top
See Also
Reference
Line Structure
Rhino.Geometry Namespace