RhinoCommon SDK
GumballAppearanceSettings.ColorMenuButton Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballAppearanceSettings.ColorMenuButton"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color ColorMenuButton { get; set; }
Public Property ColorMenuButton As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace