RhinoCommon SDK
Linetype.IsReference Property
Rhino for Mac 5.1
 Gets a value indicting whether this linetype is a referenced linetype. Referenced linetypes are part of referenced documents.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsReference { get; }
Public ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace