RhinoCommon SDK
Vector3f.CompareTo Method
Rhino for Mac 5.1
 Compares this Vector3f with another Vector3f.
Component evaluation priority is first X, then Y, then Z.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int CompareTo(
	Vector3f other
)
Public Function CompareTo (
	other As Vector3f
) As Integer
Parameters
other
Type: Rhino.Geometry.Vector3f
The other Vector3f to use in comparison.
Return Value
Type: Int32
 0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
-1: if this.X == other.X and this.Y == other.Y and this.Z < other.Z
+1: otherwise.
Implements
IComparable<T>.CompareTo(T)
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace