RhinoCommon SDK
TextDot.FontHeight Property
Rhino for Mac 5.1
 Height of font used for displaying the dot
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int FontHeight { get; set; }
Public Property FontHeight As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
TextDot Class
Rhino.Geometry Namespace