RhinoCommon SDK
Linetype.SegmentCount Property
Rhino for Mac 5.1
Number of segments in the pattern.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int SegmentCount { get; }
Public ReadOnly Property SegmentCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace