RhinoCommon SDK
ObjectTable.ObjectCount Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.ObjectCount(Rhino.DocObjects.ObjectEnumeratorSettings)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ObjectCount(
	ObjectEnumeratorSettings filter
)
Public Function ObjectCount (
	filter As ObjectEnumeratorSettings
) As Integer
Parameters
filter
Type: Rhino.DocObjects.ObjectEnumeratorSettings
[Missing <param name="filter"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.ObjectCount(Rhino.DocObjects.ObjectEnumeratorSettings)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.ObjectCount(Rhino.DocObjects.ObjectEnumeratorSettings)"]
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace