RhinoCommon SDK
GetBaseClass.SetDefaultInteger Method
Rhino for Mac 5.1
 Sets a number as default value that will be returned if the user presses ENTER key during the get.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetDefaultInteger(
	int defaultValue
)
Public Sub SetDefaultInteger (
	defaultValue As Integer
)
Parameters
defaultValue
Type: System.Int32
value for default number.
Remarks
 Calling SetDefaultInteger will automatically handle setting the command prompt default and reacting to the user pressing ENTER. If the user presses ENTER to accept the default integer, GetResult.Number is returned and CRhinoGet.GotDefault() will return true. Calling SetDefaultNumber will clear any previous calls to SetDefaultString or SetDefaultPoint.
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace