RhinoCommon SDK
LayerTable.FindNext Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int FindNext(
	int index,
	string layerName,
	bool ignoreDeletedLayers
)
Public Function FindNext (
	index As Integer,
	layerName As String,
	ignoreDeletedLayers As Boolean
) As Integer
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
layerName
Type: System.String
[Missing <param name="layerName"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
ignoreDeletedLayers
Type: System.Boolean
[Missing <param name="ignoreDeletedLayers"/> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)"]
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace