RhinoCommon SDK
AnnotationBase Properties
Rhino for Mac 5.1
The AnnotationBase type exposes the following members.
Properties
Name | Description
Index
 Index of DimensionStyle in document DimStyle table used by the dimension.
NumericValue
 Gets the numeric value, depending on geometry type.
LinearDimension: distance between arrow tips
RadialDimension: radius or diamater depending on type
AngularDimension: angle in degrees
Leader or Text: UnsetValue
Plane
 Gets or sets the plane containing the annotation.
Text
 Gets or sets the text for this annotation.
TextFormula
 Gets or sets a formula for this annotation.
TextHeight
 Gets or sets the text height in model units.
Top
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace