RhinoCommon SDK
Point4d.Equals Method (Point4d)
Rhino for Mac 5.1
 Determines whether the specified point has same value as the present point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Equals(
	Point4d point
)
Public Function Equals (
	point As Point4d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point4d
The specified point.
Return Value
Type: Boolean
true if point has the same value as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Point4d Structure
Equals Overload
Rhino.Geometry Namespace