RhinoCommon SDK
ColorHSL.H Property
Rhino for Mac 5.1
 Gets or sets the hue channel value. Hue channels rotate between 0.0 and 1.0.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double H { get; set; }
Public Property H As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ColorHSL Structure
Rhino.Display Namespace