RhinoCommon SDK
InstanceDefinition.CreatePreviewBitmap Method (DefinedViewportProjection, DisplayMode, Size)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(Rhino.Display.DefinedViewportProjection,Rhino.DocObjects.DisplayMode,System.Drawing.Size)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Bitmap CreatePreviewBitmap(
	DefinedViewportProjection definedViewportProjection,
	DisplayMode displayMode,
	Size bitmapSize
)
Public Function CreatePreviewBitmap (
	definedViewportProjection As DefinedViewportProjection,
	displayMode As DisplayMode,
	bitmapSize As Size
) As Bitmap
Parameters
definedViewportProjection
Type: Rhino.Display.DefinedViewportProjection
[Missing <param name="definedViewportProjection"/> documentation for "M:Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(Rhino.Display.DefinedViewportProjection,Rhino.DocObjects.DisplayMode,System.Drawing.Size)"]
displayMode
Type: Rhino.DocObjects.DisplayMode
[Missing <param name="displayMode"/> documentation for "M:Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(Rhino.Display.DefinedViewportProjection,Rhino.DocObjects.DisplayMode,System.Drawing.Size)"]
bitmapSize
Type: System.Drawing.Size
[Missing <param name="bitmapSize"/> documentation for "M:Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(Rhino.Display.DefinedViewportProjection,Rhino.DocObjects.DisplayMode,System.Drawing.Size)"]
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(Rhino.Display.DefinedViewportProjection,Rhino.DocObjects.DisplayMode,System.Drawing.Size)"]
See Also
Reference
InstanceDefinition Class
CreatePreviewBitmap Overload
Rhino.DocObjects Namespace