RhinoCommon SDK
Point Constructor (Point3d)
Rhino for Mac 5.1
 Initializes a new point instance with a location.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point(
	Point3d location
)
Public Sub New (
	location As Point3d
)
Parameters
location
Type: Rhino.Geometry.Point3d
A position in 3D space.
See Also
Reference
Point Class
Point Overload
Rhino.Geometry Namespace