RhinoCommon SDK
File3dmObjectTable.AddPoint Method (Double, Double, Double)
Rhino for Mac 5.1
 Adds a point object to the table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddPoint(
	double x,
	double y,
	double z
)
Public Function AddPoint (
	x As Double,
	y As Double,
	z As Double
) As Guid
Parameters
x
Type: System.Double
X component of point coordinate.
y
Type: System.Double
Y component of point coordinate.
z
Type: System.Double
Z component of point coordinate.
Return Value
Type: Guid
id of new object.
See Also
Reference
File3dmObjectTable Class
AddPoint Overload
Rhino.FileIO Namespace