RhinoCommon SDK
AngularDimensionObject Class
Rhino for Mac 5.1
 Angular style dimension
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.AnnotationObjectBase
 Rhino.DocObjects.AngularDimensionObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class AngularDimensionObject : AnnotationObjectBase
Public Class AngularDimensionObject
	Inherits AnnotationObjectBase
The AngularDimensionObject type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace