RhinoCommon SDK
BrepFaceList.RemoveSlits Method
Rhino for Mac 5.1
 Remove slit trims and slit boundaries from each face.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool RemoveSlits()
Public Function RemoveSlits As Boolean
Return Value
Type: Boolean
true if any slits were removed
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace