RhinoCommon SDK
TransformObjectList.UpdateDisplayFeedbackTransform Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Collections.TransformObjectList.UpdateDisplayFeedbackTransform(Rhino.Geometry.Transform)"]
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateDisplayFeedbackTransform(
	Transform xform
)
Public Function UpdateDisplayFeedbackTransform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
[Missing <param name="xform"/> documentation for "M:Rhino.Collections.TransformObjectList.UpdateDisplayFeedbackTransform(Rhino.Geometry.Transform)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.TransformObjectList.UpdateDisplayFeedbackTransform(Rhino.Geometry.Transform)"]
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace