RhinoCommon SDK
ILocalizationService.LocalizeString Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.ILocalizationService.LocalizeString(System.Reflection.Assembly,System.Int32,System.String,System.Int32)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
string LocalizeString(
	Assembly assembly,
	int languageId,
	string english,
	int contextId
)
Function LocalizeString (
	assembly As Assembly,
	languageId As Integer,
	english As String,
	contextId As Integer
) As String
Parameters
assembly
Type: System.Reflection.Assembly
[Missing <param name="assembly"/> documentation for "M:Rhino.UI.ILocalizationService.LocalizeString(System.Reflection.Assembly,System.Int32,System.String,System.Int32)"]
languageId
Type: System.Int32
[Missing <param name="languageId"/> documentation for "M:Rhino.UI.ILocalizationService.LocalizeString(System.Reflection.Assembly,System.Int32,System.String,System.Int32)"]
english
Type: System.String
[Missing <param name="english"/> documentation for "M:Rhino.UI.ILocalizationService.LocalizeString(System.Reflection.Assembly,System.Int32,System.String,System.Int32)"]
contextId
Type: System.Int32
[Missing <param name="contextId"/> documentation for "M:Rhino.UI.ILocalizationService.LocalizeString(System.Reflection.Assembly,System.Int32,System.String,System.Int32)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.ILocalizationService.LocalizeString(System.Reflection.Assembly,System.Int32,System.String,System.Int32)"]
See Also
Reference
ILocalizationService Interface
Rhino.UI Namespace