RhinoCommon SDK
Curve.Extend Method (CurveEnd, CurveExtensionStyle, Point3d)
Rhino for Mac 5.1
 Extends a curve to a point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve Extend(
	CurveEnd side,
	CurveExtensionStyle style,
	Point3d endPoint
)
Public Function Extend (
	side As CurveEnd,
	style As CurveExtensionStyle,
	endPoint As Point3d
) As Curve
Parameters
side
Type: Rhino.Geometry.CurveEnd
The end of the curve to extend.
style
Type: Rhino.Geometry.CurveExtensionStyle
The style or type of extension to use.
endPoint
Type: Rhino.Geometry.Point3d
A new end point.
Return Value
Type: Curve
New extended curve result on success, null on failure.
See Also
Reference
Curve Class
Extend Overload
Rhino.Geometry Namespace