RhinoCommon SDK
GetColorEventArgs.Title Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.UI.GetColorEventArgs.Title"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Title { get; }
Public ReadOnly Property Title As String
	Get
Property Value
Type: String
See Also
Reference
GetColorEventArgs Class
Rhino.UI Namespace