RhinoCommon SDK
RhinoGet.Get2dRectangle Method
Rhino for Mac 5.1
 Gets a rectangle in view window coordinates.
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result Get2dRectangle(
	bool solidPen,
	out Rectangle rectangle,
	out RhinoView rectView
)
Public Shared Function Get2dRectangle (
	solidPen As Boolean,
	<OutAttribute> ByRef rectangle As Rectangle,
	<OutAttribute> ByRef rectView As RhinoView
) As Result
Parameters
solidPen
Type: System.Boolean
 If true, a solid pen is used for drawing while the user selects a rectangle. If false, a dotted pen is used for drawing while the user selects a rectangle.
rectangle
Type: System.Drawing.Rectangle
 user selected rectangle in window coordinates.
rectView
Type: Rhino.Display.RhinoView
 view that the user selected the window in.
Return Value
Type: Result
Success or Cancel.
See Also
Reference
RhinoGet Class
Rhino.Input Namespace