RhinoCommon SDK
Point3d.Equals Method (Point3d)
Rhino for Mac 5.1
 Determines whether the specified Point3d has the same values as the present point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Equals(
	Point3d point
)
Public Function Equals (
	point As Point3d
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
The specified point.
Return Value
Type: Boolean
true if point has the same coordinates as this; otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Point3d Structure
Equals Overload
Rhino.Geometry Namespace