RhinoCommon SDK
Point3d.Equality Operator
Rhino for Mac 5.1
 Determines whether two Point3d have equal values.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool operator ==(
	Point3d a,
	Point3d b
)
Public Shared Operator = (
	a As Point3d,
	b As Point3d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point3d
The first point.
b
Type: Rhino.Geometry.Point3d
The second point.
Return Value
Type: Boolean
true if the coordinates of the two points are exactly equal; otherwise false.
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace