RhinoCommon SDK
RhinoViewport.KeyboardRotate Method
Rhino for Mac 5.1
 Emulates the keyboard arrow key in terms of interaction.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool KeyboardRotate(
	bool leftRight,
	double angleRadians
)
Public Function KeyboardRotate (
	leftRight As Boolean,
	angleRadians As Double
) As Boolean
Parameters
leftRight
Type: System.Boolean
left/right rotate if true, up/down rotate if false.
angleRadians
Type: System.Double
 If less than 0, rotation is to left or down. If greater than 0, rotation is to right or up.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace