RhinoCommon SDK
Transform.Determinant Property
Rhino for Mac 5.1
 The determinant of this 4x4 matrix.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Determinant { get; }
Public ReadOnly Property Determinant As Double
	Get
Property Value
Type: Double
See Also
Reference
Transform Structure
Rhino.Geometry Namespace