RhinoCommon SDK
SweepTwoRail.MaintainHeight Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Geometry.SweepTwoRail.MaintainHeight"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MaintainHeight { get; set; }
Public Property MaintainHeight As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace