RhinoCommon SDK
BinaryArchiveWriter.WriteInt64 Method
Rhino for Mac 5.1
 Writes a Int64 value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteInt64(
	long value
)
Public Sub WriteInt64 (
	value As Long
)
Parameters
value
Type: System.Int64
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace