RhinoCommon SDK
Surface.SetDomain Method
Rhino for Mac 5.1
 Sets the domain in a direction.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual bool SetDomain(
	int direction,
	Interval domain
)
Public Overridable Function SetDomain (
	direction As Integer,
	domain As Interval
) As Boolean
Parameters
direction
Type: System.Int32
 0 sets first parameter's domain, 1 sets second parameter's domain.
domain
Type: Rhino.Geometry.Interval
A new domain to be assigned.
Return Value
Type: Boolean
true if setting succeeded, otherwise false.
See Also
Reference
Surface Class
Rhino.Geometry Namespace