RhinoCommon SDK
Transform.ToString Method
Rhino for Mac 5.1
 Returns a string representation of this transform.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A textual representation.
See Also
Reference
Transform Structure
Rhino.Geometry Namespace