RhinoCommon API
CustomEvent Events
The CustomEvent type exposes the following members.
Events
Name | Description
OnCustomEvent
 This event is raised when a Custom Event is triggered in rdk.
Top
See Also
Reference
CustomEvent Class
Rhino.Render Namespace