RhinoCommon SDK
Curve.IsArc Method
Rhino for Mac 5.1
 Test a curve to see if it can be represented by an arc or circle within RhinoMath.ZeroTolerance.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsArc()
Public Function IsArc As Boolean
Return Value
Type: Boolean
 true if the curve can be represented by an arc or a circle within tolerance.
See Also
Reference
Curve Class
IsArc Overload
Rhino.Geometry Namespace