RhinoCommon SDK
CommandStyleAttribute.Styles Property
Rhino for Mac 5.1
 Gets the associated style.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Style Styles { get; }
Public ReadOnly Property Styles As Style
	Get
Property Value
Type: Style
See Also
Reference
CommandStyleAttribute Class
Rhino.Commands Namespace