RhinoCommon SDK
BrepEdgeList.SplitKinkyEdge Method
Rhino for Mac 5.1
Splits the edge into G1 pieces.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SplitKinkyEdge(
	int edgeIndex,
	double kinkToleranceRadians
)
Public Function SplitKinkyEdge (
	edgeIndex As Integer,
	kinkToleranceRadians As Double
) As Boolean
Parameters
edgeIndex
Type: System.Int32
Index of edge to test and split.
kinkToleranceRadians
Type: System.Double
The split tolerance in radians.
Return Value
Type: Boolean
true if successful.
Remarks
 This function leaves deleted stuff in the brep. Call Brep.Compact() to remove deleted stuff.
See Also
Reference
BrepEdgeList Class
Rhino.Geometry.Collections Namespace