RhinoCommon SDK
Arc.Equals Method (Arc)
Rhino for Mac 5.1
 Determines whether another arc has the same value as this arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Equals(
	Arc other
)
Public Function Equals (
	other As Arc
) As Boolean
Parameters
other
Type: Rhino.Geometry.Arc
An arc.
Return Value
Type: Boolean
true if obj is equal to this arc; otherwise false.
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Arc Structure
Equals Overload
Rhino.Geometry Namespace