RhinoCommon SDK
DisplayPipeline.DrawArc Method (Arc, Color)
Rhino for Mac 5.1
 Draw a single arc object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawArc(
	Arc arc,
	Color color
)
Public Sub DrawArc (
	arc As Arc,
	color As Color
)
Parameters
arc
Type: Rhino.Geometry.Arc
Arc to draw.
color
Type: System.Drawing.Color
Color to draw with.
See Also
Reference
DisplayPipeline Class
DrawArc Overload
Rhino.Display Namespace