RhinoCommon SDK
PlaneSurface Constructor
Rhino for Mac 5.1
Overload List
Name | Description
PlaneSurface(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
PlaneSurface(Plane, Interval, Interval)
 Initializes a plane surface with x and y intervals.
Top
See Also
Reference
PlaneSurface Class
Rhino.Geometry Namespace