RhinoCommon SDK
StatusBar.SetDistancePane Method
Rhino for Mac 5.1
 Sets the distance pane to a distance value.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void SetDistancePane(
	double distance
)
Public Shared Sub SetDistancePane (
	distance As Double
)
Parameters
distance
Type: System.Double
The distance value.
See Also
Reference
StatusBar Class
Rhino.UI Namespace