RhinoCommon SDK
PointCloudItem.Hidden Property
Rhino for Mac 5.1
 Gets or sets the hidden flag of this point cloud item.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Hidden { get; set; }
Public Property Hidden As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
PointCloudItem Class
Rhino.Geometry Namespace