RhinoCommon SDK
MeshVertexList.ShowAll Method
Rhino for Mac 5.1
 Shows all vertices in the mesh.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void ShowAll()
Public Sub ShowAll
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace