RhinoCommon SDK
MeshTopologyVertexList.TopologyVertexIndex Method
Rhino for Mac 5.1
 Gets the topology vertex index for an existing mesh vertex in the mesh's VertexList.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int TopologyVertexIndex(
	int vertexIndex
)
Public Function TopologyVertexIndex (
	vertexIndex As Integer
) As Integer
Parameters
vertexIndex
Type: System.Int32
Index of a vertex in the Mesh.Vertices.
Return Value
Type: Int32
Index of a topology vertex in the Mesh.TopologyVertices.
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace