RhinoCommon SDK
MeshVertexColorList.Add Method (Int32, Int32, Int32)
Rhino for Mac 5.1
 Adds a new vertex color to the end of the color list.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Add(
	int red,
	int green,
	int blue
)
Public Function Add (
	red As Integer,
	green As Integer,
	blue As Integer
) As Integer
Parameters
red
Type: System.Int32
Red component of color, must be in the 0~255 range.
green
Type: System.Int32
Green component of color, must be in the 0~255 range.
blue
Type: System.Int32
Blue component of color, must be in the 0~255 range.
Return Value
Type: Int32
The index of the newly added color.
See Also
Reference
MeshVertexColorList Class
Add Overload
Rhino.Geometry.Collections Namespace