RhinoCommon SDK
Circle Constructor (Double)
Rhino for Mac 5.1
 Initializes a circle with center (0,0,0) in the world XY plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Circle(
	double radius
)
Public Sub New (
	radius As Double
)
Parameters
radius
Type: System.Double
Radius of circle, should be a positive number.
See Also
Reference
Circle Structure
Circle Overload
Rhino.Geometry Namespace