RhinoCommon SDK
Circle Constructor (Plane, Point3d, Double)
Rhino for Mac 5.1
 Initializes a circle parallel to a given plane with given center and radius.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Circle(
	Plane plane,
	Point3d center,
	double radius
)
Public Sub New (
	plane As Plane,
	center As Point3d,
	radius As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
Plane for circle.
center
Type: Rhino.Geometry.Point3d
Center point override.
radius
Type: System.Double
Radius of circle (should be a positive value).
See Also
Reference
Circle Structure
Circle Overload
Rhino.Geometry Namespace