RhinoCommon SDK
Circle Constructor (Point3d, Point3d, Point3d)
Rhino for Mac 5.1
 Initializes a circle through three 3d points. The start/end of the circle is at point1.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Circle(
	Point3d point1,
	Point3d point2,
	Point3d point3
)
Public Sub New (
	point1 As Point3d,
	point2 As Point3d,
	point3 As Point3d
)
Parameters
point1
Type: Rhino.Geometry.Point3d
[Missing <param name="point1"/> documentation for "M:Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
point2
Type: Rhino.Geometry.Point3d
[Missing <param name="point2"/> documentation for "M:Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
point3
Type: Rhino.Geometry.Point3d
[Missing <param name="point3"/> documentation for "M:Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)"]
See Also
Reference
Circle Structure
Circle Overload
Rhino.Geometry Namespace