RhinoCommon SDK
Circle Constructor (Point3d, Vector3d, Point3d)
Rhino for Mac 5.1
 Initializes a circle from two 3d points and a tangent at the first point. The start/end of the circle is at point "startPoint".
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Circle(
	Point3d startPoint,
	Vector3d tangentAtP,
	Point3d pointOnCircle
)
Public Sub New (
	startPoint As Point3d,
	tangentAtP As Vector3d,
	pointOnCircle As Point3d
)
Parameters
startPoint
Type: Rhino.Geometry.Point3d
Start point of circle.
tangentAtP
Type: Rhino.Geometry.Vector3d
Tangent vector at start.
pointOnCircle
Type: Rhino.Geometry.Point3d
Point coincident with desired circle.
Remarks
May create an Invalid circle
See Also
Reference
Circle Structure
Circle Overload
Rhino.Geometry Namespace