RhinoCommon SDK
CurveObject Class
Rhino for Mac 5.1
 A Rhino Object that represents curve geometry and attributes
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.CurveObject
 Rhino.DocObjects.Custom.CustomCurveObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class CurveObject : RhinoObject
Public Class CurveObject
	Inherits RhinoObject
The CurveObject type exposes the following members.
Properties
Name | Description
CurveGeometry
Top
Methods
Name | Description
DuplicateCurveGeometry
Top
See Also
Reference
Rhino.DocObjects Namespace