RhinoCommon SDK
ObjectTable.Replace Method (Guid, TextDot)
Rhino for Mac 5.1
Replaces one object with new textdot object.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Replace(
	Guid objectId,
	TextDot dot
)
Public Function Replace (
	objectId As Guid,
	dot As TextDot
) As Boolean
Parameters
objectId
Type: System.Guid
Id of object to be replaced.
dot
Type: Rhino.Geometry.TextDot
new textdot to be added. The textdot is copied.
Return Value
Type: Boolean
true if successful.
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace