RhinoCommon SDK
Circle.Reverse Method
Rhino for Mac 5.1
 Reverse the orientation of the circle. Changes the domain from [a,b] to [-b,-a].
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Reverse()
Public Sub Reverse
See Also
Reference
Circle Structure
Rhino.Geometry Namespace