RhinoCommon SDK
CurveSimplifyOptions Enumeration
Rhino for Mac 5.1
 Enumerates the options to use when simplifying a curve.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[FlagsAttribute]
public enum CurveSimplifyOptions
<FlagsAttribute>
Public Enumeration CurveSimplifyOptions
Members
Member name | Value | Description
None | 0 |  No option is specified.
SplitAtFullyMultipleKnots | 1 |  Split NurbsCurves at fully multiple knots. Effectively turning single nurbs segments with kinks into multiple segments.
RebuildLines | 2 |  Replace linear segments with LineCurves.
RebuildArcs | 4 |  Replace partially circular segments with ArcCurves.
RebuildRationals | 8 |  Replace rational nurbscurves with constant weights with an equivalent non-rational NurbsCurve.
AdjustG1 | 16 |  Adjust Curves at G1-joins.
Merge | 32 |  Merge adjacent co-linear lines or co-circular arcs or combine consecutive line segments into a polyline.
All | 63 |  Implies all of the simplification functions will be used.
See Also
Reference
Rhino.Geometry Namespace