RhinoCommon SDK
MappingTag Class
Rhino for Mac 5.1
 Holds texture mapping information.
Inheritance Hierarchy
System.Object
 Rhino.Render.MappingTag
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class MappingTag
Public Class MappingTag
The MappingTag type exposes the following members.
Constructors
Name | Description
MappingTag
Initializes a new instance of the MappingTag class
Top
Properties
Name | Description
Id
 Gets or sets a map globally unique identifier.
MappingCRC
 Gets or sets the cyclic redundancy check on the mapping. See also CRC32(UInt32, Byte[]).
MappingType
 Gets or sets a texture mapping type: linear, cylinder, etc...
MeshTransform
 Gets or sets a 4x4 matrix tranform.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace