RhinoCommon SDK
MeshVertexColorList.SetColor Method (Int32, Color)
Rhino for Mac 5.1
 Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetColor(
	int index,
	Color color
)
Public Function SetColor (
	index As Integer,
	color As Color
) As Boolean
Parameters
index
Type: System.Int32
Index of vertex color to set. If index equals Count, then the color will be appended.
color
Type: System.Drawing.Color
Color to set, Alpha channels will be ignored.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexColorList Class
SetColor Overload
Rhino.Geometry.Collections Namespace