RhinoCommon SDK
MeshVertexColorList.SetColor Method (Int32, Int32, Int32, Int32)
Rhino for Mac 5.1
 Sets or adds a vertex color to the color List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetColor(
	int index,
	int red,
	int green,
	int blue
)
Public Function SetColor (
	index As Integer,
	red As Integer,
	green As Integer,
	blue As Integer
) As Boolean
Parameters
index
Type: System.Int32
Index of vertex color to set. If index equals Count, then the color will be appended.
red
Type: System.Int32
Red component of vertex color. Value must be in the 0~255 range.
green
Type: System.Int32
Green component of vertex color. Value must be in the 0~255 range.
blue
Type: System.Int32
Blue component of vertex color. Value must be in the 0~255 range.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexColorList Class
SetColor Overload
Rhino.Geometry.Collections Namespace