RhinoCommon SDK
DisplayPipelineAttributes.CurveColor Property
Rhino for Mac 5.1
Color used for drawing curves
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color CurveColor { get; set; }
Public Property CurveColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace