RhinoCommon SDK
GetPoint.MouseDown Event
Rhino for Mac 5.1
 Called during Get2dRectangle, Get2dLine, and GetPoint(..,true) when the mouse down event for the initial point occurs. This function is not called during ordinary point getting because the mouse down event terminates an ordinary point get and returns a GetResult.Point result.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public event EventHandler<GetPointMouseEventArgs> MouseDown
Public Event MouseDown As EventHandler(Of GetPointMouseEventArgs)
Value
Type: System.EventHandler<GetPointMouseEventArgs>
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace