RhinoCommon SDK
Brep.CreateTrimmedSurface Method
Rhino for Mac 5.1
 Constructs a Brep using the trimming information of a brep face and a surface. Surface must be roughly the same shape and in the same location as the trimming brep face.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep CreateTrimmedSurface(
	BrepFace trimSource,
	Surface surfaceSource
)
Public Shared Function CreateTrimmedSurface (
	trimSource As BrepFace,
	surfaceSource As Surface
) As Brep
Parameters
trimSource
Type: Rhino.Geometry.BrepFace
BrepFace which contains trimmingSource brep.
surfaceSource
Type: Rhino.Geometry.Surface
Surface that trims of BrepFace will be applied to.
Return Value
Type: Brep
A brep with the shape of surfaceSource and the trims of trimSource or null on failure.
See Also
Reference
Brep Class
Rhino.Geometry Namespace