RhinoCommon SDK
File3dmNotes.Notes Property
Rhino for Mac 5.1
 Gets or sets the text content of the notes.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string Notes { get; set; }
Public Property Notes As String
	Get
	Set
Property Value
Type: String
See Also
Reference
File3dmNotes Class
Rhino.FileIO Namespace