RhinoCommon SDK
ObjectTable.AddEllipse Method
Rhino for Mac 5.1
Overload List
Name | Description
AddEllipse(Ellipse)
Adds a curve object to the document representing an ellipse.
AddEllipse(Ellipse, ObjectAttributes)
Adds a curve object to the document representing an ellipse.
AddEllipse(Ellipse, ObjectAttributes, HistoryRecord, Boolean)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace