RhinoCommon SDK
PickContext.PickFrustumTest Method (BoundingBox, Boolean)
Rhino for Mac 5.1
 Fast test to check if a bounding box intersects a pick frustum.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PickFrustumTest(
	BoundingBox box,
	out bool boxCompletelyInFrustum
)
Public Function PickFrustumTest (
	box As BoundingBox,
	<OutAttribute> ByRef boxCompletelyInFrustum As Boolean
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
[Missing <param name="box"/> documentation for "M:Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.BoundingBox,System.Boolean@)"]
boxCompletelyInFrustum
Type: System.Boolean
 Set to true if the box is completely contained in the pick frustum. When doing a window or crossing pick, you can immediately return a hit if the object's bounding box is completely inside of the pick frustum.
Return Value
Type: Boolean
 False if bbox is invalid or box does not intersect the pick frustum
See Also
Reference
PickContext Class
PickFrustumTest Overload
Rhino.Input.Custom Namespace