RhinoCommon SDK
ObjectPropertiesPage.OnCreateParent Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.ObjectPropertiesPage.OnCreateParent(System.IntPtr)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual void OnCreateParent(
	IntPtr hwndParent
)
Public Overridable Sub OnCreateParent (
	hwndParent As IntPtr
)
Parameters
hwndParent
Type: System.IntPtr
[Missing <param name="hwndParent"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.OnCreateParent(System.IntPtr)"]
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace