RhinoCommon SDK
PointCloud Constructor (PointCloud)
Rhino for Mac 5.1
 Initializes a new instance of the PointCloud class, copying (Merge) the content of another pointcloud.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PointCloud(
	PointCloud other
)
Public Sub New (
	other As PointCloud
)
Parameters
other
Type: Rhino.Geometry.PointCloud
[Missing <param name="other"/> documentation for "M:Rhino.Geometry.PointCloud.#ctor(Rhino.Geometry.PointCloud)"]
See Also
Reference
PointCloud Class
PointCloud Overload
Rhino.Geometry Namespace