RhinoCommon SDK
PointCloud Constructor (IEnumerable<Point3d>)
Rhino for Mac 5.1
 Initializes a new instance of the PointCloud class, copying the content from a set of points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PointCloud(
	IEnumerable<Point3d> points
)
Public Sub New (
	points As IEnumerable(Of Point3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list or an array of Point3d, or any object that implements IEnumerable<T>.
See Also
Reference
PointCloud Class
PointCloud Overload
Rhino.Geometry Namespace