RhinoCommon SDK
CommandEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Commands.CommandEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Commands.CommandEventArgs
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class CommandEventArgs : EventArgs
Public Class CommandEventArgs
	Inherits EventArgs
The CommandEventArgs type exposes the following members.
Properties
Name | Description
CommandEnglishName
 Gets the English name of the command that raised this event.
CommandId
 Gets the ID of the command that raised this event.
CommandLocalName
 Gets the name of the command that raised this event in the local language.
CommandPluginName
 Gets the name of the plug-in that this command belongs to. If the command is internal to Rhino, then this propert is an empty string.
CommandResult
 Gets the result of the command that raised this event. This value is only meaningful during EndCommand events.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Commands Namespace