RhinoCommon SDK
EarthAnchorPoint.GetModelToEarthTransform Method
Rhino for Mac 5.1
 Gets a transformation from model coordinates to earth coordinates. This transformation assumes the model is small enough that the curvature of the earth can be ignored.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform GetModelToEarthTransform(
	UnitSystem modelUnitSystem
)
Public Function GetModelToEarthTransform (
	modelUnitSystem As UnitSystem
) As Transform
Parameters
modelUnitSystem
Type: Rhino.UnitSystem
The model unit system.
Return Value
Type: Transform
 Transform on success. Inalid Transform on error.
Remarks
 If M is a point in model coordinates and E = model_to_earth*M, then E.x = latitude in decimal degrees E.y = longitude in decimal degrees E.z = elevation in meters above mean sea level Because the earth is not flat, there is a small amount of error when using a linear transformation to calculate oblate spherical coordinates. This error is small. If the distance from P to M is d meters, then the approximation error is latitude error <= longitude error <= elevation error <= 6379000*((1 + (d/6356000)^2)-1) meters In particular, if every point in the model is within 1000 meters of the m_model_basepoint, then the maximum approximation errors are latitude error <= longitude error <= elevation error <= 8 centimeters.
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace