RhinoCommon SDK
GetTransform.CalculateTransform Method
Rhino for Mac 5.1
 Retrieves the final transformation.
Override this virtual function to provide your own custom transformation method.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract Transform CalculateTransform(
	RhinoViewport viewport,
	Point3d point
)
Public MustOverride Function CalculateTransform (
	viewport As RhinoViewport,
	point As Point3d
) As Transform
Parameters
viewport
Type: Rhino.Display.RhinoViewport
A Rhino viewport that the user is using.
point
Type: Rhino.Geometry.Point3d
A point that the user is selecting.
Return Value
Type: Transform
A transformation matrix value.
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace