RhinoCommon SDK
Vector3f.CrossProduct Method
Rhino for Mac 5.1
 Computes the cross product (or vector product, or exterior product) of two vectors.
This operation is not commutative.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Vector3f CrossProduct(
	Vector3f a,
	Vector3f b
)
Public Shared Function CrossProduct (
	a As Vector3f,
	b As Vector3f
) As Vector3f
Parameters
a
Type: Rhino.Geometry.Vector3f
First vector.
b
Type: Rhino.Geometry.Vector3f
Second vector.
Return Value
Type: Vector3f
A new vector that is perpendicular to both a and b,
has Length == a.Length * b.Length and
with a result that is oriented following the right hand rule.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace