RhinoCommon SDK
NurbsSurface.CreateThroughPoints Method
Rhino for Mac 5.1
 Constructs a NURBS surface from a 2D grid of points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static NurbsSurface CreateThroughPoints(
	IEnumerable<Point3d> points,
	int uCount,
	int vCount,
	int uDegree,
	int vDegree,
	bool uClosed,
	bool vClosed
)
Public Shared Function CreateThroughPoints (
	points As IEnumerable(Of Point3d),
	uCount As Integer,
	vCount As Integer,
	uDegree As Integer,
	vDegree As Integer,
	uClosed As Boolean,
	vClosed As Boolean
) As NurbsSurface
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Control point locations.
uCount
Type: System.Int32
Number of points in U direction.
vCount
Type: System.Int32
Number of points in V direction.
uDegree
Type: System.Int32
Degree of surface in U direction.
vDegree
Type: System.Int32
Degree of surface in V direction.
uClosed
Type: System.Boolean
true if the surface should be closed in the U direction.
vClosed
Type: System.Boolean
true if the surface should be closed in the V direction.
Return Value
Type: NurbsSurface
A NurbsSurface on success or null on failure.
Remarks
uCount multiplied by vCount must equal the number of points supplied.
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace