RhinoCommon SDK
Vector3f Methods
Rhino for Mac 5.1
The Vector3f type exposes the following members.
Methods
Name | Description
Add
 Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
CompareTo
 Compares this Vector3f with another Vector3f.
Component evaluation priority is first X, then Y, then Z.
CrossProduct
 Computes the cross product (or vector product, or exterior product) of two vectors.
This operation is not commutative.
EpsilonEquals
 Check that all values in other are withing epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Vector3f and has the same values as the present vector.
 (Overrides ValueType.Equals(Object).)
Equals(Vector3f)
 Determines whether the specified vector has the same values as the present vector.
GetHashCode
 Computes a hash number that represents the current vector.
 (Overrides ValueType.GetHashCode().)
Multiply(Single, Vector3f)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector3f, Vector3f)
 Multiplies two vectors together, returning the dot product (or inner product). This differs from the cross product.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
Multiply(Vector3f, Single)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
PerpendicularTo
 Sets this vector to be perpendicular to another vector. Result is not unitized.
Reverse
 Reverses (inverts) this vector in place.
If this vector contains RhinoMath.UnsetValue, the reverse will also be invalid and false will be returned.
Rotate
 Rotates this vector around a given axis.
ToString
 Constructs the string representation of the current vector.
 (Overrides ValueType.ToString().)
Transform
 Transforms the vector in place.
The transformation matrix acts on the left of the vector; i.e.,
result = transformation*vector
Unitize
 Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
Top
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace