RhinoCommon SDK
RhinoViewport.GetFrustumCenter Method
Rhino for Mac 5.1
 Returns world coordinates of frustum's center.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool GetFrustumCenter(
	out Point3d center
)
Public Function GetFrustumCenter (
	<OutAttribute> ByRef center As Point3d
) As Boolean
Parameters
center
Type: Rhino.Geometry.Point3d
The center coordinate is assigned to this out parameter if this call succeeds.
Return Value
Type: Boolean
true if the center was successfully computed.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace