RhinoCommon SDK
SporphSpaceMorph Constructor (Surface, Surface, Point2d, Point2d)
Rhino for Mac 5.1
 Constructs a sporph space morph.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public SporphSpaceMorph(
	Surface surface0,
	Surface surface1,
	Point2d surface0Param,
	Point2d surface1Param
)
Public Sub New (
	surface0 As Surface,
	surface1 As Surface,
	surface0Param As Point2d,
	surface1Param As Point2d
)
Parameters
surface0
Type: Rhino.Geometry.Surface
Base surface.
surface1
Type: Rhino.Geometry.Surface
Target surface.
surface0Param
Type: Rhino.Geometry.Point2d
U,V parameter on surface0 used for orienting.
surface1Param
Type: Rhino.Geometry.Point2d
U,V parameter on surface1 used for orienting.
See Also
Reference
SporphSpaceMorph Class
SporphSpaceMorph Overload
Rhino.Geometry.Morphs Namespace