RhinoCommon SDK
SweepTwoRail.PerformSweepRebuild Method (Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>, Int32)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Int32)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep[] PerformSweepRebuild(
	Curve rail1,
	Curve rail2,
	IEnumerable<Curve> crossSections,
	IEnumerable<double> crossSectionParametersRail1,
	IEnumerable<double> crossSectionParametersRail2,
	int rebuildCount
)
Public Function PerformSweepRebuild (
	rail1 As Curve,
	rail2 As Curve,
	crossSections As IEnumerable(Of Curve),
	crossSectionParametersRail1 As IEnumerable(Of Double),
	crossSectionParametersRail2 As IEnumerable(Of Double),
	rebuildCount As Integer
) As Brep()
Parameters
rail1
Type: Rhino.Geometry.Curve
[Missing <param name="rail1"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Int32)"]
rail2
Type: Rhino.Geometry.Curve
[Missing <param name="rail2"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Int32)"]
crossSections
Type: System.Collections.Generic.IEnumerable<Curve>
[Missing <param name="crossSections"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Int32)"]
crossSectionParametersRail1
Type: System.Collections.Generic.IEnumerable<Double>
[Missing <param name="crossSectionParametersRail1"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Int32)"]
crossSectionParametersRail2
Type: System.Collections.Generic.IEnumerable<Double>
[Missing <param name="crossSectionParametersRail2"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Int32)"]
rebuildCount
Type: System.Int32
[Missing <param name="rebuildCount"/> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Int32)"]
Return Value
Type: Brep[]
[Missing <returns> documentation for "M:Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Int32)"]
See Also
Reference
SweepTwoRail Class
PerformSweepRebuild Overload
Rhino.Geometry Namespace