RhinoCommon SDK
DisplayMode Enumeration
Rhino for Mac 5.1
 Defines enumerated values for display modes, such as wireframe or shaded.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum DisplayMode
Public Enumeration DisplayMode
Members
Member name | Value | Description
Default | 0 |  The default display mode.
Wireframe | 1 |  The wireframe display mode.
Objects are generally only outlined by their corresponding isocurves and edges.
Shaded | 2 |  The shaded display mode.
Objects are generally displayed with their corresponding isocurves and edges, and are filled with their diplay colors.
RenderPreview | 3 |  The render display mode.
Objects are generally displayed in a similar way to the one that will be resulting from rendering.
See Also
Reference
Rhino.DocObjects Namespace