RhinoCommon SDK
Quaternion.Rotation Method (Double, Vector3d)
Rhino for Mac 5.1
 Returns the unit quaternion cos(angle/2), sin(angle/2)*x, sin(angle/2)*y, sin(angle/2)*z where (x,y,z) is the unit vector parallel to axis. This is the unit quaternion that represents the rotation of angle about axis.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Quaternion Rotation(
	double angle,
	Vector3d axisOfRotation
)
Public Shared Function Rotation (
	angle As Double,
	axisOfRotation As Vector3d
) As Quaternion
Parameters
angle
Type: System.Double
An angle in radians.
axisOfRotation
Type: Rhino.Geometry.Vector3d
The axis of rotation.
Return Value
Type: Quaternion
A new quaternion.
See Also
Reference
Quaternion Structure
Rotation Overload
Rhino.Geometry Namespace