RhinoCommon SDK
MeshTopologyVertexList.Count Property
Rhino for Mac 5.1
 Gets or sets the number of mesh topology vertices.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshTopologyVertexList Class
Rhino.Geometry.Collections Namespace