RhinoCommon SDK
Brep.GetVolume Method (Double, Double)
Rhino for Mac 5.1
 Compute the Volume of the Brep. If you want proper Volume data with moments and error information, use the VolumeMassProperties class.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double GetVolume(
	double relativeTolerance,
	double absoluteTolerance
)
Public Function GetVolume (
	relativeTolerance As Double,
	absoluteTolerance As Double
) As Double
Parameters
relativeTolerance
Type: System.Double
Relative tolerance to use for area calculation.
absoluteTolerance
Type: System.Double
Absolute tolerance to use for area calculation.
Return Value
Type: Double
The volume of the Brep.
See Also
Reference
Brep Class
GetVolume Overload
Rhino.Geometry Namespace