RhinoCommon SDK
GumballAppearanceSettings.ColorX Property
Rhino for Mac 5.1
Default is Red.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color ColorX { get; set; }
Public Property ColorX As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace