RhinoCommon SDK
PointCloud.GetEnumerator Method
Rhino for Mac 5.1
 Gets an enumerator that allows to modify each pointcloud point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<PointCloudItem> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of PointCloudItem)
Return Value
Type: IEnumerator<PointCloudItem>
A instance of IEnumerator<T>.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace