RhinoCommon SDK
Point3d Constructor (Double, Double, Double)
Rhino for Mac 5.1
 Initializes a new point by defining the X, Y and Z coordinates.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d(
	double x,
	double y,
	double z
)
Public Sub New (
	x As Double,
	y As Double,
	z As Double
)
Parameters
x
Type: System.Double
The value of the X (first) coordinate.
y
Type: System.Double
The value of the Y (second) coordinate.
z
Type: System.Double
The value of the Z (third) coordinate.
Examples
using System;
partial class Examples
{
  public static Rhino.Commands.Result AddCircle(Rhino.RhinoDoc doc)
  {
    Rhino.Geometry.Point3d center = new Rhino.Geometry.Point3d(0, 0, 0);
    const double radius = 10.0;
    Rhino.Geometry.Circle c = new Rhino.Geometry.Circle(center, radius);
    if (doc.Objects.AddCircle(c) != Guid.Empty)
    {
      doc.Views.Redraw();
      return Rhino.Commands.Result.Success;
    }
    return Rhino.Commands.Result.Failure;
  }
}
Partial Class Examples
  Public Shared Function AddCircle(ByVal doc As Rhino.RhinoDoc) As Rhino.Commands.Result
    Dim center As New Rhino.Geometry.Point3d(0, 0, 0)
    Const radius As Double = 10.0
    Dim c As New Rhino.Geometry.Circle(center, radius)
    If doc.Objects.AddCircle(c) <> Guid.Empty Then
      doc.Views.Redraw()
      Return Rhino.Commands.Result.Success
    End If
    Return Rhino.Commands.Result.Failure
  End Function
End Class
import Rhino
import scriptcontext
import System.Guid
def AddCircle():
    center = Rhino.Geometry.Point3d(0, 0, 0)
    radius = 10.0
    c = Rhino.Geometry.Circle(center, radius)
    if scriptcontext.doc.Objects.AddCircle(c)!=System.Guid.Empty:
        scriptcontext.doc.Views.Redraw()
        return Rhino.Commands.Result.Success
    return Rhino.Commands.Result.Failure
if __name__=="__main__":
    AddCircle()
See Also
Reference
Point3d Structure
Point3d Overload
Rhino.Geometry Namespace