RhinoCommon SDK
Ray3d Properties
Rhino for Mac 5.1
The Ray3d type exposes the following members.
Properties
Name | Description
Direction
 Gets the direction vector of this ray.
Position
 Gets the starting position of this ray.
Top
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace