RhinoCommon SDK
GumballObject.SetFromCircle Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromCircle(Rhino.Geometry.Circle)"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFromCircle(
	Circle circle
)
Public Function SetFromCircle (
	circle As Circle
) As Boolean
Parameters
circle
Type: Rhino.Geometry.Circle
[Missing <param name="circle"/> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromCircle(Rhino.Geometry.Circle)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromCircle(Rhino.Geometry.Circle)"]
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace