RhinoCommon SDK
Material.UseCount Property
Rhino for Mac 5.1
 Number of objects and layers that use this material.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int UseCount { get; }
Public ReadOnly Property UseCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Material Class
Rhino.DocObjects Namespace