RhinoCommon SDK
MeshVertexNormalList.SetNormal Method (Int32, Double, Double, Double)
Rhino for Mac 5.1
 Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.
If [index] equals [Count], a new vertex normal is appended to the end of the list.
If [index] is larger than [Count], the function will return false.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetNormal(
	int index,
	double x,
	double y,
	double z
)
Public Function SetNormal (
	index As Integer,
	x As Double,
	y As Double,
	z As Double
) As Boolean
Parameters
index
Type: System.Int32
Index of vertex normal to set.
x
Type: System.Double
X component of vertex normal.
y
Type: System.Double
Y component of vertex normal.
z
Type: System.Double
Z component of vertex normal.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexNormalList Class
SetNormal Overload
Rhino.Geometry.Collections Namespace