RhinoCommon SDK
MeshVertexNormalList.SetNormal Method (Int32, Single, Single, Single)
Rhino for Mac 5.1
 Sets or adds a normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.
If [index] equals [Count], a new vertex normal is appended to the end of the list.
If [index] is larger than [Count], the function will return false.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetNormal(
	int index,
	float x,
	float y,
	float z
)
Public Function SetNormal (
	index As Integer,
	x As Single,
	y As Single,
	z As Single
) As Boolean
Parameters
index
Type: System.Int32
Index of vertex normal to set.
x
Type: System.Single
X component of vertex normal.
y
Type: System.Single
Y component of vertex normal.
z
Type: System.Single
Z component of vertex normal.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexNormalList Class
SetNormal Overload
Rhino.Geometry.Collections Namespace