RhinoCommon SDK
PanelIds.Sun Property
Rhino for Mac 5.1
 Rhino sun panel
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Guid Sun { get; }
Public Shared ReadOnly Property Sun As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace