RhinoCommon SDK
NurbsCurveKnotList.ClampEnd Method
Rhino for Mac 5.1
 Clamp end knots. Does not modify control point locations.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ClampEnd(
	CurveEnd end
)
Public Function ClampEnd (
	end As CurveEnd
) As Boolean
Parameters
end
Type: Rhino.Geometry.CurveEnd
Curve end to clamp.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace