RhinoCommon SDK
ObjectTable.AddEllipse Method (Ellipse, ObjectAttributes)
Rhino for Mac 5.1
Adds a curve object to the document representing an ellipse.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddEllipse(
	Ellipse ellipse,
	ObjectAttributes attributes
)
Public Function AddEllipse (
	ellipse As Ellipse,
	attributes As ObjectAttributes
) As Guid
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
An ellipse value.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to ellipse.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddEllipse Overload
Rhino.DocObjects.Tables Namespace