RhinoCommon SDK
RhinoTransformObjectsEventArgs.Objects Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoTransformObjectsEventArgs.Objects"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoObject[] Objects { get; }
Public ReadOnly Property Objects As RhinoObject()
	Get
Property Value
Type: RhinoObject[]
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace