RhinoCommon SDK
ObjectTable.Purge Method (RhinoObject)
Rhino for Mac 5.1
 Removes object from document and deletes the pointer. Typically you will want to call Delete instead in order to keep the object on the undo list.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Purge(
	RhinoObject rhinoObject
)
Public Function Purge (
	rhinoObject As RhinoObject
) As Boolean
Parameters
rhinoObject
Type: Rhino.DocObjects.RhinoObject
A Rhino object that will be deleted.
Return Value
Type: Boolean
true if the object was purged; otherwise false.
See Also
Reference
ObjectTable Class
Purge Overload
Rhino.DocObjects.Tables Namespace