RhinoCommon SDK
DisplayPipeline.DrawDot Method (Point3d, String, Color, Color)
Rhino for Mac 5.1
 Draw a text dot in world coordinates.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawDot(
	Point3d worldPosition,
	string text,
	Color dotColor,
	Color textColor
)
Public Sub DrawDot (
	worldPosition As Point3d,
	text As String,
	dotColor As Color,
	textColor As Color
)
Parameters
worldPosition
Type: Rhino.Geometry.Point3d
Location of dot in world coordinates.
text
Type: System.String
Text content of dot.
dotColor
Type: System.Drawing.Color
Dot background color.
textColor
Type: System.Drawing.Color
Dot foreground color.
See Also
Reference
DisplayPipeline Class
DrawDot Overload
Rhino.Display Namespace