RhinoCommon SDK
DisplayPipeline.DrawDot Method (Int32, Int32, String)
Rhino for Mac 5.1
 Draws a text dot in screen coordinates.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawDot(
	int screenX,
	int screenY,
	string text
)
Public Sub DrawDot (
	screenX As Integer,
	screenY As Integer,
	text As String
)
Parameters
screenX
Type: System.Int32
X coordinate (in pixels) of dot center.
screenY
Type: System.Int32
Y coordinate (in pixels) of dot center.
text
Type: System.String
Text content of dot.
See Also
Reference
DisplayPipeline Class
DrawDot Overload
Rhino.Display Namespace