RhinoCommon SDK
DisplayPipeline.DrawBox Method (BoundingBox, Color, Int32)
Rhino for Mac 5.1
 Draws the edges of a BoundingBox.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawBox(
	BoundingBox box,
	Color color,
	int thickness
)
Public Sub DrawBox (
	box As BoundingBox,
	color As Color,
	thickness As Integer
)
Parameters
box
Type: Rhino.Geometry.BoundingBox
Box to draw.
color
Type: System.Drawing.Color
Color to draw in.
thickness
Type: System.Int32
Thickness (in pixels) of box edges.
See Also
Reference
DisplayPipeline Class
DrawBox Overload
Rhino.Display Namespace