RhinoCommon SDK
GetPoint.Get Method (Boolean)
Rhino for Mac 5.1
 After setting up options and so on, call this method to get a 3d point.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GetResult Get(
	bool onMouseUp
)
Public Function Get (
	onMouseUp As Boolean
) As GetResult
Parameters
onMouseUp
Type: System.Boolean
 If false, the point is returned when the left mouse button goes down. If true, the point is returned when the left mouse button goes up.
Return Value
Type: GetResult
Point if the user chose a point; other enumeration value otherwise.
See Also
Reference
GetPoint Class
Get Overload
Rhino.Input.Custom Namespace