RhinoCommon SDK
Mesh.CreateFromBrep Method
Rhino for Mac 5.1
Overload List
Name | Description
CreateFromBrep(Brep)
 Constructs a mesh from a brep.
CreateFromBrep(Brep, MeshingParameters)
 Constructs a mesh from a brep.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace