RhinoCommon SDK
RenderSettings Properties
Rhino for Mac 5.1
The RenderSettings type exposes the following members.
Properties
Name | Description
AmbientLight
 Gets or sets the ambient light color used in rendering.
AntialiasLevel
 0=none, 1=normal, 2=best.
BackgroundColorBottom
 Gets or sets the background bottom color used in rendering.
BackgroundColorTop
 Gets or sets the background top color used in rendering.
Sets also the background color if a solid background color is set.
BackgroundStyle
 How the viewport's backgroun should be filled.
DepthCue
 Gets or sets a value indicating whether to render using depth cues.
These are clues to help the perception of position and orientation of objects in the image.
FlatShade
 Gets or sets a value indicating whether to render using flat shading.
ImageSize
 Gets or sets a value indicating the size of the rendering result if UseViewportSize is set to false. If UseViewportSize is set to true, then this value is ignored.
RenderAnnotations
 Gets or sets a value indicating whether to instruct the rendering engine to show annotations, such as linear dimensions or angular dimensions.
RenderBackfaces
 Gets or sets a value indicating whether to render back faces.
RenderCurves
 Gets or sets a value indicating whether to instruct the rendering engine to show curves.
RenderIsoparams
 Gets or sets a value indicating whether to instruct the rendering engine to show isocurves.
RenderMeshEdges
 Gets or sets a value indicating whether to instruct the rendering engine to show mesh edges.
RenderPoints
 Gets or sets a value indicating whether to instruct the rendering engine to show points.
ShadowmapLevel
 0=none, 1=normal, 2=best.
UseHiddenLights
 Gets or sets a value indicating whether to render using lights that are on layers that are off.
UseViewportSize
 Gets or sets a value indicating whether to use the resolution of the viewport being rendered or ImageSize when rendering
Top
See Also
Reference
RenderSettings Class
Rhino.Render Namespace