RhinoCommon SDK
File3dmObjectTable.Item Property
Rhino for Mac 5.1
 Gets the File3dmObject at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public File3dmObject this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As File3dmObject
	Get
Parameters
index
Type: System.Int32
Index of File3dmObject to access.
Return Value
Type: File3dmObject
The File3dmObject at [index].
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
See Also
Reference
File3dmObjectTable Class
Rhino.FileIO Namespace