RhinoCommon SDK
MeshVertexList.GetConnectedVertices Method
Rhino for Mac 5.1
 Gets indices of all vertices that form "edges" with a given vertex index.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] GetConnectedVertices(
	int vertexIndex
)
Public Function GetConnectedVertices (
	vertexIndex As Integer
) As Integer()
Parameters
vertexIndex
Type: System.Int32
The index of a vertex to query.
Return Value
Type: Int32[]
An array of vertex indices that are connected with the specified vertex.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace