RhinoCommon SDK
ToolbarFileCollection.Open Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFileCollection.Open(System.String)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ToolbarFile Open(
	string path
)
Public Function Open (
	path As String
) As ToolbarFile
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.UI.ToolbarFileCollection.Open(System.String)"]
Return Value
Type: ToolbarFile
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFileCollection.Open(System.String)"]
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace