RhinoCommon SDK
Surface.CreatePeriodicSurface Method
Rhino for Mac 5.1
 Constructs a periodic surface from a base surface and a direction.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Surface CreatePeriodicSurface(
	Surface baseSurface,
	int direction
)
Public Shared Function CreatePeriodicSurface (
	baseSurface As Surface,
	direction As Integer
) As Surface
Parameters
baseSurface
Type: Rhino.Geometry.Surface
A base surface.
direction
Type: System.Int32
0 is first parameter, 1 is second parameter.
Return Value
Type: Surface
A new surface; or null on error.
See Also
Reference
Surface Class
Rhino.Geometry Namespace