RhinoCommon SDK
Localization.LocalizeCommandName Method (String)
Rhino for Mac 5.1
 Commands that need to be localized should call this function.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string LocalizeCommandName(
	string english
)
Public Shared Function LocalizeCommandName (
	english As String
) As String
Parameters
english
Type: System.String
The localized command name.
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.UI.Localization.LocalizeCommandName(System.String)"]
See Also
Reference
Localization Class
LocalizeCommandName Overload
Rhino.UI Namespace