RhinoCommon SDK
GumballAppearanceSettings.MenuDistance Property
Rhino for Mac 5.1
Distance of menu ball from center.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int MenuDistance { get; set; }
Public Property MenuDistance As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace