RhinoCommon SDK
Result Enumeration
Rhino for Mac 5.1
 Defines enumerated constant values for several command result types.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum Result
Public Enumeration Result
Members
Member name | Value | Description
Success | 0 | Command worked.
Cancel | 1 | User canceled command.
Nothing | 2 | Command did nothing but cancel was not pressed.
Failure | 3 | Command failed (bad input, computational problem, etc.)
UnknownCommand | 4 | Command not found (user probably had a typo in command name).
CancelModelessDialog | 5 | Commands canceled and modeless dialog.
ExitRhino | 268435455 | exit RhinoCommon.
See Also
Reference
Rhino.Commands Namespace