RhinoCommon SDK
Command.GetMostRecentCommands Method
Rhino for Mac 5.1
 Gets an array of most recent command descriptions.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static MostRecentCommandDescription[] GetMostRecentCommands()
Public Shared Function GetMostRecentCommands As MostRecentCommandDescription()
Return Value
Type: MostRecentCommandDescription[]
An array of command descriptions.
See Also
Reference
Command Class
Rhino.Commands Namespace