RhinoCommon SDK
SimpleArrayMeshPointer.Add Method
Rhino for Mac 5.1
 Adds a mesh to the list.
Namespace: Rhino.Runtime.InteropWrappers
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Add(
	Mesh mesh,
	bool asConst
)
Public Sub Add (
	mesh As Mesh,
	asConst As Boolean
)
Parameters
mesh
Type: Rhino.Geometry.Mesh
A mesh to add.
asConst
Type: System.Boolean
Whether this mesh should be treated as non-modifiable.
See Also
Reference
SimpleArrayMeshPointer Class
Rhino.Runtime.InteropWrappers Namespace