RhinoCommon SDK
GetBaseClass.Option Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetBaseClass.Option"]
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public CommandLineOption Option()
Public Function Option As CommandLineOption
Return Value
Type: CommandLineOption
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetBaseClass.Option"]
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace