RhinoCommon SDK
Curve.ClosedCurveOrientation Method
Rhino for Mac 5.1
Overload List
Name | Description
ClosedCurveOrientation(Plane)
 Determines the orientation (counterclockwise or clockwise) of a closed planar curve in a given plane. Only works with simple (no self intersections) closed planar curves.
ClosedCurveOrientation(Transform)
 Determines the orientation (counterclockwise or clockwise) of a closed planar curve. Only works with simple (no self intersections) closed planar curves.
ClosedCurveOrientation(Vector3d)
 Determines the orientation (counterclockwise or clockwise) of a closed planar curve in a given plane. Only works with simple (no self intersections) closed planar curves.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace