RhinoCommon SDK
GumballDisplayConduit.GumballTransform Property
Rhino for Mac 5.1
 The gumball transformation is the transformation calculated by comparing the current gumball to the starting BaseGumball.
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform GumballTransform { get; }
Public ReadOnly Property GumballTransform As Transform
	Get
Property Value
Type: Transform
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace