RhinoCommon SDK
RhinoViewport.IsVisible Method (BoundingBox)
Rhino for Mac 5.1
 Returns true if some portion of a world coordinate bounding box is potentially visible in the viewing frustum.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsVisible(
	BoundingBox bbox
)
Public Function IsVisible (
	bbox As BoundingBox
) As Boolean
Parameters
bbox
Type: Rhino.Geometry.BoundingBox
A bounding box that is tested for visibility.
Return Value
Type: Boolean
true if the box is potentially visible; otherwise false.
See Also
Reference
RhinoViewport Class
IsVisible Overload
Rhino.Display Namespace