RhinoCommon SDK
ObjectTable.AddPointCloud Method (IEnumerable<Point3d>)
Rhino for Mac 5.1
Adds a point cloud object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddPointCloud(
	IEnumerable<Point3d> points
)
Public Function AddPointCloud (
	points As IEnumerable(Of Point3d)
) As Guid
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable set of points.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddPointCloud Overload
Rhino.DocObjects.Tables Namespace