RhinoCommon SDK
ObjectTable.AddPointCloud Method (IEnumerable<Point3d>, ObjectAttributes, HistoryRecord, Boolean)
Rhino for Mac 5.1
Adds a point cloud object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddPointCloud(
	IEnumerable<Point3d> points,
	ObjectAttributes attributes,
	HistoryRecord history,
	bool reference
)
Public Function AddPointCloud (
	points As IEnumerable(Of Point3d),
	attributes As ObjectAttributes,
	history As HistoryRecord,
	reference As Boolean
) As Guid
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A list, an array or any enumerable set of points
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to point cloud. null is acceptable
history
Type: Rhino.DocObjects.HistoryRecord
history associated with this pointcloud. null is acceptable
reference
Type: System.Boolean
 true if the object is from a reference file. Reference objects do not persist in archives
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddPointCloud Overload
Rhino.DocObjects.Tables Namespace