RhinoCommon SDK
MeshVertexNormalList.UnitizeNormals Method
Rhino for Mac 5.1
 Unitizes all vertex normals.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UnitizeNormals()
Public Function UnitizeNormals As Boolean
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace