RhinoCommon SDK
GetBaseClass.AddOptionList Method
Rhino for Mac 5.1
Overload List
Name | Description
AddOptionList(String, IEnumerable<String>, Int32)
 Adds a command line list option.
AddOptionList(LocalizeStringPair, IEnumerable<LocalizeStringPair>, Int32)
 Adds a command line list option.
Top
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace