RhinoCommon SDK
Unroller.AddFollowingGeometry Method (IEnumerable<Point3d>)
Rhino for Mac 5.1
 Adds points that should be unrolled along with the surface/brep.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddFollowingGeometry(
	IEnumerable<Point3d> points
)
Public Sub AddFollowingGeometry (
	points As IEnumerable(Of Point3d)
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
An array, a list or any enumerable set of points.
See Also
Reference
Unroller Class
AddFollowingGeometry Overload
Rhino.Geometry Namespace