RhinoCommon SDK
FileType Properties
Rhino for Mac 5.1
The FileType type exposes the following members.
Properties
Name | Description
Description
Extension
Top
See Also
Reference
FileType Class
Rhino.FileIO Namespace