RhinoCommon SDK
MeshVertexList.GetVertexFaces Method
Rhino for Mac 5.1
 Gets a list of all of the faces that share a given vertex.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] GetVertexFaces(
	int vertexIndex
)
Public Function GetVertexFaces (
	vertexIndex As Integer
) As Integer()
Parameters
vertexIndex
Type: System.Int32
The index of a vertex in the mesh.
Return Value
Type: Int32[]
An array of indices of faces on success, null on failure.
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace