RhinoCommon SDK
Command.PlugIn Property
Rhino for Mac 5.1
 Gets the plug-in where this commands is placed.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PlugIn PlugIn { get; }
Public ReadOnly Property PlugIn As PlugIn
	Get
Property Value
Type: PlugIn
See Also
Reference
Command Class
Rhino.Commands Namespace