RhinoCommon SDK
ReplayHistoryData.TryGetPoint3d Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetPoint3d(System.Int32,Rhino.Geometry.Point3d@)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetPoint3d(
	int id,
	out Point3d value
)
Public Function TryGetPoint3d (
	id As Integer,
	<OutAttribute> ByRef value As Point3d
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetPoint3d(System.Int32,Rhino.Geometry.Point3d@)"]
value
Type: Rhino.Geometry.Point3d
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetPoint3d(System.Int32,Rhino.Geometry.Point3d@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryData.TryGetPoint3d(System.Int32,Rhino.Geometry.Point3d@)"]
See Also
Reference
ReplayHistoryData Class
Rhino.DocObjects Namespace