RhinoCommon SDK
InstanceDefinitionUpdateType Enumeration
Rhino for Mac 5.1
 The possible relationships between the instance definition geometry and the archive containing the original defition.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public enum InstanceDefinitionUpdateType
Public Enumeration InstanceDefinitionUpdateType
Members
Member name | Value | Description
Static | 0 |  The Rhino user interface uses the term "Embedded" for Static update types. This instance definition is never updated. If m_source_archive is set, it records the origin of the instance definition geometry, but m_source_archive is never used to update the instance definition.
Embedded | 1 |  Obsolete.  This instance definition geometry was imported from another archive (m_source_archive) and is embedded. If m_source_archive changes, the user is asked if they want to update the instance definition.
LinkedAndEmbedded | 2 |  This instance definition geometry was imported from another archive (m_source_archive) and is embedded. If m_source_archive changes, the instance definition is automatically updated. If m_source_archive is not available, the instance definition is still valid.
Linked | 3 |  This instance definition geometry was imported from another archive (m_source_archive) and is not embedded. If m_source_archive changes, the instance definition is automatically updated. If m_source_archive is not available, the instance definition is not valid. This does not save runtime memory. It may save a little disk space, but it is a foolish option requested by people who do not understand all the issues.
See Also
Reference
Rhino.DocObjects Namespace