RhinoCommon SDK
TextLog.PrintWrappedText Method
Rhino for Mac 5.1
 Send text wrapped at a set line length
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void PrintWrappedText(
	string text,
	int lineLength
)
Public Sub PrintWrappedText (
	text As String,
	lineLength As Integer
)
Parameters
text
Type: System.String
[Missing <param name="text"/> documentation for "M:Rhino.FileIO.TextLog.PrintWrappedText(System.String,System.Int32)"]
lineLength
Type: System.Int32
[Missing <param name="lineLength"/> documentation for "M:Rhino.FileIO.TextLog.PrintWrappedText(System.String,System.Int32)"]
See Also
Reference
TextLog Class
Rhino.FileIO Namespace