RhinoCommon SDK
GumballObject.SetFromLine Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromLine(Rhino.Geometry.Line)"]
Namespace: Rhino.UI.Gumball
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetFromLine(
	Line line
)
Public Function SetFromLine (
	line As Line
) As Boolean
Parameters
line
Type: Rhino.Geometry.Line
[Missing <param name="line"/> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromLine(Rhino.Geometry.Line)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Gumball.GumballObject.SetFromLine(Rhino.Geometry.Line)"]
See Also
Reference
GumballObject Class
Rhino.UI.Gumball Namespace