RhinoCommon SDK
MappingTag.MeshTransform Property
Rhino for Mac 5.1
 Gets or sets a 4x4 matrix tranform.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Transform MeshTransform { get; set; }
Public Property MeshTransform As Transform
	Get
	Set
Property Value
Type: Transform
See Also
Reference
MappingTag Class
Rhino.Render Namespace