RhinoCommon SDK
VisualAnalysisMode.Name Property
Rhino for Mac 5.1
 Gets the name of the analysis mode. It is used by the _What command and the object properties details window to describe the object.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract string Name { get; }
Public MustOverride ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace