RhinoCommon SDK
SelCommand Class
Rhino for Mac 5.1
 For adding nestable selection commands that work like the native Rhino SelCrv command, derive your command from SelCommand and override the virtual SelFilter function.
Inheritance Hierarchy
System.Object
 Rhino.Commands.Command
 Rhino.Commands.SelCommand
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public abstract class SelCommand : Command
Public MustInherit Class SelCommand
	Inherits Command
The SelCommand type exposes the following members.
Constructors
Name | Description
SelCommand
Initializes a new instance of the SelCommand class
Top
Properties
Name | Description
BeQuiet
TestGrips
TestLights
Top
Methods
Name | Description
RunCommand |  (Overrides Command.RunCommand(RhinoDoc, RunMode).)
SelFilter
 Override this virtual function and return true if object should be selected.
Top
See Also
Reference
Rhino.Commands Namespace