RhinoCommon SDK
BezierCurve.GetControlVertex3d Method
Rhino for Mac 5.1
Get location of a control vertex.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d GetControlVertex3d(
	int index
)
Public Function GetControlVertex3d (
	index As Integer
) As Point3d
Parameters
index
Type: System.Int32
 Control vertex index (0 <= index < ControlVertexCount)
Return Value
Type: Point3d
 If the bezier is rational, the euclidean location is returned.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | when index is out of range
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace