RhinoCommon SDK
PointCloud.ContainsNormals Property
Rhino for Mac 5.1
 Gets a value indicating whether or not the points in this pointcloud have normals assigned to them.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ContainsNormals { get; }
Public ReadOnly Property ContainsNormals As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace