RhinoCommon SDK
Mesh.ClearTextureData Method
Rhino for Mac 5.1
 Remove all texture coordinate information from this mesh.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void ClearTextureData()
Public Sub ClearTextureData
See Also
Reference
Mesh Class
Rhino.Geometry Namespace