RhinoCommon SDK
NurbsCurvePointList.ControlPolygon Method
Rhino for Mac 5.1
 Constructs a polyline through all the control points. Note that periodic curves generate a closed polyline with fewer points than control-points.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Polyline ControlPolygon()
Public Function ControlPolygon As Polyline
Return Value
Type: Polyline
A polyline connecting all control points.
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace