RhinoCommon SDK
Transform.SimilarityType Property
Rhino for Mac 5.1
 Gets a value indicating whether or not the Transform maintains similarity. The easiest way to think of Similarity is that any circle, when transformed, remains a circle. Whereas a non-similarity Transform deforms circles into ellipses.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public TransformSimilarityType SimilarityType { get; }
Public ReadOnly Property SimilarityType As TransformSimilarityType
	Get
Property Value
Type: TransformSimilarityType
See Also
Reference
Transform Structure
Rhino.Geometry Namespace