RhinoCommon SDK
SweepTwoRail Class
Rhino for Mac 5.1
 Utility class for generating breps by sweeping cross section curves over two rail curves.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SweepTwoRail
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class SweepTwoRail
Public Class SweepTwoRail
The SweepTwoRail type exposes the following members.
Constructors
Name | Description
SweepTwoRail
Initializes a new instance of the SweepTwoRail class
Top
Properties
Name | Description
AngleToleranceRadians
ClosedSweep
 If the input rails are closed, ClosedSweep determines if the swept breps will also be closed.
MaintainHeight
SweepTolerance
Top
Methods
Name | Description
PerformSweep(Curve, Curve, Curve)
PerformSweep(Curve, Curve, IEnumerable<Curve>)
PerformSweep(Curve, Curve, Curve, Double, Double)
PerformSweep(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>)
PerformSweepRebuild(Curve, Curve, Curve, Int32)
PerformSweepRebuild(Curve, Curve, IEnumerable<Curve>, Int32)
PerformSweepRebuild(Curve, Curve, Curve, Double, Double, Int32)
PerformSweepRebuild(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>, Int32)
PerformSweepRefit(Curve, Curve, Curve, Double)
PerformSweepRefit(Curve, Curve, IEnumerable<Curve>, Double)
PerformSweepRefit(Curve, Curve, Curve, Double, Double, Double)
PerformSweepRefit(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>, Double)
Top
See Also
Reference
Rhino.Geometry Namespace