RhinoCommon SDK
ToolbarFileCollection.GetEnumerator Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFileCollection.GetEnumerator"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<ToolbarFile> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of ToolbarFile)
Return Value
Type: IEnumerator<ToolbarFile>
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFileCollection.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
ToolbarFileCollection Class
Rhino.UI Namespace