RhinoCommon SDK
CustomGripObject Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.Custom.CustomGripObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.GripObject
 Rhino.DocObjects.Custom.CustomGripObject
Namespace: Rhino.DocObjects.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class CustomGripObject : GripObject,
	IDisposable
Public Class CustomGripObject
	Inherits GripObject
	Implements IDisposable
The CustomGripObject type exposes the following members.
Constructors
Name | Description
CustomGripObject
Initializes a new instance of the CustomGripObject class
Top
Properties
Name | Description
Index
OriginalLocation
Weight |  (Overrides GripObject.Weight.)
Top
Methods
Name | Description
Dispose()
Releases all resources used by the CustomGripObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomGripObject and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
NewLocation
Top
See Also
Reference
Rhino.DocObjects.Custom Namespace