RhinoCommon SDK
Plane.Rotate Method (Double, Double, Vector3d, Point3d)
Rhino for Mac 5.1
Rotate the plane about a custom anchor point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Rotate(
	double sinAngle,
	double cosAngle,
	Vector3d axis,
	Point3d centerOfRotation
)
Public Function Rotate (
	sinAngle As Double,
	cosAngle As Double,
	axis As Vector3d,
	centerOfRotation As Point3d
) As Boolean
Parameters
sinAngle
Type: System.Double
Sin(angle)
cosAngle
Type: System.Double
Cos(angle)
axis
Type: Rhino.Geometry.Vector3d
Axis of rotation.
centerOfRotation
Type: Rhino.Geometry.Point3d
Center of rotation.
Return Value
Type: Boolean
true on success, false on failure.
See Also
Reference
Plane Structure
Rotate Overload
Rhino.Geometry Namespace