RhinoCommon SDK
GetPoint.PostDrawObjects Event
Rhino for Mac 5.1
 Same as the DisplayPipeline.PostDrawObjects, but only works during the operation of the Get() function. NOTE: You must set FullFrameRedrawDuringGet to true in order for this event to be called.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public event EventHandler<DrawEventArgs> PostDrawObjects
Public Event PostDrawObjects As EventHandler(Of DrawEventArgs)
Value
Type: System.EventHandler<DrawEventArgs>
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace