RhinoCommon SDK
DisplayPipelineAttributes.MeshSpecificAttributes Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.MeshSpecificAttributes"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DisplayPipelineAttributes.MeshDisplayAttributes MeshSpecificAttributes { get; }
Public ReadOnly Property MeshSpecificAttributes As DisplayPipelineAttributes.MeshDisplayAttributes
	Get
Property Value
Type: DisplayPipelineAttributes.MeshDisplayAttributes
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace