RhinoCommon SDK
Brep.CreateFromSurface Method
Rhino for Mac 5.1
 Constructs a Brep from a surface. The resulting Brep has an outer boundary made from four trims. The trims are ordered so that they run along the south, east, north, and then west side of the surface's parameter space.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep CreateFromSurface(
	Surface surface
)
Public Shared Function CreateFromSurface (
	surface As Surface
) As Brep
Parameters
surface
Type: Rhino.Geometry.Surface
A surface to convert.
Return Value
Type: Brep
Resulting brep or null on failure.
See Also
Reference
Brep Class
Rhino.Geometry Namespace