RhinoCommon SDK
HistoryRecord.SetCurve Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.HistoryRecord.SetCurve(System.Int32,Rhino.Geometry.Curve)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetCurve(
	int id,
	Curve value
)
Public Function SetCurve (
	id As Integer,
	value As Curve
) As Boolean
Parameters
id
Type: System.Int32
[Missing <param name="id"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetCurve(System.Int32,Rhino.Geometry.Curve)"]
value
Type: Rhino.Geometry.Curve
[Missing <param name="value"/> documentation for "M:Rhino.DocObjects.HistoryRecord.SetCurve(System.Int32,Rhino.Geometry.Curve)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.HistoryRecord.SetCurve(System.Int32,Rhino.Geometry.Curve)"]
See Also
Reference
HistoryRecord Class
Rhino.DocObjects Namespace