RhinoCommon SDK
StackedDialogPage.OnActivate Method
Rhino for Mac 5.1
Called when this page is activated/deactivated.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public virtual bool OnActivate(
	bool active
)
Public Overridable Function OnActivate (
	active As Boolean
) As Boolean
Parameters
active
Type: System.Boolean
If true then this page is on top otherwise it is about to be hidden.
Return Value
Type: Boolean
 If true then the page is hidden and the requested page is not activated otherwise will not allow you to change the current page. Default returns true
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace