RhinoCommon SDK
BinaryArchiveWriter.WriteVector2d Method
Rhino for Mac 5.1
 Writes a Vector2d value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteVector2d(
	Vector2d value
)
Public Sub WriteVector2d (
	value As Vector2d
)
Parameters
value
Type: Rhino.Geometry.Vector2d
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace