RhinoCommon SDK
BinaryArchiveWriter.WriteVector3d Method
Rhino for Mac 5.1
 Writes a Vector3d value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteVector3d(
	Vector3d value
)
Public Sub WriteVector3d (
	value As Vector3d
)
Parameters
value
Type: Rhino.Geometry.Vector3d
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace