RhinoCommon SDK
BitmapTable.Document Property
Rhino for Mac 5.1
Gets the document that owns this bitmap table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
BitmapTable Class
Rhino.DocObjects.Tables Namespace