RhinoCommon SDK
InstanceObject Methods
Rhino for Mac 5.1
The InstanceObject type exposes the following members.
Methods
Name | Description
Explode
 Explodes the instance reference into pieces.
UsesDefinition
Determine if this reference uses an instance definition
Top
See Also
Reference
InstanceObject Class
Rhino.DocObjects Namespace