RhinoCommon SDK
ObjectTable.AddRhinoObject Method (CustomBrepObject)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomBrepObject)"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void AddRhinoObject(
	CustomBrepObject brepObject
)
Public Sub AddRhinoObject (
	brepObject As CustomBrepObject
)
Parameters
brepObject
Type: Rhino.DocObjects.Custom.CustomBrepObject
[Missing <param name="brepObject"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomBrepObject)"]
See Also
Reference
ObjectTable Class
AddRhinoObject Overload
Rhino.DocObjects.Tables Namespace