RhinoCommon SDK
BrepEdge.AdjacentFaces Method
Rhino for Mac 5.1
 Gets the indices of all the BrepFaces that use this edge.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] AdjacentFaces()
Public Function AdjacentFaces As Integer()
Return Value
Type: Int32[]
[Missing <returns> documentation for "M:Rhino.Geometry.BrepEdge.AdjacentFaces"]
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace