RhinoCommon SDK
Mesh.UnifyNormals Method
Rhino for Mac 5.1
 Attempts to fix inconsistencies in the directions of meshfaces for a mesh. This function does not modify the vertex normals, but rather rearranges the mesh face winding and face normals to make them all consistent. You may want to call Mesh.Normals.ComputeNormals() to recompute vertex normals after calling this functions.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int UnifyNormals()
Public Function UnifyNormals As Integer
Return Value
Type: Int32
number of faces that were modified.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace