RhinoCommon SDK
NurbsCurvePointList.ControlPolygonLength Property
Rhino for Mac 5.1
 Gets the length of the polyline connecting all control points.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double ControlPolygonLength { get; }
Public ReadOnly Property ControlPolygonLength As Double
	Get
Property Value
Type: Double
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace