RhinoCommon SDK
Transform.Equals Method (Object)
Rhino for Mac 5.1
 Determines if another object is a transform and its value equals this transform value.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
Another object.
Return Value
Type: Boolean
true if obj is a transform and has the same value as this transform; otherwise, false.
See Also
Reference
Transform Structure
Equals Overload
Rhino.Geometry Namespace