RhinoCommon SDK
Curve.Offset Method (Plane, Double, Double, CurveOffsetCornerStyle)
Rhino for Mac 5.1
 Offsets this curve. If you have a nice offset, then there will be one entry in the array. If the original curve had kinks or the offset curve had self intersections, you will get multiple segments in the offset_curves[] array.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] Offset(
	Plane plane,
	double distance,
	double tolerance,
	CurveOffsetCornerStyle cornerStyle
)
Public Function Offset (
	plane As Plane,
	distance As Double,
	tolerance As Double,
	cornerStyle As CurveOffsetCornerStyle
) As Curve()
Parameters
plane
Type: Rhino.Geometry.Plane
Offset solution plane.
distance
Type: System.Double
The positive or negative distance to offset.
tolerance
Type: System.Double
The offset or fitting tolerance.
cornerStyle
Type: Rhino.Geometry.CurveOffsetCornerStyle
Corner style for offset kinks.
Return Value
Type: Curve[]
Offset curves on success, null on failure.
See Also
Reference
Curve Class
Offset Overload
Rhino.Geometry Namespace