RhinoCommon SDK
NurbsCurveKnotList.IsClampedEnd Property
Rhino for Mac 5.1
 Gets a value indicating whether or not the knot vector is clamped at the end of the curve. Clamped curves are coincident with the first and last control-point. This requires fully multiple knots.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsClampedEnd { get; }
Public ReadOnly Property IsClampedEnd As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace