RhinoCommon SDK
Material.GetTransparencyTexture Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.GetTransparencyTexture"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Texture GetTransparencyTexture()
Public Function GetTransparencyTexture As Texture
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.GetTransparencyTexture"]
See Also
Reference
Material Class
Rhino.DocObjects Namespace