RhinoCommon SDK
Brep.CreateFromSweep Method (Curve, Curve, Boolean, Double)
Rhino for Mac 5.1
 General 1 rail sweep. If you are not producing the sweep results that you are after, then use the SweepOneRail class with options to generate the swept geometry
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Brep[] CreateFromSweep(
	Curve rail,
	Curve shape,
	bool closed,
	double tolerance
)
Public Shared Function CreateFromSweep (
	rail As Curve,
	shape As Curve,
	closed As Boolean,
	tolerance As Double
) As Brep()
Parameters
rail
Type: Rhino.Geometry.Curve
Rail to sweep shapes along
shape
Type: Rhino.Geometry.Curve
Shape curve
closed
Type: System.Boolean
Only matters if shape is closed
tolerance
Type: System.Double
Tolerance for fitting surface and rails
Return Value
Type: Brep[]
Array of Brep sweep results
See Also
Reference
Brep Class
CreateFromSweep Overload
Rhino.Geometry Namespace