RhinoCommon SDK
Particle.Index Property
Rhino for Mac 5.1
 Index in ParentSystem for this Particle. Can change when the particle system is modified.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Particle Class
Rhino.Geometry Namespace