RhinoCommon SDK
RhinoView.CreateShadedPreviewImage Method
Rhino for Mac 5.1
Creates a bitmap preview image of model.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool CreateShadedPreviewImage(
	string imagePath,
	Size size,
	bool ignoreHighlights,
	bool drawConstructionPlane,
	bool useGhostedShading
)
Public Function CreateShadedPreviewImage (
	imagePath As String,
	size As Size,
	ignoreHighlights As Boolean,
	drawConstructionPlane As Boolean,
	useGhostedShading As Boolean
) As Boolean
Parameters
imagePath
Type: System.String
 [in] The name of the bitmap file to create. The extension of the imagePath controls the format of the bitmap file created (bmp, tga, jpg, pcx, png, tif).
size
Type: System.Drawing.Size
[in] The width and height of the bitmap in pixels.
ignoreHighlights
Type: System.Boolean
true if highlighted elements should be drawn normally.
drawConstructionPlane
Type: System.Boolean
true if the CPlane should be drawn.
useGhostedShading
Type: System.Boolean
true if ghosted shading (partially transparent shading) should be used.
Return Value
Type: Boolean
true if successful.
See Also
Reference
RhinoView Class
Rhino.Display Namespace