RhinoCommon SDK
Point4d.Addition Operator
Rhino for Mac 5.1
 Sums two Point4d together.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point4d operator +(
	Point4d point1,
	Point4d point2
)
Public Shared Operator + (
	point1 As Point4d,
	point2 As Point4d
) As Point4d
Parameters
point1
Type: Rhino.Geometry.Point4d
First point.
point2
Type: Rhino.Geometry.Point4d
Second point.
Return Value
Type: Point4d
A new point that results from the weighted addition of point1 and point2.
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace