RhinoCommon SDK
DimensionStyle.IsReference Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.IsReference"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsReference { get; }
Public ReadOnly Property IsReference As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace