RhinoCommon SDK
PointCloud.AppendNew Method
Rhino for Mac 5.1
 Appends a new PointCloudItem to the end of this point cloud.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public PointCloudItem AppendNew()
Public Function AppendNew As PointCloudItem
Return Value
Type: PointCloudItem
The newly appended item.
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace