RhinoCommon SDK
Color4f.GetHashCode Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.Color4f.GetHashCode"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Display.Color4f.GetHashCode"]
See Also
Reference
Color4f Structure
Rhino.Display Namespace