RhinoCommon SDK
Curve.TryGetPlane Method (Plane, Double)
Rhino for Mac 5.1
Test a curve for planarity and return the plane.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool TryGetPlane(
	out Plane plane,
	double tolerance
)
Public Function TryGetPlane (
	<OutAttribute> ByRef plane As Plane,
	tolerance As Double
) As Boolean
Parameters
plane
Type: Rhino.Geometry.Plane
On success, the plane parameters are filled in.
tolerance
Type: System.Double
Tolerance to use when checking.
Return Value
Type: Boolean
 true if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.
See Also
Reference
Curve Class
TryGetPlane Overload
Rhino.Geometry Namespace