RhinoCommon SDK
LinearDimension.Aligned Property
Rhino for Mac 5.1
 Gets or sets a value indicating whether this annotation is aligned.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Aligned { get; set; }
Public Property Aligned As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace