RhinoCommon SDK
DisplayConduit.DrawOverlay Method
Rhino for Mac 5.1
 If Rhino is in a feedback mode, the draw overlay call allows for temporary geometry to be drawn on top of everything in the scene. This is similar to the dynamic draw routine that occurs with custom get point.
The default implementation does nothing.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void DrawOverlay(
	DrawEventArgs e
)
Protected Overridable Sub DrawOverlay (
	e As DrawEventArgs
)
Parameters
e
Type: Rhino.Display.DrawEventArgs
The event argument contains the current viewport and display state.
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace