RhinoCommon SDK
DisplayPipelineAttributes.MeshDisplayAttributes.ShowMeshWires Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes.ShowMeshWires"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ShowMeshWires { get; set; }
Public Property ShowMeshWires As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes.MeshDisplayAttributes Class
Rhino.Display Namespace