RhinoCommon SDK
NamedConstructionPlaneTable.GetEnumerator Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.NamedConstructionPlaneTable.GetEnumerator"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public IEnumerator<ConstructionPlane> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of ConstructionPlane)
Return Value
Type: IEnumerator<ConstructionPlane>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedConstructionPlaneTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
NamedConstructionPlaneTable Class
Rhino.DocObjects.Tables Namespace