RhinoCommon SDK
Transform.Multiply Operator
Rhino for Mac 5.1
Overload List
Name | Description
Multiply(Transform, Point3d)
 Multiplies a transformation by a point and gets a new point.
Multiply(Transform, Transform)
 Multiplies (combines) two transformations.
Multiply(Transform, Vector3d)
 Multiplies a transformation by a vector and gets a new vector.
Top
See Also
Reference
Transform Structure
Rhino.Geometry Namespace