RhinoCommon SDK
ExtrusionObject Methods
Rhino for Mac 5.1
The ExtrusionObject type exposes the following members.
Methods
Name | Description
DuplicateExtrusionGeometry
Top
See Also
Reference
ExtrusionObject Class
Rhino.DocObjects Namespace