RhinoCommon SDK
File3dmWriteOptions Constructor
Rhino for Mac 5.1
 Initializes properties to defaults
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public File3dmWriteOptions()
Public Sub New
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace