RhinoCommon SDK
DetailViewObject.Viewport Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.DetailViewObject.Viewport"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoViewport Viewport { get; }
Public ReadOnly Property Viewport As RhinoViewport
	Get
Property Value
Type: RhinoViewport
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace