RhinoCommon SDK
BoundingBox.ToBrep Method
Rhino for Mac 5.1
 Constructs a Brep representation of this boundingbox.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Brep ToBrep()
Public Function ToBrep As Brep
Return Value
Type: Brep
If this operation is sucessfull, a Brep representation of this box; otherwise null.
Examples
partial class Examples
{
  public static Rhino.Commands.Result AddBrepBox(Rhino.RhinoDoc doc)
  {
    Rhino.Geometry.Point3d pt0 = new Rhino.Geometry.Point3d(0, 0, 0);
    Rhino.Geometry.Point3d pt1 = new Rhino.Geometry.Point3d(10, 10, 10);
    Rhino.Geometry.BoundingBox box = new Rhino.Geometry.BoundingBox(pt0, pt1);
    Rhino.Geometry.Brep brep = box.ToBrep();
    Rhino.Commands.Result rc = Rhino.Commands.Result.Failure;
    if( doc.Objects.AddBrep(brep) != System.Guid.Empty )
    {
      rc = Rhino.Commands.Result.Success;
      doc.Views.Redraw();
    }
    return rc;
  }
}
Partial Class Examples
  Public Shared Function AddBrepBox(ByVal doc As Rhino.RhinoDoc) As Rhino.Commands.Result
    Dim pt0 As New Rhino.Geometry.Point3d(0, 0, 0)
    Dim pt1 As New Rhino.Geometry.Point3d(10, 10, 10)
    Dim box As New Rhino.Geometry.BoundingBox(pt0, pt1)
    Dim brep As Rhino.Geometry.Brep = box.ToBrep()
    Dim rc As Rhino.Commands.Result = Rhino.Commands.Result.Failure
    If doc.Objects.AddBrep(brep) <> System.Guid.Empty Then
      rc = Rhino.Commands.Result.Success
      doc.Views.Redraw()
    End If
    Return rc
  End Function
End Class
import Rhino
import scriptcontext
import System.Guid
def AddBrepBox():
    pt0 = Rhino.Geometry.Point3d(0, 0, 0)
    pt1 = Rhino.Geometry.Point3d(10, 10, 10)
    box = Rhino.Geometry.BoundingBox(pt0, pt1)
    brep = box.ToBrep()
    rc = Rhino.Commands.Result.Failure
    if( scriptcontext.doc.Objects.AddBrep(brep) != System.Guid.Empty ):
        rc = Rhino.Commands.Result.Success
        scriptcontext.doc.Views.Redraw()
    return rc
if( __name__ == "__main__" ):
    AddBrepBox()
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace