RhinoCommon SDK
Command.ReplayHistory Method
Rhino for Mac 5.1
 Repeats an operation of a command.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual bool ReplayHistory(
	ReplayHistoryData replayData
)
Protected Overridable Function ReplayHistory (
	replayData As ReplayHistoryData
) As Boolean
Parameters
replayData
Type: Rhino.DocObjects.ReplayHistoryData
The replay history information.
Return Value
Type: Boolean
true if the operation succeeded.
The default implementation always returns false.
See Also
Reference
Command Class
Rhino.Commands Namespace