RhinoCommon SDK
Curve.DerivativeAt Method
Rhino for Mac 5.1
Overload List
Name | Description
DerivativeAt(Double, Int32)
 Evaluate the derivatives at the specified curve parameter.
DerivativeAt(Double, Int32, CurveEvaluationSide)
 Evaluate the derivatives at the specified curve parameter.
Top
See Also
Reference
Curve Class
Rhino.Geometry Namespace