RhinoCommon SDK
EarthAnchorPoint.EarthBasepointElevationZero Property
Rhino for Mac 5.1
 Gets or sets a value indicating the zero level convention relating to a location on Earth.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BasepointZero EarthBasepointElevationZero { get; set; }
Public Property EarthBasepointElevationZero As BasepointZero
	Get
	Set
Property Value
Type: BasepointZero
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace