RhinoCommon SDK
Rectangle3d Constructor (Plane, Interval, Interval)
Rhino for Mac 5.1
 Initializes a new rectangle from dimensions.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Rectangle3d(
	Plane plane,
	Interval width,
	Interval height
)
Public Sub New (
	plane As Plane,
	width As Interval,
	height As Interval
)
Parameters
plane
Type: Rhino.Geometry.Plane
Base plane for Rectangle.
width
Type: Rhino.Geometry.Interval
Dimension of rectangle along the base plane x-axis.
height
Type: Rhino.Geometry.Interval
Dimension of rectangle along the base plane y-axis.
See Also
Reference
Rectangle3d Structure
Rectangle3d Overload
Rhino.Geometry Namespace