RhinoCommon SDK
MeshFaceList.AddFaces Method
Rhino for Mac 5.1
 Appends a list of faces to the end of the mesh face list.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int[] AddFaces(
	IEnumerable<MeshFace> faces
)
Public Function AddFaces (
	faces As IEnumerable(Of MeshFace)
) As Integer()
Parameters
faces
Type: System.Collections.Generic.IEnumerable<MeshFace>
Faces to add.
Return Value
Type: Int32[]
Indices of the newly created faces
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace