RhinoCommon SDK
Polyline Class
Rhino for Mac 5.1
 Represents an ordered set of points connected by linear segments.
Polylines are closed if start and end points coincide.
Inheritance Hierarchy
System.Object
 Rhino.Collections.RhinoList<Point3d>
 Rhino.Collections.Point3dList
 Rhino.Geometry.Polyline
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
[SerializableAttribute]
public class Polyline : Point3dList
<SerializableAttribute>
Public Class Polyline
	Inherits Point3dList
The Polyline type exposes the following members.
Constructors
Name | Description
Polyline()
 Initializes a new empty polyline.
Polyline(Int32)
 Initializes a new empty polyline with an initial capacity.
Polyline(IEnumerable<Point3d>)
 Initializes a new polyline from a collection of points.
Top
Properties
Name | Description
IsClosed
 Gets a value that indicates whether this polyline is closed.
The polyline is considered to be closed if its start is identical to its endpoint.
IsValid
 Gets a value that indicates whether this polyline is valid.
Valid polylines have at least one segment, no Invalid points and no zero length segments.
Closed polylines with only two segments are also not considered valid.
Length
 Gets the total length of the polyline.
SegmentCount
 Gets the number of segments for this polyline.
Top
Methods
Name | Description
BreakAtAngles
 Breaks this polyline into sections at sharp kinks. Closed polylines will also be broken at the first and last vertex.
CenterPoint
 Compute the center point of the polyline as the weighted average of all segments.
ClosestParameter
 Gets the parameter along the polyline which is closest to a test-point.
ClosestPoint
 Gets the point on the polyline which is closest to a test-point.
CollapseShortSegments
 Collapses all segments until none are shorter than tolerance. This function is significantly slower than DeleteShortSegments, since it recursively operates on the shortest segment. When a segment is collapsed the end-points are placed in the center of the segment.
DeleteShortSegments
 Removes all points that are closer than tolerance to the previous point.
Start and end points are left intact.
GetSegments
 Constructs an array of line segments that make up the entire polyline.
IsClosedWithinTolerance
 Determines whether the polyline is closed, provided a tolerance value.
PointAt
 Gets the point on the polyline at the given parameter. The integer part of the parameter indicates the index of the segment.
ReduceSegments
 Constructs a reduction of this polyline by recursively removing the least significant segments.
SegmentAt
 Gets the line segment at the given index.
Smooth
 Smoothens the polyline segments by averaging adjacent vertices. Smoothing requires a polyline with exclusively valid vertices.
TangentAt
 Gets the unit tangent vector along the polyline at the given parameter. The integer part of the parameter indicates the index of the segment.
ToNurbsCurve
 Constructs a nurbs curve representation of this polyline.
TriangulateClosedPolyline
 Attempts to create a list of triangles which represent a triangulation of a closed polyline
Trim
 Constructs a polyline out of a parameter subdomain in this curve.
Top
See Also
Reference
Rhino.Geometry Namespace