RhinoCommon SDK
Curve.IsShort Method (Double, Interval)
Rhino for Mac 5.1
Used to quickly find short curves.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsShort(
	double tolerance,
	Interval subdomain
)
Public Function IsShort (
	tolerance As Double,
	subdomain As Interval
) As Boolean
Parameters
tolerance
Type: System.Double
Length threshold value for "shortness".
subdomain
Type: Rhino.Geometry.Interval
 The test is performed on the interval that is the intersection of subdomain with Domain()
Return Value
Type: Boolean
true if the length of the curve is <= tolerance.
Remarks
Faster than calling Length() and testing the result.
See Also
Reference
Curve Class
IsShort Overload
Rhino.Geometry Namespace