RhinoCommon SDK
ZBufferCapture.GrayscaleDib Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.GrayscaleDib"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Bitmap GrayscaleDib()
Public Function GrayscaleDib As Bitmap
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.Display.ZBufferCapture.GrayscaleDib"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace