RhinoCommon SDK
CommandEventArgs.CommandPluginName Property
Rhino for Mac 5.1
 Gets the name of the plug-in that this command belongs to. If the command is internal to Rhino, then this propert is an empty string.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string CommandPluginName { get; }
Public ReadOnly Property CommandPluginName As String
	Get
Property Value
Type: String
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace