RhinoCommon SDK
ArcCurve.AngleRadians Property
Rhino for Mac 5.1
 Gets the angles of this arc in radians.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double AngleRadians { get; }
Public ReadOnly Property AngleRadians As Double
	Get
Property Value
Type: Double
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace