RhinoCommon SDK
ViewportInfo.SetCameraUp Method
Rhino for Mac 5.1
 Sets the camera up vector.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool SetCameraUp(
	Vector3d up
)
Public Function SetCameraUp (
	up As Vector3d
) As Boolean
Parameters
up
Type: Rhino.Geometry.Vector3d
A new direction.
Return Value
Type: Boolean
true if the direction was set; otherwise false.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace