RhinoCommon SDK
BinaryArchiveReader.BeginRead3dmChunk Method (UInt32, Int32, Int32)
Rhino for Mac 5.1
 Begins reading a chunk that must be in the archive at this location.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool BeginRead3dmChunk(
	uint expectedTypeCode,
	out int majorVersion,
	out int minorVersion
)
Public Function BeginRead3dmChunk (
	expectedTypeCode As UInteger,
	<OutAttribute> ByRef majorVersion As Integer,
	<OutAttribute> ByRef minorVersion As Integer
) As Boolean
Parameters
expectedTypeCode
Type: System.UInt32
[Missing <param name="expectedTypeCode"/> documentation for "M:Rhino.FileIO.BinaryArchiveReader.BeginRead3dmChunk(System.UInt32,System.Int32@,System.Int32@)"]
majorVersion
Type: System.Int32
[Missing <param name="majorVersion"/> documentation for "M:Rhino.FileIO.BinaryArchiveReader.BeginRead3dmChunk(System.UInt32,System.Int32@,System.Int32@)"]
minorVersion
Type: System.Int32
[Missing <param name="minorVersion"/> documentation for "M:Rhino.FileIO.BinaryArchiveReader.BeginRead3dmChunk(System.UInt32,System.Int32@,System.Int32@)"]
Return Value
Type: Boolean
 True if beginning of the chunk was read. In this case you must call EndRead3dmChunk(), even if something goes wrong while you attempt to read the interior of the chunk. False if the chunk did not exist at the current location in the file.
See Also
Reference
BinaryArchiveReader Class
BeginRead3dmChunk Overload
Rhino.FileIO Namespace