RhinoCommon SDK
Extrusion.GetWireframe Method
Rhino for Mac 5.1
 Constructs all the Wireframe curves for this Extrusion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Curve[] GetWireframe()
Public Function GetWireframe As Curve()
Return Value
Type: Curve[]
An array of Wireframe curves.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace