RhinoCommon SDK
RhinoGet.GetPolyline Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetPolyline(Rhino.Geometry.Polyline@)"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetPolyline(
	out Polyline polyline
)
Public Shared Function GetPolyline (
	<OutAttribute> ByRef polyline As Polyline
) As Result
Parameters
polyline
Type: Rhino.Geometry.Polyline
[Missing <param name="polyline"/> documentation for "M:Rhino.Input.RhinoGet.GetPolyline(Rhino.Geometry.Polyline@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetPolyline(Rhino.Geometry.Polyline@)"]
See Also
Reference
RhinoGet Class
Rhino.Input Namespace