RhinoCommon SDK
ConstructionPlane.GridXColor Property
Rhino for Mac 5.1
 Gets or sets the color of the grid X-axis mark.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color GridXColor { get; set; }
Public Property GridXColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace