RhinoCommon SDK
Cylinder.Unset Property
Rhino for Mac 5.1
 Gets an invalid Cylinder.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Cylinder Unset { get; }
Public Shared ReadOnly Property Unset As Cylinder
	Get
Property Value
Type: Cylinder
See Also
Reference
Cylinder Structure
Rhino.Geometry Namespace