RhinoCommon SDK
Brep.Surfaces Property
Rhino for Mac 5.1
 Parametric surfaces used by faces
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepSurfaceList Surfaces { get; }
Public ReadOnly Property Surfaces As BrepSurfaceList
	Get
Property Value
Type: BrepSurfaceList
See Also
Reference
Brep Class
Rhino.Geometry Namespace