RhinoCommon SDK
Point2f Operators
Rhino for Mac 5.1
The Point2f type exposes the following members.
Operators
Name | Description
Equality
 Determines whether two Point2f have equal values.
GreaterThan
 Determines whether the first specified Point2f comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
GreaterThanOrEqual
 Determines whether the first specified Point2f comes after (has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
Inequality
 Determines whether two Point2f have different values.
LessThan
 Determines whether the first specified Point2f comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
LessThanOrEqual
 Determines whether the first specified Point2f comes before (has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
Top
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace