RhinoCommon SDK
Point3f Operators
Rhino for Mac 5.1
The Point3f type exposes the following members.
Operators
Name | Description
Equality
 Determines whether two points have equal values.
GreaterThan
 Determines whether the first specified point comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
GreaterThanOrEqual
 Determines whether the first specified point comes after (has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then Z.
Inequality
 Determines whether two points have different values.
LessThan
 Determines whether the first specified point comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
LessThanOrEqual
 Determines whether the first specified point comes before (has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then Z.
Subtraction
 Subtracts a point from another point.
Top
See Also
Reference
Point3f Structure
Rhino.Geometry Namespace