RhinoCommon SDK
BrepEdgeList.Add Method (Int32)
Rhino for Mac 5.1
 Create and add a new edge to this list
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepEdge Add(
	int curve3dIndex
)
Public Function Add (
	curve3dIndex As Integer
) As BrepEdge
Parameters
curve3dIndex
Type: System.Int32
[Missing <param name="curve3dIndex"/> documentation for "M:Rhino.Geometry.Collections.BrepEdgeList.Add(System.Int32)"]
Return Value
Type: BrepEdge
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.BrepEdgeList.Add(System.Int32)"]
See Also
Reference
BrepEdgeList Class
Add Overload
Rhino.Geometry.Collections Namespace