RhinoCommon SDK
BrepEdgeList.Add Method (Int32, Int32, Int32, Double)
Rhino for Mac 5.1
 Create and add a new edge to this list
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepEdge Add(
	int startVertexIndex,
	int endVertexIndex,
	int curve3dIndex,
	double edgeTolerance
)
Public Function Add (
	startVertexIndex As Integer,
	endVertexIndex As Integer,
	curve3dIndex As Integer,
	edgeTolerance As Double
) As BrepEdge
Parameters
startVertexIndex
Type: System.Int32
[Missing <param name="startVertexIndex"/> documentation for "M:Rhino.Geometry.Collections.BrepEdgeList.Add(System.Int32,System.Int32,System.Int32,System.Double)"]
endVertexIndex
Type: System.Int32
[Missing <param name="endVertexIndex"/> documentation for "M:Rhino.Geometry.Collections.BrepEdgeList.Add(System.Int32,System.Int32,System.Int32,System.Double)"]
curve3dIndex
Type: System.Int32
[Missing <param name="curve3dIndex"/> documentation for "M:Rhino.Geometry.Collections.BrepEdgeList.Add(System.Int32,System.Int32,System.Int32,System.Double)"]
edgeTolerance
Type: System.Double
[Missing <param name="edgeTolerance"/> documentation for "M:Rhino.Geometry.Collections.BrepEdgeList.Add(System.Int32,System.Int32,System.Int32,System.Double)"]
Return Value
Type: BrepEdge
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.BrepEdgeList.Add(System.Int32,System.Int32,System.Int32,System.Double)"]
See Also
Reference
BrepEdgeList Class
Add Overload
Rhino.Geometry.Collections Namespace