RhinoCommon SDK
ReplayHistoryResult.UpdateToPoint Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToPoint(Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToPoint(
	Point3d point,
	ObjectAttributes attributes
)
Public Function UpdateToPoint (
	point As Point3d,
	attributes As ObjectAttributes
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point3d
[Missing <param name="point"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToPoint(Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToPoint(Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToPoint(Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace