RhinoCommon SDK
BezierCurve.PointAt Method
Rhino for Mac 5.1
Evaluates point at a curve parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3d PointAt(
	double t
)
Public Function PointAt (
	t As Double
) As Point3d
Parameters
t
Type: System.Double
Evaluation parameter.
Return Value
Type: Point3d
Point (location of curve at the parameter t).
Remarks
No error handling.
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace