RhinoCommon SDK
ReplayHistoryResult.UpdateToBrep Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool UpdateToBrep(
	Brep brep,
	ObjectAttributes attributes
)
Public Function UpdateToBrep (
	brep As Brep,
	attributes As ObjectAttributes
) As Boolean
Parameters
brep
Type: Rhino.Geometry.Brep
[Missing <param name="brep"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace