RhinoCommon SDK
CachedTextureCoordinates.CopyTo Method
Rhino for Mac 5.1
 Copies the elements of the this collection to an System.Array, starting at a particular System.Array index.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void CopyTo(
	Point3d[] array,
	int arrayIndex
)
Public Sub CopyTo (
	array As Point3d(),
	arrayIndex As Integer
)
Parameters
array
Type: Rhino.Geometry.Point3d[]
 The one-dimensional System.Array that is the destination of the elements copied from this collection. The System.Array must have zero-based indexing.
arrayIndex
Type: System.Int32
 The zero-based index in array at which copying begins.
Implements
ICollection<T>.CopyTo(T[], Int32)
Exceptions
Exception | Condition
ArgumentNullException |  array is null
ArgumentOutOfRangeException |  arrayIndex is less than 0.
ArgumentException |  The number of elements in this collection is greater than the available space from arrayIndex to the end of the destination array.
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace