RhinoCommon SDK
RhinoGet.GetFileNameScripted Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Input.RhinoGet.GetFileNameScripted(Rhino.Input.Custom.GetFileNameMode,System.String)"]
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string GetFileNameScripted(
	GetFileNameMode mode,
	string defaultName
)
Public Shared Function GetFileNameScripted (
	mode As GetFileNameMode,
	defaultName As String
) As String
Parameters
mode
Type: Rhino.Input.Custom.GetFileNameMode
[Missing <param name="mode"/> documentation for "M:Rhino.Input.RhinoGet.GetFileNameScripted(Rhino.Input.Custom.GetFileNameMode,System.String)"]
defaultName
Type: System.String
[Missing <param name="defaultName"/> documentation for "M:Rhino.Input.RhinoGet.GetFileNameScripted(Rhino.Input.Custom.GetFileNameMode,System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Input.RhinoGet.GetFileNameScripted(Rhino.Input.Custom.GetFileNameMode,System.String)"]
See Also
Reference
RhinoGet Class
Rhino.Input Namespace