RhinoCommon SDK
File3dmNotes Class
Rhino for Mac 5.1
 Represents the notes information stored in a 3dm file.
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmNotes
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class File3dmNotes
Public Class File3dmNotes
The File3dmNotes type exposes the following members.
Constructors
Name | Description
File3dmNotes
 Creates empty default notes
Top
Properties
Name | Description
IsHtml
 Gets or sets the text format. If the format is HTML, true; false otherwise.
IsVisible
 Gets or sets the notes visibility. If the notes are visible, true; false otherwise.
Notes
 Gets or sets the text content of the notes.
WindowRectangle
 Gets or sets the position of the Notes when they were saved.
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.FileIO Namespace