RhinoCommon SDK
IDialogService.ShowCheckListBox Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.IDialogService.ShowCheckListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.Boolean})"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
bool[] ShowCheckListBox(
	string title,
	string message,
	IList items,
	IList<bool> checkState
)
Function ShowCheckListBox (
	title As String,
	message As String,
	items As IList,
	checkState As IList(Of Boolean)
) As Boolean()
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.IDialogService.ShowCheckListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.Boolean})"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.IDialogService.ShowCheckListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.Boolean})"]
items
Type: System.Collections.IList
[Missing <param name="items"/> documentation for "M:Rhino.UI.IDialogService.ShowCheckListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.Boolean})"]
checkState
Type: System.Collections.Generic.IList<Boolean>
[Missing <param name="checkState"/> documentation for "M:Rhino.UI.IDialogService.ShowCheckListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.Boolean})"]
Return Value
Type: Boolean[]
[Missing <returns> documentation for "M:Rhino.UI.IDialogService.ShowCheckListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.Boolean})"]
See Also
Reference
IDialogService Interface
Rhino.UI Namespace