RhinoCommon SDK
DisplayModeDescription.Id Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.Id"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace