RhinoCommon SDK
RhinoGet.GetInteger Method (String, Boolean, Int32)
Rhino for Mac 5.1
 Easy to use number getter.
Namespace: Rhino.Input
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Result GetInteger(
	string prompt,
	bool acceptNothing,
	ref int outputNumber
)
Public Shared Function GetInteger (
	prompt As String,
	acceptNothing As Boolean,
	ByRef outputNumber As Integer
) As Result
Parameters
prompt
Type: System.String
command prompt.
acceptNothing
Type: System.Boolean
if true, the user can press enter.
outputNumber
Type: System.Int32
 default number is set to this value and number value returned here.
Return Value
Type: Result
 Commands.Result.Success - got number Commands.Result.Nothing - user pressed enter Commands.Result.Cancel - user cancel number getting.
See Also
Reference
RhinoGet Class
GetInteger Overload
Rhino.Input Namespace