RhinoCommon SDK
ViewportInfo.IsTwoPointPerspectiveProjection Property
Rhino for Mac 5.1
 Gets a value that indicates whether this projection is a two-point perspective.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool IsTwoPointPerspectiveProjection { get; }
Public ReadOnly Property IsTwoPointPerspectiveProjection As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace