RhinoCommon SDK
BrepVertexList.AddPointOnFace Method
Rhino for Mac 5.1
Adds a new point on face to the brep
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepVertex AddPointOnFace(
	BrepFace face,
	double s,
	double t
)
Public Function AddPointOnFace (
	face As BrepFace,
	s As Double,
	t As Double
) As BrepVertex
Parameters
face
Type: Rhino.Geometry.BrepFace
face that vertex lies on
s
Type: System.Double
surface parameters
t
Type: System.Double
surface parameters
Return Value
Type: BrepVertex
new vertex that represents the point on face
Remarks
 If a vertex is a point on a face, then brep.Edges[m_ei] will be an edge with no 3d curve. This edge will have a single trim with type ON_BrepTrim::ptonsrf. There will be a loop containing this single trim.
See Also
Reference
BrepVertexList Class
Rhino.Geometry.Collections Namespace