RhinoCommon SDK
File3dmObjectTable.AddSurface Method (Surface)
Rhino for Mac 5.1
Adds a surface object to Rhino.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddSurface(
	Surface surface
)
Public Function AddSurface (
	surface As Surface
) As Guid
Parameters
surface
Type: Rhino.Geometry.Surface
A duplicate of this surface is added to Rhino.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddSurface Overload
Rhino.FileIO Namespace