RhinoCommon SDK
HatchPatternTable Class
Rhino for Mac 5.1
 All of the hatch pattern definitions contained in a rhino document.
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.HatchPatternTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public sealed class HatchPatternTable : IEnumerable<HatchPattern>,
	IEnumerable
Public NotInheritable Class HatchPatternTable
	Implements IEnumerable(Of HatchPattern), IEnumerable
The HatchPatternTable type exposes the following members.
Properties
Name | Description
Count
Number of patterns in the table.
CurrentHatchPatternIndex
 At all times, there is a "current" hatch pattern. Unless otherwise specified, new objects are assigned to the current hatch pattern. The current hatch pattern is never locked, hidden, or deleted.
Document
Document that owns this table.
Item
 Conceptually, the hatch pattern table is an array of hatch patterns. The operator[] can be used to get individual hatch patterns. A hatch pattern is either active or deleted and this state is reported by HatchPattern.IsDeleted.
Top
Methods
Name | Description
Add
 Adds a new hatch pattern with specified definition to the table.
Find
 Finds the hatch pattern with a given name. Search ignores case.
GetEnumerator
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace