RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_RENDER Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_RENDER"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SETTINGS_RENDER
Public Const TCODE_SETTINGS_RENDER As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace