RhinoCommon API
File3dmTypeCodes.TCODE_ENDOFFILE_GOO Field
 (0x00007FFE) this typecode is returned when a rogue eof marker is found Some v1 3dm file writers put these markers in a "goo". Simply skip these chunks and continue.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_ENDOFFILE_GOO = 32766
Public Const TCODE_ENDOFFILE_GOO As UInteger = 32766
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace