RhinoCommon API
File3dmTypeCodes.TCODE_VIEW_DISPLAYMODE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_DISPLAYMODE"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW_DISPLAYMODE = 2684356923
Public Const TCODE_VIEW_DISPLAYMODE As UInteger = 2684356923
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace