RhinoCommon API
RenderWindow.ChannelGPU.m_cpp Field
[Missing <summary> documentation for "F:Rhino.Render.RenderWindow.ChannelGPU.m_cpp"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected IntPtr m_cpp
Protected m_cpp As IntPtr
Field Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace