RhinoCommon SDK
File3dmTypeCodes.TCODE_OPENNURBS_CLASS_END Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OPENNURBS_CLASS_END"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_OPENNURBS_CLASS_END
Public Const TCODE_OPENNURBS_CLASS_END As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace