RhinoCommon API
File3dmTypeCodes.TCODE_LIGHT_TABLE Field
rendering lights.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_LIGHT_TABLE = 268435474
Public Const TCODE_LIGHT_TABLE As UInteger = 268435474
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace