RhinoCommon API
File3dmTypeCodes.TCODE_SETTINGS_CURRENT_WIRE_DENSITY Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_CURRENT_WIRE_DENSITY"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SETTINGS_CURRENT_WIRE_DENSITY = 2684354620
Public Const TCODE_SETTINGS_CURRENT_WIRE_DENSITY As UInteger = 2684354620
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace