RhinoCommon API
File3dmTypeCodes.TCODE_SETTINGS_ANALYSISMESH Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_ANALYSISMESH"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SETTINGS_ANALYSISMESH = 536903731
Public Const TCODE_SETTINGS_ANALYSISMESH As UInteger = 536903731
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace