RhinoCommon API
File3dmTypeCodes.TCODE_SETTINGS_CURRENT_DIMSTYLE_INDEX Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_CURRENT_DIMSTYLE_INDEX"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_SETTINGS_CURRENT_DIMSTYLE_INDEX = 2684354867
Public Const TCODE_SETTINGS_CURRENT_DIMSTYLE_INDEX As UInteger = 2684354867
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace