RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_NAMED_CPLANE_LIST Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_NAMED_CPLANE_LIST"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SETTINGS_NAMED_CPLANE_LIST
Public Const TCODE_SETTINGS_NAMED_CPLANE_LIST As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace