RhinoCommon SDK
File3dmTypeCodes.TCODE_BUMPMAP Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_BUMPMAP"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_BUMPMAP
Public Const TCODE_BUMPMAP As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace