RhinoCommon SDK
RenderMaterial.BasicMaterialParameterNames.Reflectivity Field
[Missing <summary> documentation for "F:Rhino.Render.RenderMaterial.BasicMaterialParameterNames.Reflectivity"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const string Reflectivity
Public Const Reflectivity As String
Field Value
Type: String
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace