RhinoCommon API
File3dmTypeCodes.TCODE_OPENNURBS_OBJECT Field
0x00020000.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_OPENNURBS_OBJECT = 131072
Public Const TCODE_OPENNURBS_OBJECT As UInteger = 131072
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace