RhinoCommon API
PostEffectPlugIn.uf_ProductionRendering Field
[Missing <summary> documentation for "F:Rhino.Render.PostEffects.PostEffectPlugIn.uf_ProductionRendering"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly uint uf_ProductionRendering
Public Shared ReadOnly uf_ProductionRendering As UInteger
Field Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace