RhinoCommon API
File3dmTypeCodes.TCODE_RHINOIO_OBJECT_DATA Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_RHINOIO_OBJECT_DATA"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_RHINOIO_OBJECT_DATA = 196606
Public Const TCODE_RHINOIO_OBJECT_DATA As UInteger = 196606
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace