RhinoCommon SDK
File3dmTypeCodes.TCODE_VIEWPORT_DISPLAY_MODE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEWPORT_DISPLAY_MODE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_VIEWPORT_DISPLAY_MODE
Public Const TCODE_VIEWPORT_DISPLAY_MODE As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace