RhinoCommon API
File3dmTypeCodes.TCODE_VIEW_TARGET Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_VIEW_TARGET"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_VIEW_TARGET = 536905787
Public Const TCODE_VIEW_TARGET As UInteger = 536905787
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace