RhinoCommon SDK
File3dmTypeCodes.TCODE_OBJECT_RECORD_TYPE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_OBJECT_RECORD_TYPE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_OBJECT_RECORD_TYPE
Public Const TCODE_OBJECT_RECORD_TYPE As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace