RhinoCommon API
File3dmTypeCodes.TCODE_MAXIMIZED_VIEWPORT Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_MAXIMIZED_VIEWPORT"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_MAXIMIZED_VIEWPORT = 2181038097
Public Const TCODE_MAXIMIZED_VIEWPORT As UInteger = 2181038097
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace