RhinoCommon SDK
File3dmTypeCodes.TCODE_SETTINGS_CURRENT_LAYER_INDEX Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_SETTINGS_CURRENT_LAYER_INDEX"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_SETTINGS_CURRENT_LAYER_INDEX
Public Const TCODE_SETTINGS_CURRENT_LAYER_INDEX As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace