RhinoCommon API
PostEffectPipeline.ncf_None Field
[Missing <summary> documentation for "F:Rhino.Render.PostEffects.PostEffectPipeline.ncf_None"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly uint ncf_None
Public Shared ReadOnly ncf_None As UInteger
Field Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace