RhinoCommon API
File3dmTypeCodes.TCODE_USER Field
0x40000000.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_USER = 1073741824
Public Const TCODE_USER As UInteger = 1073741824
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace