RhinoCommon API
File3dmTypeCodes.TCODE_TOLERANCE Field
0x08000000.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_TOLERANCE = 134217728
Public Const TCODE_TOLERANCE As UInteger = 134217728
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace