RhinoCommon API
File3dmTypeCodes.TCODE_MESH_OBJECT Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_MESH_OBJECT"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_MESH_OBJECT = 1048597
Public Const TCODE_MESH_OBJECT As UInteger = 1048597
Field Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace