RhinoCommon API
PostEffectPlugIn.uf_ViewportDisplay Field
[Missing <summary> documentation for "F:Rhino.Render.PostEffects.PostEffectPlugIn.uf_ViewportDisplay"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly uint uf_ViewportDisplay
Public Shared ReadOnly uf_ViewportDisplay As UInteger
Field Value
Type: UInt32
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace