RhinoCommon SDK
File3dmTypeCodes.TCODE_HATCHPATTERN_TABLE Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_HATCHPATTERN_TABLE"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_HATCHPATTERN_TABLE
Public Const TCODE_HATCHPATTERN_TABLE As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace