RhinoCommon SDK
File3dmTypeCodes.TCODE_COMPRESSED_MESH_GEOMETRY Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_COMPRESSED_MESH_GEOMETRY"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public const uint TCODE_COMPRESSED_MESH_GEOMETRY
Public Const TCODE_COMPRESSED_MESH_GEOMETRY As UInteger
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace