RhinoCommon API
PostEffectPlugIn.uf_RealtimeRendering Field
[Missing <summary> documentation for "F:Rhino.Render.PostEffects.PostEffectPlugIn.uf_RealtimeRendering"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static readonly uint uf_RealtimeRendering
Public Shared ReadOnly uf_RealtimeRendering As UInteger
Field Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace