RhinoCommon API
RenderWindow.Channel.m_pChannel Field
[Missing <summary> documentation for "F:Rhino.Render.RenderWindow.Channel.m_pChannel"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected IntPtr m_pChannel
Protected m_pChannel As IntPtr
Field Value
Type: IntPtr
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace