RhinoCommon API
Channel.m_cpp Field
[Missing <summary> documentation for "F:Rhino.Render.PostEffects.Channel.m_cpp"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected IntPtr m_cpp
Protected m_cpp As IntPtr
Field Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Channel Class
Rhino.Render.PostEffects Namespace