RhinoCommon API
File3dmTypeCodes.TCODE_XDATA Field
[Missing <summary> documentation for "F:Rhino.FileIO.File3dmTypeCodes.TCODE_XDATA"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public const uint TCODE_XDATA = 1073741825
Public Const TCODE_XDATA As UInteger = 1073741825
Field Value
Type: UInt32
See Also
Reference
File3dmTypeCodes Class
Rhino.FileIO Namespace