RhinoCommon SDK
DisplayBitmapDrawList.SetPoints Method
Rhino for Mac 5.1
Overload List
Name | Description
SetPoints(IEnumerable<Point3d>)
SetPoints(IEnumerable<Point3d>, IEnumerable<Color>)
SetPoints(IEnumerable<Point3d>, Color)
Top
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace