RhinoCommon SDK
DisplayPipeline.FrameSize Property
Rhino for Mac 5.1
 Gets the size of the framebuffer that this pipeline is drawing to.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Size FrameSize { get; }
Public ReadOnly Property FrameSize As Size
	Get
Property Value
Type: Size
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace