RhinoCommon SDK
RhinoReplaceObjectEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.DocObjects.RhinoReplaceObjectEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoReplaceObjectEventArgs
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class RhinoReplaceObjectEventArgs : EventArgs
Public Class RhinoReplaceObjectEventArgs
	Inherits EventArgs
The RhinoReplaceObjectEventArgs type exposes the following members.
Properties
Name | Description
Document
NewRhinoObject
ObjectId
OldRhinoObject
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace