RhinoCommon SDK
BrepVertexList.Item Property
Rhino for Mac 5.1
 Gets the BrepVertex at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepVertex this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As BrepVertex
	Get
Parameters
index
Type: System.Int32
Index of BrepVertex to access.
Return Value
Type: BrepVertex
The BrepVertex at [index].
Exceptions
Exception | Condition
IndexOutOfRangeException | Thrown when the index is invalid.
See Also
Reference
BrepVertexList Class
Rhino.Geometry.Collections Namespace