RhinoCommon SDK
BrepTrim.Face Property
Rhino for Mac 5.1
 Brep face this trim belongs to
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepFace Face { get; }
Public ReadOnly Property Face As BrepFace
	Get
Property Value
Type: BrepFace
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace