RhinoCommon SDK
Brep.CreatePlanarBreps Method
Rhino for Mac 5.1
Overload List
Name | Description
CreatePlanarBreps(Curve)
 Constructs a set of planar breps as outlines by the loops.
CreatePlanarBreps(IEnumerable<Curve>)
 Constructs a set of planar breps as outlines by the loops.
CreatePlanarBreps(CurveList)
 Constructs a set of planar Breps as outlines by the loops.
Top
See Also
Reference
Brep Class
Rhino.Geometry Namespace