RhinoCommon SDK
DisplayPipeline.EnableDepthTesting Method
Rhino for Mac 5.1
 Enable or disable the DepthTesting behaviour of the engine. When DepthTesting is disabled, objects in front will no longer occlude objects behind them.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void EnableDepthTesting(
	bool enable
)
Public Sub EnableDepthTesting (
	enable As Boolean
)
Parameters
enable
Type: System.Boolean
true to enable DepthTesting, false to disable.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace