RhinoCommon SDK
ColorLCH Type Conversions
Rhino for Mac 5.1
The ColorLCH type exposes the following members.
Operators
Name | Description
Implicit(ColorLCH to Color)
 Implicitly converts a LCH color into a .Net library color.
Top
See Also
Reference
ColorLCH Structure
Rhino.Display Namespace