RhinoCommon SDK
File3dm.Read Method (String, File3dm.TableTypeFilter, File3dm.ObjectTypeFilter)
Rhino for Mac 5.1
 Reads a 3dm file from a specified location.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static File3dm Read(
	string path,
	File3dm.TableTypeFilter tableTypeFilterFilter,
	File3dm.ObjectTypeFilter objectTypeFilter
)
Public Shared Function Read (
	path As String,
	tableTypeFilterFilter As File3dm.TableTypeFilter,
	objectTypeFilter As File3dm.ObjectTypeFilter
) As File3dm
Parameters
path
Type: System.String
The file to read.
tableTypeFilterFilter
Type: Rhino.FileIO.File3dm.TableTypeFilter
 If tableTypeFilterFilter is None, then everything in the archive is read. Otherwise tableTypeFilterFilter identifies what tables should be read.
objectTypeFilter
Type: Rhino.FileIO.File3dm.ObjectTypeFilter
 If objectTypeFilter is not None, then is a filter made by bitwise oring values to select which types of objects will be read from the model object table.
Return Value
Type: File3dm
new File3dm on success, null on error.
Exceptions
Exception | Condition
FileNotFoundException | If path does not exist.
See Also
Reference
File3dm Class
Read Overload
Rhino.FileIO Namespace