RhinoCommon SDK
PersistentSettings.SetDefault Method (String, Point3d)
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,Rhino.Geometry.Point3d)"]
Namespace: Rhino
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void SetDefault(
	string key,
	Point3d value
)
Public Sub SetDefault (
	key As String,
	value As Point3d
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,Rhino.Geometry.Point3d)"]
value
Type: Rhino.Geometry.Point3d
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,Rhino.Geometry.Point3d)"]
See Also
Reference
PersistentSettings Class
SetDefault Overload
Rhino Namespace