RhinoCommon SDK
BoundingBox.Inflate Method (Double)
Rhino for Mac 5.1
 Inflates the box with equal amounts in all directions. Inflating with negative amounts may result in decreasing boxes.
Invalid boxes can not be inflated.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Inflate(
	double amount
)
Public Sub Inflate (
	amount As Double
)
Parameters
amount
Type: System.Double
Amount (in model units) to inflate this box in all directions.
See Also
Reference
BoundingBox Structure
Inflate Overload
Rhino.Geometry Namespace