RhinoCommon SDK
InstanceDefinitionTable.Find Method
Rhino for Mac 5.1
Overload List
Name | Description
Find(Guid, Boolean)
Finds the instance definition with a given id.
Find(String, Boolean)
Finds the instance definition with a given name.
Top
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace