RhinoCommon SDK
GetTransform.GetXform Method
Rhino for Mac 5.1
 Gets the Transformation.
Call this after having set up options and so on.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public GetResult GetXform()
Public Function GetXform As GetResult
Return Value
Type: GetResult
The result based on user choice.
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace