RhinoCommon SDK
BinaryArchiveWriter.WriteMeshingParameters Method
Rhino for Mac 5.1
 Writes a MeshingParameters value to the archive.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void WriteMeshingParameters(
	MeshingParameters value
)
Public Sub WriteMeshingParameters (
	value As MeshingParameters
)
Parameters
value
Type: Rhino.Geometry.MeshingParameters
A value to write.
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace