RhinoCommon SDK
ZBufferCapture.HitCount Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.HitCount"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int HitCount()
Public Function HitCount As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Display.ZBufferCapture.HitCount"]
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace