RhinoCommon SDK
NurbsCurve.CreateFromEllipse Method
Rhino for Mac 5.1
 Gets a rational degree 2 NURBS curve representation of the ellipse.
Note that the parameterization of the NURBS curve does not match with the transcendental paramaterization of the ellipsis.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static NurbsCurve CreateFromEllipse(
	Ellipse ellipse
)
Public Shared Function CreateFromEllipse (
	ellipse As Ellipse
) As NurbsCurve
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
[Missing <param name="ellipse"/> documentation for "M:Rhino.Geometry.NurbsCurve.CreateFromEllipse(Rhino.Geometry.Ellipse)"]
Return Value
Type: NurbsCurve
A nurbs curve representation of this ellipse or null if no such representation could be made.
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace