RhinoCommon SDK
Extrusion Constructor
Rhino for Mac 5.1
Overload List
Name | Description
Extrusion()
 Initializes a new instance of the Extrusion class.
Extrusion(SerializationInfo, StreamingContext)
 Protected serialization constructor.
Top
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace