RhinoCommon SDK
ObjectTable.UnselectAll Method
Rhino for Mac 5.1
Overload List
Name | Description
UnselectAll()
Unselect objects.
UnselectAll(Boolean)
Unselect objects.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace