RhinoCommon SDK
OpenFileDialog.MultiSelect Property
Rhino for Mac 5.1
 Gets or sets a value indicating whether the dialog box allows multiple files to be selected
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool MultiSelect { get; set; }
Public Property MultiSelect As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace