RhinoCommon SDK
OpenFileDialog.FileNames Property
Rhino for Mac 5.1
 Gets the names of all of the selected files in the dialog box
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string[] FileNames { get; }
Public ReadOnly Property FileNames As String()
	Get
Property Value
Type: String[]
See Also
Reference
OpenFileDialog Class
Rhino.UI Namespace