RhinoCommon SDK
Curve.MakeEndsMeet Method
Rhino for Mac 5.1
 Makes adjustments to the ends of one or both input curves so that they meet at a point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool MakeEndsMeet(
	Curve curveA,
	bool adjustStartCurveA,
	Curve curveB,
	bool adjustStartCurveB
)
Public Shared Function MakeEndsMeet (
	curveA As Curve,
	adjustStartCurveA As Boolean,
	curveB As Curve,
	adjustStartCurveB As Boolean
) As Boolean
Parameters
curveA
Type: Rhino.Geometry.Curve
1st curve to adjust.
adjustStartCurveA
Type: System.Boolean
 Which end of the 1st curve to adjust: true is start, false is end.
curveB
Type: Rhino.Geometry.Curve
2nd curve to adjust.
adjustStartCurveB
Type: System.Boolean
 which end of the 2nd curve to adjust true==start, false==end.
Return Value
Type: Boolean
true on success.
See Also
Reference
Curve Class
Rhino.Geometry Namespace