RhinoCommon SDK
Line.DistanceTo Method
Rhino for Mac 5.1
 Compute the shortest distance between this line segment and a test point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double DistanceTo(
	Point3d testPoint,
	bool limitToFiniteSegment
)
Public Function DistanceTo (
	testPoint As Point3d,
	limitToFiniteSegment As Boolean
) As Double
Parameters
testPoint
Type: Rhino.Geometry.Point3d
Point for distance computation.
limitToFiniteSegment
Type: System.Boolean
If true, the distance is limited to the finite line segment.
Return Value
Type: Double
The shortest distance between this line segment and testPoint.
See Also
Reference
Line Structure
Rhino.Geometry Namespace