RhinoCommon SDK
NeverRepeatList.UseNeverRepeatList Property
Rhino for Mac 5.1
 Only use the list if somebody modifies it via CRhinoAppSettings::SetDontRepeatCommands(). Return value of true means CRhinoCommand don't repeat flags will be ignored and the m_dont_repeat_list will be used instead. false means the individual CRhinoCommands will determine if they are repeatable.
Namespace: Rhino.ApplicationSettings
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool UseNeverRepeatList { get; }
Public Shared ReadOnly Property UseNeverRepeatList As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
NeverRepeatList Class
Rhino.ApplicationSettings Namespace