RhinoCommon SDK
Point3dGrid Constructor
Rhino for Mac 5.1
 Initializes a rectangular grid of points, with no points in it.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Point3dGrid()
Public Sub New
See Also
Reference
Point3dGrid Class
Point3dGrid Overload
Rhino.Geometry Namespace