RhinoCommon SDK
CustomBrepObject Constructor
Rhino for Mac 5.1
Overload List
Name | Description
CustomBrepObject()
Initializes a new instance of the CustomBrepObject class
CustomBrepObject(Brep)
Initializes a new instance of the CustomBrepObject class
Top
See Also
Reference
CustomBrepObject Class
Rhino.DocObjects.Custom Namespace