RhinoCommon SDK
ShowPanelEventArgs.PanelId Property
Rhino for Mac 5.1
 Class Id for panel being shown or hidden
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid PanelId { get; }
Public ReadOnly Property PanelId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
ShowPanelEventArgs Class
Rhino.UI Namespace