RhinoCommon SDK
BrepFaceList.StandardizeFaceSurfaces Method
Rhino for Mac 5.1
Standardize all faces in the brep.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void StandardizeFaceSurfaces()
Public Sub StandardizeFaceSurfaces
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace