RhinoCommon SDK
TransformCommand.SelectObjects Method (String, TransformObjectList)
Rhino for Mac 5.1
 Selects objects within the command.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected Result SelectObjects(
	string prompt,
	TransformObjectList list
)
Protected Function SelectObjects (
	prompt As String,
	list As TransformObjectList
) As Result
Parameters
prompt
Type: System.String
The selection prompt.
list
Type: Rhino.Collections.TransformObjectList
A list of objects to transform. This is a special list type.
Return Value
Type: Result
The operation result.
See Also
Reference
TransformCommand Class
SelectObjects Overload
Rhino.Commands Namespace