RhinoCommon SDK
Extrusion.ProfileIndex Method
Rhino for Mac 5.1
 Gets the index of the profile curve at a domain related to a parameter.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int ProfileIndex(
	double profileParameter
)
Public Function ProfileIndex (
	profileParameter As Double
) As Integer
Parameters
profileParameter
Type: System.Double
Parameter on profile curve.
Return Value
Type: Int32
 -1 if profileParameter does not correspond to a point on the profile curve. When the profileParameter corresponds to the end of one profile and the beginning of the next profile, the index of the next profile is returned.
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace