RhinoCommon SDK
LinearDimension Methods
Rhino for Mac 5.1
The LinearDimension type exposes the following members.
Methods
Name | Description
FromPoints
 Initializes a new instance of the LinearDimension class, based on three points.
SetLocations
 Sets the three locations of the point, using two-dimensional points that refer to the plane of the annotation.
Top
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace