RhinoCommon SDK
BoundingBox Properties
Rhino for Mac 5.1
The BoundingBox type exposes the following members.
Properties
Name | Description
Center
 Gets the point in the center of the boundingbox.
Diagonal
 Gets the diagonal vector of this BoundingBox. The diagonal connects the Min and Max points.
Empty
 Gets an [Empty] boundingbox. An Empty box is an invalid structure that has negative width.
IsValid
 Gets a value that indicates whether or not this boundingbox is valid. Empty boxes are not valid, and neither are boxes with unset points.
Max
 Gets or sets the point in the maximal corner.
Min
 Gets or sets the point in the minimal corner.
Unset
 Gets a boundingbox that has Unset coordinates for Min and Max.
Top
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace