RhinoCommon SDK
ComponentIndex Constructor
Rhino for Mac 5.1
 Construct component index with a specific type/index combination
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ComponentIndex(
	ComponentIndexType type,
	int index
)
Public Sub New (
	type As ComponentIndexType,
	index As Integer
)
Parameters
type
Type: Rhino.Geometry.ComponentIndexType
[Missing <param name="type"/> documentation for "M:Rhino.Geometry.ComponentIndex.#ctor(Rhino.Geometry.ComponentIndexType,System.Int32)"]
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Geometry.ComponentIndex.#ctor(Rhino.Geometry.ComponentIndexType,System.Int32)"]
See Also
Reference
ComponentIndex Structure
Rhino.Geometry Namespace