RhinoCommon SDK
Plane.FitPlaneToPoints Method
Rhino for Mac 5.1
Overload List
Name | Description
FitPlaneToPoints(IEnumerable<Point3d>, Plane)
Fit a plane through a collection of points.
FitPlaneToPoints(IEnumerable<Point3d>, Plane, Double)
Fit a plane through a collection of points.
Top
See Also
Reference
Plane Structure
Rhino.Geometry Namespace