RhinoCommon SDK
GetLine.MidPointPrompt Property
Rhino for Mac 5.1
Prompt when getting midpoint
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public string MidPointPrompt { get; set; }
Public Property MidPointPrompt As String
	Get
	Set
Property Value
Type: String
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace