RhinoCommon SDK
DisplayPipeline.Draw3dText Method (Text3d, Color, Plane)
Rhino for Mac 5.1
 Draws 3d text with a different plane than what is defined in the Text3d class.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Draw3dText(
	Text3d text,
	Color color,
	Plane textPlane
)
Public Sub Draw3dText (
	text As Text3d,
	color As Color,
	textPlane As Plane
)
Parameters
text
Type: Rhino.Display.Text3d
The string to draw.
color
Type: System.Drawing.Color
Text color.
textPlane
Type: Rhino.Geometry.Plane
The plane for the text object.
See Also
Reference
DisplayPipeline Class
Draw3dText Overload
Rhino.Display Namespace