RhinoCommon SDK
Layer.RenderMaterialIndex Property
Rhino for Mac 5.1
 Gets or sets the index of render material for objects on this layer that have MaterialSource() == MaterialFromLayer. A material index of -1 indicates no material has been assigned and the material created by the default Material constructor should be used.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int RenderMaterialIndex { get; set; }
Public Property RenderMaterialIndex As Integer
	Get
	Set
Property Value
Type: Int32
Remarks
If you are modifying a layer inside a Rhino document, you must call CommitChanges for the modifications to take effect.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace