RhinoCommon SDK
ViewportInfo.ChangeToSymmetricFrustum Method
Rhino for Mac 5.1
 If needed, adjusts the current frustum so it has the specified symmetries and adjust the camera location so the target plane remains visible.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool ChangeToSymmetricFrustum(
	bool isLeftRightSymmetric,
	bool isTopBottomSymmetric,
	double targetDistance
)
Public Function ChangeToSymmetricFrustum (
	isLeftRightSymmetric As Boolean,
	isTopBottomSymmetric As Boolean,
	targetDistance As Double
) As Boolean
Parameters
isLeftRightSymmetric
Type: System.Boolean
If true, the frustum will be adjusted so left = -right.
isTopBottomSymmetric
Type: System.Boolean
If true, the frustum will be adjusted so top = -bottom.
targetDistance
Type: System.Double
 If projection is not perspective or target_distance is RhinoMath.UnsetValue, then this parameter is ignored. If the projection is perspective and targetDistance is not RhinoMath.UnsetValue, then it must be > 0.0 and it is used to determine which plane in the old frustum will appear unchanged in the new frustum.
Return Value
Type: Boolean
 Returns true if the viewport has now a frustum with the specified symmetries.
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace