RhinoCommon SDK
Vector3d.Division Operator
Rhino for Mac 5.1
 Divides a Vector3d by a number, having the effect of shrinking it.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Vector3d operator /(
	Vector3d vector,
	double t
)
Public Shared Operator / (
	vector As Vector3d,
	t As Double
) As Vector3d
Parameters
vector
Type: Rhino.Geometry.Vector3d
A vector.
t
Type: System.Double
A number.
Return Value
Type: Vector3d
A new vector that is componentwise divided by t.
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace