RhinoCommon SDK
MeshFaceNormalList Properties
Rhino for Mac 5.1
The MeshFaceNormalList type exposes the following members.
Properties
Name | Description
Count
 Gets or sets the number of mesh face normals.
Item
 Gets or sets the face normal at the given face index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace