RhinoCommon SDK
DisplayModeDescription.Dispose Method
Rhino for Mac 5.1
Overload List
Name | Description
Dispose()
Releases all resources used by the DisplayModeDescription
Dispose(Boolean)
Releases the unmanaged resources used by the DisplayModeDescription and optionally releases the managed resources
Top
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace