RhinoCommon SDK
DisplayPipeline.DrawDottedPolyline Method
Rhino for Mac 5.1
 Draws a set of connected lines (polyline) in a dotted pattern.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void DrawDottedPolyline(
	IEnumerable<Point3d> points,
	Color color,
	bool close
)
Public Sub DrawDottedPolyline (
	points As IEnumerable(Of Point3d),
	color As Color,
	close As Boolean
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
End points of each line segment.
color
Type: System.Drawing.Color
Color of polyline.
close
Type: System.Boolean
Draw a line between the first and last points.
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace