RhinoCommon SDK
ObjectAttributes.Visible Property
Rhino for Mac 5.1
object visibility.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Visible { get; set; }
Public Property Visible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace