RhinoCommon SDK
Command.DisplayHelp Method
Rhino for Mac 5.1
 Displays help for a command.
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static void DisplayHelp(
	Guid commandId
)
Public Shared Sub DisplayHelp (
	commandId As Guid
)
Parameters
commandId
Type: System.Guid
A command ID.
See Also
Reference
Command Class
Rhino.Commands Namespace