RhinoCommon SDK
File3dmTypeCodes Class
Rhino for Mac 5.1
 Typecode format 4 bytes long
x xxxxxxxxxxxxxxx,x xxx xxxx xxxx x x xx
|        |         |       +---  "stuff" bit
|        |         +-- specific codes
|        +-- RESERVED - DO NOT USE (should be 0) (will be used to control CRC on/off)
+-- category:_000 0000 0000 0001  Legacy geometry    TCODE_LEGACY_GEOMETRY
_000 0000 0000 0010  openNURBS object   TCODE_OPENNURBS_OBJECT
_000 0000 0000 0100  -- RESERVED - DO NOT USE (should be 0 in any typecode) --
_000 0000 0000 1000  -- RESERVED - DO NOT USE (should be 0 in any typecode) --
_000 0000 0001 0000  Geometry           TCODE_GEOMETRY
_000 0000 0010 0000  Annotation
_000 0000 0100 0000  Display Attributes TCODE_DISPLAY
_000 0000 1000 0000  Rendering          TCODE_RENDER
_000 0001 0000 0000
_000 0010 0000 0000  Interface          TCODE_INTERFACE
_000 0100 0000 0000  -- RESERVED - DO NOT USE (should be 0 in any typecode) --
_000 1000 0000 0000  Tolerances         TCODE_TOLERANCE
_001 0000 0000 0000  Tables             TCODE_TABLE
_010 0000 0000 0000  Table record       TCODE_TABLEREC
_100 0000 0000 0000  User information   TCODE_USER
+-- format: 0 - data size in header  - data block follows    TCODE_SHORT
1 - data in header - no data block follows
Inheritance Hierarchy
System.Object
 Rhino.FileIO.File3dmTypeCodes
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static class File3dmTypeCodes
Public NotInheritable Class File3dmTypeCodes
The File3dmTypeCodes type exposes the following members.
Fields
Name | Description
TCODE_ANALYSIS_MESH
TCODE_ANGULAR_DIMENSION
TCODE_ANNOTATION
0x0020000.
TCODE_ANNOTATION_LEADER
TCODE_ANNOTATION_SETTINGS
TCODE_ANONYMOUS_CHUNK
(TCODE_USER | TCODE_CRC | 0x0000)
TCODE_BITMAP_RECORD
TCODE_BITMAP_TABLE
TCODE_BITMAPPREVIEW
TCODE_BUMPMAP
TCODE_COMMENTBLOCK
 (0x00000001) The TCODE_COMMENTBLOCK is the first chunk in the file, starts 32 bytes into the file, and contains text information terminated with a ^m_z. This ^m_z and contents of this chunk were expanded in February 2000. Files written with code released earlier than this will not have the ^m_z.
TCODE_COMPRESSED_MESH_GEOMETRY
TCODE_CPLANE
TCODE_CRC
0x8000.
TCODE_CURRENTLAYER
TCODE_DICTIONARY
TCODE_DICTIONARY_END
TCODE_DICTIONARY_ENTRY
TCODE_DICTIONARY_ID
TCODE_DIMSTYLE_RECORD
TCODE_DIMSTYLE_TABLE
TCODE_DISP_AM_RESOLUTION
TCODE_DISP_CPLINES
TCODE_DISP_MAXLENGTH
TCODE_DISPLAY
0x0040000.
TCODE_ENDOFFILE
 (0x00007FFF) The TCODE_ENDOFFILE is the last chunk in the file and the first 4 bytes of information in this chunk is an integer that contains the file length. This chunk was added in February 2000 and files written with code released earlier than this will not have this termination block.
TCODE_ENDOFFILE_GOO
 (0x00007FFE) this typecode is returned when a rogue eof marker is found Some v1 3dm file writers put these markers in a "goo". Simply skip these chunks and continue.
TCODE_ENDOFTABLE
TCODE_FONT_RECORD
TCODE_FONT_TABLE
TCODE_GEOMETRY
0x0010000.
TCODE_GROUP_RECORD
TCODE_GROUP_TABLE
TCODE_HATCHPATTERN_RECORD
TCODE_HATCHPATTERN_TABLE
TCODE_HIDE_TRACE
TCODE_HISTORYRECORD_RECORD
TCODE_HISTORYRECORD_TABLE
TCODE_INSTANCE_DEFINITION_RECORD
TCODE_INSTANCE_DEFINITION_TABLE
TCODE_INTERFACE
0x02000000.
TCODE_LAYER
TCODE_LAYER_OBSELETE_1
TCODE_LAYER_OBSELETE_2
TCODE_LAYER_OBSELETE_3
TCODE_LAYER_RECORD
TCODE_LAYER_TABLE
layers.
TCODE_LAYERINDEX
TCODE_LAYERLOCKED
TCODE_LAYERMATERIALINDEX
TCODE_LAYERNAME
TCODE_LAYERON
TCODE_LAYERPICKABLE
TCODE_LAYERREF
TCODE_LAYERRENDERABLE
TCODE_LAYERSNAPABLE
TCODE_LAYERSTATE
TCODE_LAYERTABLE
TCODE_LAYERTHAWED
TCODE_LAYERVISIBLE
TCODE_LEGACY_ASM
TCODE_LEGACY_ASMSTUFF
TCODE_LEGACY_BND
TCODE_LEGACY_BNDSTUFF
TCODE_LEGACY_CRV
TCODE_LEGACY_CRVSTUFF
TCODE_LEGACY_FAC
TCODE_LEGACY_FACSTUFF
TCODE_LEGACY_GEOMETRY
TCODE_LEGACY_PNT
TCODE_LEGACY_PNTSTUFF
TCODE_LEGACY_PRT
TCODE_LEGACY_PRTSTUFF
TCODE_LEGACY_SHL
TCODE_LEGACY_SHLSTUFF
TCODE_LEGACY_SPL
TCODE_LEGACY_SPLSTUFF
TCODE_LEGACY_SRF
TCODE_LEGACY_SRFSTUFF
TCODE_LEGACY_TOL_ANGLE
TCODE_LEGACY_TOL_FIT
TCODE_LEGACY_TRM
TCODE_LEGACY_TRMSTUFF
TCODE_LIGHT_RECORD
TCODE_LIGHT_RECORD_ATTRIBUTES
TCODE_LIGHT_RECORD_ATTRIBUTES_USERDATA
TCODE_LIGHT_RECORD_END
TCODE_LIGHT_TABLE
rendering lights.
TCODE_LINEAR_DIMENSION
TCODE_LINETYPE_RECORD
TCODE_LINETYPE_TABLE
TCODE_MATERIAL_RECORD
TCODE_MATERIAL_TABLE
rendering materials.
TCODE_MAXIMIZED_VIEWPORT
TCODE_MESH_OBJECT
TCODE_NAME
TCODE_NAMED_CPLANE
TCODE_NAMED_VIEW
TCODE_NEAR_CLIP_PLANE
TCODE_NOTES
TCODE_OBJECT_RECORD
TCODE_OBJECT_RECORD_ATTRIBUTES
TCODE_OBJECT_RECORD_ATTRIBUTES_USERDATA
TCODE_OBJECT_RECORD_END
TCODE_OBJECT_RECORD_HISTORY
TCODE_OBJECT_RECORD_HISTORY_DATA
TCODE_OBJECT_RECORD_HISTORY_HEADER
TCODE_OBJECT_RECORD_TYPE
TCODE_OBJECT_TABLE
geometry and annotation.
TCODE_OBSOLETE_LAYERSET_RECORD
TCODE_OBSOLETE_LAYERSET_TABLE
TCODE_OLD_FULLMESH
TCODE_OLD_MESH_UV
TCODE_OLD_MESH_VERTEX_NORMALS
TCODE_OLD_RH_TRIMESH
TCODE_OPENNURBS_CLASS
TCODE_OPENNURBS_CLASS_DATA
TCODE_OPENNURBS_CLASS_END
TCODE_OPENNURBS_CLASS_USERDATA
TCODE_OPENNURBS_CLASS_USERDATA_HEADER
TCODE_OPENNURBS_CLASS_UUID
TCODE_OPENNURBS_OBJECT
0x00020000.
TCODE_PROPERTIES_APPLICATION
TCODE_PROPERTIES_COMPRESSED_PREVIEWIMAGE
TCODE_PROPERTIES_NOTES
TCODE_PROPERTIES_OPENNURBS_VERSION
TCODE_PROPERTIES_PREVIEWIMAGE
TCODE_PROPERTIES_REVISIONHISTORY
TCODE_PROPERTIES_TABLE
 Model Properties: revision history, notes, preview image.
TCODE_RADIAL_DIMENSION
TCODE_RENDER
0x0080000.
TCODE_RENDER_MATERIAL_ID
TCODE_RENDERMESHPARAMS
TCODE_RGB
TCODE_RGBDISPLAY
TCODE_RH_POINT
TCODE_RH_SPOTLIGHT
TCODE_RHINOIO_OBJECT_BREP
TCODE_RHINOIO_OBJECT_DATA
TCODE_RHINOIO_OBJECT_END
TCODE_RHINOIO_OBJECT_NURBS_CURVE
TCODE_RHINOIO_OBJECT_NURBS_SURFACE
TCODE_SETTINGS__NEVER__USE__THIS
TCODE_SETTINGS_ANALYSISMESH
TCODE_SETTINGS_ANNOTATION
TCODE_SETTINGS_ATTRIBUTES
TCODE_SETTINGS_CURRENT_COLOR
TCODE_SETTINGS_CURRENT_DIMSTYLE_INDEX
TCODE_SETTINGS_CURRENT_FONT_INDEX
TCODE_SETTINGS_CURRENT_LAYER_INDEX
TCODE_SETTINGS_CURRENT_MATERIAL_INDEX
TCODE_SETTINGS_CURRENT_WIRE_DENSITY
TCODE_SETTINGS_GRID_DEFAULTS
TCODE_SETTINGS_MODEL_URL
TCODE_SETTINGS_NAMED_CPLANE_LIST
TCODE_SETTINGS_NAMED_VIEW_LIST
TCODE_SETTINGS_PLUGINLIST
TCODE_SETTINGS_RENDER
TCODE_SETTINGS_RENDERMESH
TCODE_SETTINGS_TABLE
TCODE_SETTINGS_UNITSANDTOLS
TCODE_SETTINGS_VIEW_LIST
TCODE_SHORT
0x80000000.
TCODE_SHOWGRID
TCODE_SHOWGRIDAXES
TCODE_SHOWWORLDAXES
TCODE_SNAPSIZE
TCODE_STUFF
TCODE_SUMMARY
TCODE_TABLE
0x10000000.
TCODE_TABLEREC
0x20000000.
TCODE_TEXT_BLOCK
TCODE_TEXTURE_MAPPING_RECORD
TCODE_TEXTURE_MAPPING_TABLE
TCODE_TEXTUREMAP
TCODE_TOLERANCE
0x08000000.
TCODE_TRANSPARENCY
TCODE_UNIT_AND_TOLERANCES
TCODE_USER
0x40000000.
TCODE_USER_RECORD
TCODE_USER_TABLE
TCODE_USER_TABLE_UUID
TCODE_VIEW
TCODE_VIEW_ATTRIBUTES
TCODE_VIEW_CPLANE
TCODE_VIEW_DISPLAYMODE
TCODE_VIEW_NAME
TCODE_VIEW_POSITION
TCODE_VIEW_RECORD
TCODE_VIEW_SHOWCONAXES
TCODE_VIEW_SHOWCONGRID
TCODE_VIEW_SHOWWORLDAXES
TCODE_VIEW_TARGET
TCODE_VIEW_TRACEIMAGE
TCODE_VIEW_VIEWPORT
TCODE_VIEW_VIEWPORT_USERDATA
TCODE_VIEW_WALLPAPER
TCODE_VIEW_WALLPAPER_V3
TCODE_VIEWPORT
TCODE_VIEWPORT_DISPLAY_MODE
TCODE_VIEWPORT_POSITION
TCODE_VIEWPORT_TRACEINFO
TCODE_VIEWPORT_WALLPAPER
TCODE_XDATA
Top
See Also
Reference
Rhino.FileIO Namespace