RhinoCommon SDK
ParticleSystem.DrawRequiresDepthSorting Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Geometry.ParticleSystem.DrawRequiresDepthSorting"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool DrawRequiresDepthSorting { get; set; }
Public Property DrawRequiresDepthSorting As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ParticleSystem Class
Rhino.Geometry Namespace