RhinoCommon SDK
ColorCMYK Constructor (Color)
Rhino for Mac 5.1
 Initializes a new instance of ColorCMYK that is equivalent to an RGB color.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ColorCMYK(
	Color rgb
)
Public Sub New (
	rgb As Color
)
Parameters
rgb
Type: System.Drawing.Color
RGB color to mimic.
Remarks
Exact conversions between color spaces are often not possible.
See Also
Reference
ColorCMYK Structure
ColorCMYK Overload
Rhino.Display Namespace