RhinoCommon SDK
ColorCMYK Constructor (Double, Double, Double, Double)
Rhino for Mac 5.1
 Initializes a new instance of ColorCMYK with custom channel values.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ColorCMYK(
	double cyan,
	double magenta,
	double yellow,
	double key
)
Public Sub New (
	cyan As Double,
	magenta As Double,
	yellow As Double,
	key As Double
)
Parameters
cyan
Type: System.Double
Cyan channel value. Cyan channels are limited to the 0.0 and 1.0 range.
magenta
Type: System.Double
Magenta channel value. Magenta channels are limited to the 0.0 and 1.0 range.
yellow
Type: System.Double
Yellow channel value. Yellow channels are limited to the 0.0 and 1.0 range.
key
Type: System.Double
Key channel value. Key channels are limited to the 0.0 and 1.0 range.
See Also
Reference
ColorCMYK Structure
ColorCMYK Overload
Rhino.Display Namespace