RhinoCommon SDK
ColorXYZ Constructor
Rhino for Mac 5.1
Overload List
Name | Description
ColorXYZ(Color)
 Constructs a new instance of ColorXYZ that is equivalent to an RGB color.
ColorXYZ(Double, Double, Double)
 Constructs a new instance of ColorXYZ with custom channel values.
ColorXYZ(Double, Double, Double, Double)
 Constructs a new instance of ColorXYZ with custom channel values.
Top
See Also
Reference
ColorXYZ Structure
Rhino.Display Namespace