RhinoCommon SDK
Matrix.Multiply Operator
Rhino for Mac 5.1
 Multiplies two matrices and returns a new product matrix.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Matrix operator *(
	Matrix a,
	Matrix b
)
Public Shared Operator * (
	a As Matrix,
	b As Matrix
) As Matrix
Parameters
a
Type: Rhino.Geometry.Matrix
A first matrix to use in calculation.
b
Type: Rhino.Geometry.Matrix
Another matrix to use in calculation.
Return Value
Type: Matrix
The product matrix.
Exceptions
Exception | Condition
ArgumentException |  When a.ColumnCount != b.RowCount.
See Also
Reference
Matrix Class
Rhino.Geometry Namespace