RhinoCommon SDK
RhinoViewport.PreviousConstructionPlane Method
Rhino for Mac 5.1
 Sets the construction plane to the plane that was active before the last call to NextConstructionPlane or SetConstructionPlane.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool PreviousConstructionPlane()
Public Function PreviousConstructionPlane As Boolean
Return Value
Type: Boolean
true if successful.
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace