RhinoCommon SDK
DisplayModeDescription.WireframePipelineRequired Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.WireframePipelineRequired"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool WireframePipelineRequired { get; set; }
Public Property WireframePipelineRequired As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace