RhinoCommon SDK
ObjectTable.AddArc Method (Arc)
Rhino for Mac 5.1
Adds a curve object to the document representing an arc.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddArc(
	Arc arc
)
Public Function AddArc (
	arc As Arc
) As Guid
Parameters
arc
Type: Rhino.Geometry.Arc
An arc value.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
ObjectTable Class
AddArc Overload
Rhino.DocObjects.Tables Namespace