RhinoCommon SDK
VisualAnalysisMode.DrawNurbsCurve Method
Rhino for Mac 5.1
 Draws a NURBS curve. This is a good function to override for analysis modes like curvature hair display.
The default implementation does nothing.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
protected virtual void DrawNurbsCurve(
	RhinoObject obj,
	NurbsCurve curve,
	DisplayPipeline pipeline
)
Protected Overridable Sub DrawNurbsCurve (
	obj As RhinoObject,
	curve As NurbsCurve,
	pipeline As DisplayPipeline
)
Parameters
obj
Type: Rhino.DocObjects.RhinoObject
A Rhino object corresponding to the curve.
curve
Type: Rhino.Geometry.NurbsCurve
The curve geometry.
pipeline
Type: Rhino.Display.DisplayPipeline
The current display pipeline.
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace