RhinoCommon SDK
RhinoObject.GetSelectedSubObjects Method
Rhino for Mac 5.1
Get a list of all selected sub-objects.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ComponentIndex[] GetSelectedSubObjects()
Public Function GetSelectedSubObjects As ComponentIndex()
Return Value
Type: ComponentIndex[]
An array of subobject indices, or null if there are none.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace