RhinoCommon SDK
File3dm.LastEdited Property
Rhino for Mac 5.1
 Get the DateTime that this file was last edited. If the value is not set in the 3dm file, then DateTime.MinValue is returned
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public DateTime LastEdited { get; }
Public ReadOnly Property LastEdited As DateTime
	Get
Property Value
Type: DateTime
See Also
Reference
File3dm Class
Rhino.FileIO Namespace