RhinoCommon SDK
DisplayPipeline.DrawOverlay Event
Rhino for Mac 5.1
 If Rhino is in a feedback mode, the draw overlay call allows for temporary geometry to be drawn on top of everything in the scene. This is similar to the dynamic draw routine that occurs with custom get point.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static event EventHandler<DrawEventArgs> DrawOverlay
Public Shared Event DrawOverlay As EventHandler(Of DrawEventArgs)
Value
Type: System.EventHandler<DrawEventArgs>
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace