RhinoCommon SDK
Mesh Constructor
Rhino for Mac 5.1
Overload List
Name | Description
Mesh()
Initializes a new empty mesh.
Mesh(SerializationInfo, StreamingContext)
 Protected constructor for internal use.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace