RhinoCommon SDK
LinetypeTable.CurrentLinetypeSource Property
Rhino for Mac 5.1
 Source used by an object to determine its current linetype to be used by new objects.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public ObjectLinetypeSource CurrentLinetypeSource { get; set; }
Public Property CurrentLinetypeSource As ObjectLinetypeSource
	Get
	Set
Property Value
Type: ObjectLinetypeSource
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace