RhinoCommon SDK
File3dmHistoryRecordTable.Count Property
Rhino for Mac 5.1
 Gets the number of history records in this table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
File3dmHistoryRecordTable Class
Rhino.FileIO Namespace