RhinoCommon SDK
BrepFaceList.Flip Method
Rhino for Mac 5.1
 Flips the orientation of faces.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Flip(
	bool onlyReversedFaces
)
Public Sub Flip (
	onlyReversedFaces As Boolean
)
Parameters
onlyReversedFaces
Type: System.Boolean
 If true, clears all BrepFace.OrientationIsReversed flags by calling BrepFace.Transpose() on each face with a true OrientationIsReversed setting. If false, all of the faces are flipped regardless of their orientation.
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace