RhinoCommon SDK
ObjectAttributes.MaterialRefs Property
Rhino for Mac 5.1
 If you are developing a high quality plug-in renderer, and a user is assigning a custom render material to this object, then add rendering material information to the MaterialRefs dictionary. Note to developers: As soon as the MaterialRefs dictionary contains items rendering material queries slow down. Do not populate the MaterialRefs dictionary when setting the MaterialIndex will take care of your needs.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public MaterialRefs MaterialRefs { get; }
Public ReadOnly Property MaterialRefs As MaterialRefs
	Get
Property Value
Type: MaterialRefs
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace