RhinoCommon SDK
FontTable.CurrentIndex Property
Rhino for Mac 5.1
 At all times, there is a "current" font. Unless otherwise specified, new dimension objects are assigned to the current font. The current font is never deleted. Returns: Zero based font index of the current font.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int CurrentIndex { get; }
Public ReadOnly Property CurrentIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
FontTable Class
Rhino.DocObjects.Tables Namespace