RhinoCommon SDK
Texture.GetAlphaBlendValues Method
Rhino for Mac 5.1
 If the TextureCombineMode is Blend, then the blending function for alpha is determined by
 new alpha = constant + a0*(current alpha) + a1*(texture alpha) + a2*min(current alpha,texture alpha) + a3*max(current alpha,texture alpha)
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void GetAlphaBlendValues(
	out double constant,
	out double a0,
	out double a1,
	out double a2,
	out double a3
)
Public Sub GetAlphaBlendValues (
	<OutAttribute> ByRef constant As Double,
	<OutAttribute> ByRef a0 As Double,
	<OutAttribute> ByRef a1 As Double,
	<OutAttribute> ByRef a2 As Double,
	<OutAttribute> ByRef a3 As Double
)
Parameters
constant
Type: System.Double
[Missing <param name="constant"/> documentation for "M:Rhino.DocObjects.Texture.GetAlphaBlendValues(System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)"]
a0
Type: System.Double
[Missing <param name="a0"/> documentation for "M:Rhino.DocObjects.Texture.GetAlphaBlendValues(System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)"]
a1
Type: System.Double
[Missing <param name="a1"/> documentation for "M:Rhino.DocObjects.Texture.GetAlphaBlendValues(System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)"]
a2
Type: System.Double
[Missing <param name="a2"/> documentation for "M:Rhino.DocObjects.Texture.GetAlphaBlendValues(System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)"]
a3
Type: System.Double
[Missing <param name="a3"/> documentation for "M:Rhino.DocObjects.Texture.GetAlphaBlendValues(System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)"]
See Also
Reference
Texture Class
Rhino.DocObjects Namespace