RhinoCommon SDK
Box Constructor (Plane, IEnumerable<Point3d>)
Rhino for Mac 5.1
 Initializes the smallest box that contains a set of points.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Box(
	Plane basePlane,
	IEnumerable<Point3d> points
)
Public Sub New (
	basePlane As Plane,
	points As IEnumerable(Of Point3d)
)
Parameters
basePlane
Type: Rhino.Geometry.Plane
Orientation of the box.
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to include, Invalid points will be ignored.
See Also
Reference
Box Structure
Box Overload
Rhino.Geometry Namespace