RhinoCommon SDK
DisplayPipelineAttributes.MeshDisplayAttributes.AllMeshWiresColor Property
Rhino for Mac 5.1
 Color.Empty means that we are NOT using a single color for all mesh wires.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Color AllMeshWiresColor { get; set; }
Public Property AllMeshWiresColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPipelineAttributes.MeshDisplayAttributes Class
Rhino.Display Namespace