RhinoCommon SDK
Line.MaximumDistanceTo Method (Line)
Rhino for Mac 5.1
 Finds the largest distance between this line as a finite segment and another finite segment.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double MaximumDistanceTo(
	Line testLine
)
Public Function MaximumDistanceTo (
	testLine As Line
) As Double
Parameters
testLine
Type: Rhino.Geometry.Line
A line to test.
Return Value
Type: Double
The maximum distance.
See Also
Reference
Line Structure
MaximumDistanceTo Overload
Rhino.Geometry Namespace