RhinoCommon SDK
Vector3d.GetHashCode Method
Rhino for Mac 5.1
 Computes the hash code for the current vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A non-unique number that represents the components of this vector.
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace