RhinoCommon SDK
RhinoList<T>.FindAll Method
Rhino for Mac 5.1
 Retrieves all the elements that match the conditions defined by the specified predicate.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RhinoList<T> FindAll(
	Predicate<T> match
)
Public Function FindAll (
	match As Predicate(Of T)
) As RhinoList(Of T)
Parameters
match
Type: System.Predicate<T>
The Predicate(T) delegate that defines the conditions of the elements to search for.
Return Value
Type: RhinoList<T>
A ON_List(T) containing all the elements that match the conditions defined by the specified predicate, if found; otherwise, an empty ON_List(T).
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace