RhinoCommon SDK
MouseCallbackEventArgs Properties
Rhino for Mac 5.1
The MouseCallbackEventArgs type exposes the following members.
Properties
Name | Description
Button
View
ViewportPoint
Top
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace