RhinoCommon SDK
GetLine.Get Method
Rhino for Mac 5.1
 Perform the 'get' operation.
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Result Get(
	out Line line
)
Public Function Get (
	<OutAttribute> ByRef line As Line
) As Result
Parameters
line
Type: Rhino.Geometry.Line
[Missing <param name="line"/> documentation for "M:Rhino.Input.Custom.GetLine.Get(Rhino.Geometry.Line@)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetLine.Get(Rhino.Geometry.Line@)"]
See Also
Reference
GetLine Class
Rhino.Input.Custom Namespace