RhinoCommon SDK
RTree.Remove Method (BoundingBox, IntPtr)
Rhino for Mac 5.1
Removes an element from the tree.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Remove(
	BoundingBox box,
	IntPtr elementId
)
Public Function Remove (
	box As BoundingBox,
	elementId As IntPtr
) As Boolean
Parameters
box
Type: Rhino.Geometry.BoundingBox
A bounding box.
elementId
Type: System.IntPtr
A pointer.
Return Value
Type: Boolean
true if element was successfully removed.
See Also
Reference
RTree Class
Remove Overload
Rhino.Geometry Namespace