RhinoCommon SDK
RTree.Remove Method (Point2d, Int32)
Rhino for Mac 5.1
Removes an element from the tree.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public bool Remove(
	Point2d point,
	int elementId
)
Public Function Remove (
	point As Point2d,
	elementId As Integer
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point2d
A point.
elementId
Type: System.Int32
A number.
Return Value
Type: Boolean
true if element was successfully removed.
See Also
Reference
RTree Class
Remove Overload
Rhino.Geometry Namespace