RhinoCommon SDK
DisplayPipelineAttributes Properties
Rhino for Mac 5.1
The DisplayPipelineAttributes type exposes the following members.
Properties
Name | Description
CurveColor
Color used for drawing curves
CurveThickness
Pixel thickness for curves
DisableConduits
DisableTransparency
EnglishName
Id
IgnoreHighlights
LocalName
LockedObjectsDrawBehindOthers
Locked object are drawn behind other objects
MeshSpecificAttributes
ObjectColor
ShadingEnabled
Draw shaded meshes and surfaces
ShowCurves
Draw curves
ShowGrips
ViewSpecificAttributes
XrayAllObjects
Top
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace