RhinoCommon SDK
Vector3f.Addition Operator
Rhino for Mac 5.1
 Sums up a point and a vector, and returns a new point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static Point3f operator +(
	Point3f point,
	Vector3f vector
)
Public Shared Operator + (
	point As Point3f,
	vector As Vector3f
) As Point3f
Parameters
point
Type: Rhino.Geometry.Point3f
A point.
vector
Type: Rhino.Geometry.Vector3f
A vector.
Return Value
Type: Point3f
A new point that results from the addition of point and vector.
See Also
Reference
Vector3f Structure
Rhino.Geometry Namespace