RhinoCommon SDK
RhinoDoc.ReadFile Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.RhinoDoc.ReadFile(System.String,Rhino.FileIO.FileReadOptions)"]
Namespace: Rhino
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static bool ReadFile(
	string path,
	FileReadOptions options
)
Public Shared Function ReadFile (
	path As String,
	options As FileReadOptions
) As Boolean
Parameters
path
Type: System.String
[Missing <param name="path"/> documentation for "M:Rhino.RhinoDoc.ReadFile(System.String,Rhino.FileIO.FileReadOptions)"]
options
Type: Rhino.FileIO.FileReadOptions
[Missing <param name="options"/> documentation for "M:Rhino.RhinoDoc.ReadFile(System.String,Rhino.FileIO.FileReadOptions)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.RhinoDoc.ReadFile(System.String,Rhino.FileIO.FileReadOptions)"]
See Also
Reference
RhinoDoc Class
Rhino Namespace