RhinoCommon SDK
Brep.Vertices Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.Geometry.Brep.Vertices"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public BrepVertexList Vertices { get; }
Public ReadOnly Property Vertices As BrepVertexList
	Get
Property Value
Type: BrepVertexList
See Also
Reference
Brep Class
Rhino.Geometry Namespace