RhinoCommon SDK
CalculateBoundingBoxEventArgs Class
Rhino for Mac 5.1
[Missing <summary> documentation for "T:Rhino.Display.CalculateBoundingBoxEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Display.DrawEventArgs
 Rhino.Display.CalculateBoundingBoxEventArgs
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public class CalculateBoundingBoxEventArgs : DrawEventArgs
Public Class CalculateBoundingBoxEventArgs
	Inherits DrawEventArgs
The CalculateBoundingBoxEventArgs type exposes the following members.
Properties
Name | Description
BoundingBox
 Gets the current bounding box.
Top
Methods
Name | Description
IncludeBoundingBox
 Unites a bounding box with the current display bounding box in order to ensure dynamic objects in "box" are drawn.
Top
See Also
Reference
Rhino.Display Namespace