RhinoCommon SDK
Dialogs.ShowPropertyListBox Method
Rhino for Mac 5.1
[Missing <summary> documentation for "M:Rhino.UI.Dialogs.ShowPropertyListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.String})"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static string[] ShowPropertyListBox(
	string title,
	string message,
	IList items,
	IList<string> values
)
Public Shared Function ShowPropertyListBox (
	title As String,
	message As String,
	items As IList,
	values As IList(Of String)
) As String()
Parameters
title
Type: System.String
[Missing <param name="title"/> documentation for "M:Rhino.UI.Dialogs.ShowPropertyListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.String})"]
message
Type: System.String
[Missing <param name="message"/> documentation for "M:Rhino.UI.Dialogs.ShowPropertyListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.String})"]
items
Type: System.Collections.IList
[Missing <param name="items"/> documentation for "M:Rhino.UI.Dialogs.ShowPropertyListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.String})"]
values
Type: System.Collections.Generic.IList<String>
[Missing <param name="values"/> documentation for "M:Rhino.UI.Dialogs.ShowPropertyListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.String})"]
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.UI.Dialogs.ShowPropertyListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.String})"]
See Also
Reference
Dialogs Class
Rhino.UI Namespace