RhinoCommon SDK
InstanceDefinitionTableEventArgs.InstanceDefinitionIndex Property
Rhino for Mac 5.1
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs.InstanceDefinitionIndex"]
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public int InstanceDefinitionIndex { get; }
Public ReadOnly Property InstanceDefinitionIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
InstanceDefinitionTableEventArgs Class
Rhino.DocObjects.Tables Namespace