RhinoCommon SDK
Brep.Standardize Method
Rhino for Mac 5.1
 Standardizes all trims, edges, and faces in the brep. After standardizing, there may be unused curves and surfaces in the brep. Call Brep.Compact to remove these unused curves and surfaces.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public void Standardize()
Public Sub Standardize
See Also
Reference
Brep Class
Rhino.Geometry Namespace