RhinoCommon SDK
File3dmObjectTable.AddTextDot Method (String, Point3d)
Rhino for Mac 5.1
Adds a text dot object to the table.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public Guid AddTextDot(
	string text,
	Point3d location
)
Public Function AddTextDot (
	text As String,
	location As Point3d
) As Guid
Parameters
text
Type: System.String
The text.
location
Type: Rhino.Geometry.Point3d
The location.
Return Value
Type: Guid
A unique identifier for the object.
See Also
Reference
File3dmObjectTable Class
AddTextDot Overload
Rhino.FileIO Namespace