RhinoCommon SDK
RadialDimension Constructor (Circle, Point3d, Double)
Rhino for Mac 5.1
 Construct a radial dimension from 3d input
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public RadialDimension(
	Circle circle,
	Point3d arrowTip,
	double offsetDistance
)
Public Sub New (
	circle As Circle,
	arrowTip As Point3d,
	offsetDistance As Double
)
Parameters
circle
Type: Rhino.Geometry.Circle
[Missing <param name="circle"/> documentation for "M:Rhino.Geometry.RadialDimension.#ctor(Rhino.Geometry.Circle,Rhino.Geometry.Point3d,System.Double)"]
arrowTip
Type: Rhino.Geometry.Point3d
3d point on the circle at the dimension arrow tip
offsetDistance
Type: System.Double
distance from arrow tip to knee point
See Also
Reference
RadialDimension Class
RadialDimension Overload
Rhino.Geometry Namespace