RhinoCommon SDK
Quaternion.Length Property
Rhino for Mac 5.1
 Returns the length or norm of the quaternion.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
Math.Sqrt(a*a + b*b + c*c + d*d)
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace