RhinoCommon SDK
Point3dList.ClosestIndexInList Method
Rhino for Mac 5.1
 Finds the index of the point in a list of points that is closest to a test point.
Namespace: Rhino.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.50000.0 (5.0.20693.0)
Syntax
public static int ClosestIndexInList(
	IList<Point3d> list,
	Point3d testPoint
)
Public Shared Function ClosestIndexInList (
	list As IList(Of Point3d),
	testPoint As Point3d
) As Integer
Parameters
list
Type: System.Collections.Generic.IList<Point3d>
A list of points.
testPoint
Type: Rhino.Geometry.Point3d
Point to compare against.
Return Value
Type: Int32
Index of closest point in the list on success or -1 on error.
See Also
Reference
Point3dList Class
Rhino.Collections Namespace