RhinoCommon API
ChannelGPU Fields
The RenderWindow.ChannelGPU type exposes the following members.
Fields
Name | Description
m_cpp
Top
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace