RhinoCommon API
Channel Fields
The RenderWindow.Channel type exposes the following members.
Fields
Name | Description
m_pChannel
Top
See Also
Reference
RenderWindow.Channel Class
Rhino.Render Namespace