RhinoCommon API
PostEffectPlugIn Fields
The PostEffectPlugIn type exposes the following members.
Fields
Name | Description
m_cpp
uf_ProductionRendering
uf_RealtimeRendering
uf_ViewportDisplay
Top
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace