RhinoCommon API
PostEffectPipeline Fields
The PostEffectPipeline type exposes the following members.
Fields
Name | Description
ncf_File
ncf_GPU
ncf_None
Top
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace