RhinoCommon API
NurbsCurve.GrevilleParameters Method
 Gets all Greville parameters for this curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double[] GrevilleParameters()
Public Function GrevilleParameters As Double()
Return Value
Type: Double[]
[Missing <returns> documentation for "M:Rhino.Geometry.NurbsCurve.GrevilleParameters"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace