RhinoCommon API
SnapShotsClient.Name Method
 The client's name.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract string Name()
Public MustOverride Function Name As String
Return Value
Type: String
The client's name.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace