RhinoCommon API
ArchivableDictionary.ContainsKey Method
 Determines whether the dictionary contains the specified key.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ContainsKey(
	string key
)
Public Function ContainsKey (
	key As String
) As Boolean
Parameters
key
Type: System.String
The key to locate.
Return Value
Type: Boolean
true if the dictionary contains an element with the specified key; otherwise, false.
Implements
IDictionary<TKey, TValue>.ContainsKey(TKey)
Exceptions
Exception | Condition
ArgumentNullException | key is null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ArchivableDictionary Class
Rhino.Collections Namespace