RhinoCommon API
BezierCurve.CurvatureAt Method
Evaluate the curvature vector at a curve parameter.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d CurvatureAt(
	double t
)
Public Function CurvatureAt (
	t As Double
) As Vector3d
Parameters
t
Type: System.Double
Evaluation parameter.
Return Value
Type: Vector3d
Curvature vector of the curve at the parameter t.
Remarks
No error handling.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace