RhinoCommon API
ObjRef.PointCloud Method
 Gets the point cloud if the referenced geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointCloud PointCloud()
Public Function PointCloud As PointCloud
Return Value
Type: PointCloud
A point cloud; or null if the referenced object is not a point cloud, or on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace