RhinoCommon API
ListablePostEffectPlugIn.SetOn Method
 Turn the PEP on or off.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void SetOn(
	bool bOn
)
Public Overridable Sub SetOn (
	bOn As Boolean
)
Parameters
bOn
Type: System.Boolean
[Missing <param name="bOn"/> documentation for "M:Rhino.Render.PostEffects.ListablePostEffectPlugIn.SetOn(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ListablePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace