RhinoCommon API
Interpolator Constructor (IEnumerable<Double>)
 Constructs an Interpolator from a collection of numbers.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interpolator(
	IEnumerable<double> collection
)
Public Sub New (
	collection As IEnumerable(Of Double)
)
Parameters
collection
Type: System.Collections.Generic.IEnumerable<Double>
Collection of numbers to duplicate.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Interpolator Class
Interpolator Overload
Rhino.Geometry Namespace