RhinoCommon API
Rectangle3d.MakeIncreasing Method
 Ensures the X and Y dimensions are increasing or singleton intervals.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void MakeIncreasing()
Public Sub MakeIncreasing
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace