RhinoCommon API
GetBaseClass.OptionIndex Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetBaseClass.OptionIndex"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int OptionIndex()
Public Function OptionIndex As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Input.Custom.GetBaseClass.OptionIndex"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetBaseClass Class
Rhino.Input.Custom Namespace