RhinoCommon API
RhinoList<T>.Add Method
 Adds an object to the end of the List.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Add(
	T item
)
Public Sub Add (
	item As T
)
Parameters
item
Type: T
Item to append.
Implements
ICollection<T>.Add(T)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoList<T> Class
Rhino.Collections Namespace