RhinoCommon API
PostEffects.GetEarlyPostEffects Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffects.GetEarlyPostEffects"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public EarlyPostEffectPlugInArray GetEarlyPostEffects()
Public Function GetEarlyPostEffects As EarlyPostEffectPlugInArray
Return Value
Type: EarlyPostEffectPlugInArray
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffects.GetEarlyPostEffects"]
See Also
Reference
PostEffects Class
Rhino.Render.PostEffects Namespace