RhinoCommon API
PostEffectPlugIn Constructor (IntPtr)
Initializes a new instance of the PostEffectPlugIn class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PostEffectPlugIn(
	IntPtr pPEP
)
Public Sub New (
	pPEP As IntPtr
)
Parameters
pPEP
Type: System.IntPtr
[Missing <param name="pPEP"/> documentation for "M:Rhino.Render.PostEffects.PostEffectPlugIn.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPlugIn Class
PostEffectPlugIn Overload
Rhino.Render.PostEffects Namespace