RhinoCommon API
BlockEditCommand Constructor
Initializes a new instance of the BlockEditCommand class
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected BlockEditCommand()
Protected Sub New
See Also
Reference
BlockEditCommand Class
Rhino.Commands Namespace