RhinoCommon API
RenderPipeline.PauseRendering Method
 Implement to pause the current render session
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void PauseRendering()
Public Overridable Sub PauseRendering
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace