RhinoCommon SDK
DisplayBitmapDrawList Constructor
Initializes a new instance of the DisplayBitmapDrawList class
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DisplayBitmapDrawList()
Public Sub New
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace