RhinoCommon API
TextureEvaluator.NewByteArray Method
[Missing <summary> documentation for "M:Rhino.Render.TextureEvaluator.NewByteArray(System.Int32,System.Int32)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static IntPtr NewByteArray(
	int width,
	int height
)
Public Shared Function NewByteArray (
	width As Integer,
	height As Integer
) As IntPtr
Parameters
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.Render.TextureEvaluator.NewByteArray(System.Int32,System.Int32)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.Render.TextureEvaluator.NewByteArray(System.Int32,System.Int32)"]
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Render.TextureEvaluator.NewByteArray(System.Int32,System.Int32)"]
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace