RhinoCommon API
RenderMaterial.PhysicallyBased Constructor
Initializes a new instance of the RenderMaterial.PhysicallyBased class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PhysicallyBased()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderMaterial.PhysicallyBased Class
Rhino.Render Namespace