RhinoCommon API
RenderMaterial.PhysicallyBased.ChildSlotNames Constructor
Initializes a new instance of the RenderMaterial.PhysicallyBased.ChildSlotNames class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ChildSlotNames()
Public Sub New
See Also
Reference
RenderMaterial.PhysicallyBased.ChildSlotNames Class
Rhino.Render Namespace