RhinoCommon SDK
SubDLimitMesh.Create Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDLimitMesh.Create(Rhino.Geometry.SubDFacesIterator,Rhino.Geometry.SubDDisplayParameters)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static SubDLimitMesh Create(
	SubDFacesIterator fen,
	SubDDisplayParameters limitMeshParameters
)
Public Shared Function Create (
	fen As SubDFacesIterator,
	limitMeshParameters As SubDDisplayParameters
) As SubDLimitMesh
Parameters
fen
Type: Rhino.Geometry.SubDFacesIterator
[Missing <param name="fen"/> documentation for "M:Rhino.Geometry.SubDLimitMesh.Create(Rhino.Geometry.SubDFacesIterator,Rhino.Geometry.SubDDisplayParameters)"]
limitMeshParameters
Type: Rhino.Geometry.SubDDisplayParameters
[Missing <param name="limitMeshParameters"/> documentation for "M:Rhino.Geometry.SubDLimitMesh.Create(Rhino.Geometry.SubDFacesIterator,Rhino.Geometry.SubDDisplayParameters)"]
Return Value
Type: SubDLimitMesh
[Missing <returns> documentation for "M:Rhino.Geometry.SubDLimitMesh.Create(Rhino.Geometry.SubDFacesIterator,Rhino.Geometry.SubDDisplayParameters)"]
See Also
Reference
SubDLimitMesh Class
Rhino.Geometry Namespace