RhinoCommon SDK
MeshNgon.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace