RhinoCommon API
RTree.Insert Method (Point2d, Int32)
Inserts an element into the tree.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Insert(
	Point2d point,
	int elementId
)
Public Function Insert (
	point As Point2d,
	elementId As Integer
) As Boolean
Parameters
point
Type: Rhino.Geometry.Point2d
A point.
elementId
Type: System.Int32
A number.
Return Value
Type: Boolean
true if element was successfully inserted.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RTree Class
Insert Overload
Rhino.Geometry Namespace