RhinoCommon API
RenderMaterial.SimulatedMaterial Method (Boolean)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.SimulatedMaterial(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
[ObsoleteAttribute]
public Material SimulatedMaterial(
	bool isForDataOnly
)
<ObsoleteAttribute>
Public Function SimulatedMaterial (
	isForDataOnly As Boolean
) As Material
Parameters
isForDataOnly
Type: System.Boolean
[Missing <param name="isForDataOnly"/> documentation for "M:Rhino.Render.RenderMaterial.SimulatedMaterial(System.Boolean)"]
Return Value
Type: Material
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.SimulatedMaterial(System.Boolean)"]
See Also
Reference
RenderMaterial Class
SimulatedMaterial Overload
Rhino.Render Namespace