RhinoCommon API
TextFields.ObjectName Method
 Return an object's name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string ObjectName(
	string id
)
Public Shared Function ObjectName (
	id As String
) As String
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.ObjectName(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.ObjectName(System.String)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextFields Class
Rhino.Runtime Namespace