RhinoCommon API
MeshExtruder.Dispose Method
 Dispose of this object and any unmanaged memory associated with it.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace