RhinoCommon API
TextFields.DateModified Method
 Date the document was last edited
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string DateModified()
Public Shared Function DateModified As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.DateModified"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextFields Class
DateModified Overload
Rhino.Runtime Namespace