RhinoCommon API
FieldDictionary.AddTextured Method (String, String, String)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.String,System.String)"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
[ObsoleteAttribute]
public StringField AddTextured(
	string key,
	string value,
	string prompt
)
<ObsoleteAttribute>
Public Function AddTextured (
	key As String,
	value As String,
	prompt As String
) As StringField
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.String,System.String)"]
value
Type: System.String
[Missing <param name="value"/> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.String,System.String)"]
prompt
Type: System.String
[Missing <param name="prompt"/> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.String,System.String)"]
Return Value
Type: StringField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.String,System.String)"]
See Also
Reference
FieldDictionary Class
AddTextured Overload
Rhino.Render.Fields Namespace