RhinoCommon SDK
Sun.GetDateTime Method
[Missing <summary> documentation for "M:Rhino.Render.Sun.GetDateTime(System.DateTimeKind)"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DateTime GetDateTime(
	DateTimeKind kind
)
Public Function GetDateTime (
	kind As DateTimeKind
) As DateTime
Parameters
kind
Type: System.DateTimeKind
[Missing <param name="kind"/> documentation for "M:Rhino.Render.Sun.GetDateTime(System.DateTimeKind)"]
Return Value
Type: DateTime
[Missing <returns> documentation for "M:Rhino.Render.Sun.GetDateTime(System.DateTimeKind)"]
See Also
Reference
Sun Class
Rhino.Render Namespace