RhinoCommon API
Curve.DivideEquidistant Method
 Calculates 3d points on a curve where the linear distance between the points is equal.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public Point3d[] DivideEquidistant(
	double distance
)
Public Function DivideEquidistant (
	distance As Double
) As Point3d()
Parameters
distance
Type: System.Double
The distance between division points.
Return Value
Type: Point3d[]
An array of equidistant points, or null on error.
See Also
Reference
Curve Class
Rhino.Geometry Namespace