RhinoCommon API
Box.FurthestPoint Method
 Finds the furthest point on the Box. The Box should be Valid for this to work properly.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d FurthestPoint(
	Point3d point
)
Public Function FurthestPoint (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
Sample point.
Return Value
Type: Point3d
The point on the box that is furthest from the sample point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Box Structure
Rhino.Geometry Namespace