RhinoCommon API
Curve.IsInPlane Method (Plane)
Test a curve to see if it lies in a specific plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsInPlane(
	Plane testPlane
)
Public Function IsInPlane (
	testPlane As Plane
) As Boolean
Parameters
testPlane
Type: Rhino.Geometry.Plane
Plane to test for.
Return Value
Type: Boolean
 true if the maximum distance from the curve to the testPlane is <= RhinoMath.ZeroTolerance.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Curve Class
IsInPlane Overload
Rhino.Geometry Namespace