RhinoCommon API
Intersection.MeshMeshFast Method
Note: This API is now obsolete.
 This is an old overload kept for compatibility. Overlaps and near misses are ignored.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use the MeshMesh() method.")]
public static Line[] MeshMeshFast(
	Mesh meshA,
	Mesh meshB
)
<ObsoleteAttribute("Use the MeshMesh() method.")>
Public Shared Function MeshMeshFast (
	meshA As Mesh,
	meshB As Mesh
) As Line()
Parameters
meshA
Type: Rhino.Geometry.Mesh
First mesh for intersection.
meshB
Type: Rhino.Geometry.Mesh
Second mesh for intersection.
Return Value
Type: Line[]
An array of intersection line segments, or null if no intersections were found.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace