RhinoCommon API
PolylineCurve.Parameter Method
 Gets a parameter at a specified index in the polyline curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Parameter(
	int index
)
Public Function Parameter (
	index As Integer
) As Double
Parameters
index
Type: System.Int32
An index.
Return Value
Type: Double
A parameter.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PolylineCurve Class
Rhino.Geometry Namespace