RhinoCommon API
GetContextCallback.DisableForAllContexts Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetContextCallback.DisableForAllContexts"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DisableForAllContexts()
Public Sub DisableForAllContexts
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetContextCallback Class
Rhino.Input.Custom Namespace