RhinoCommon API
CustomDisplay.AddCurve Method (Curve, Color)
 Adds a new, colored curve to the display list. The curve will be duplicated so changes to the original will not affect the display.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddCurve(
	Curve curve,
	Color color
)
Public Sub AddCurve (
	curve As Curve,
	color As Color
)
Parameters
curve
Type: Rhino.Geometry.Curve
Curve to add.
color
Type: System.Drawing.Color
Color of curve.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CustomDisplay Class
AddCurve Overload
Rhino.Display Namespace