RhinoCommon SDK
ChangeQueue.ApplyGammaChanges Method
 Override this when you want to handle gamma changes
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void ApplyGammaChanges(
	double dGamma
)
Protected Overridable Sub ApplyGammaChanges (
	dGamma As Double
)
Parameters
dGamma
Type: System.Double
[Missing <param name="dGamma"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyGammaChanges(System.Double)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace