RhinoCommon SDK
RLeader.Create Method
 Creates a RLeader geometry object
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static RLeader Create(
	RichText richtext,
	Plane plane,
	Point3d[] points,
	double leaderscale,
	LeaderCurveType curvetype,
	AnnotationArrowheadType arrowtype,
	string arrow_name
)
Public Shared Function Create (
	richtext As RichText,
	plane As Plane,
	points As Point3d(),
	leaderscale As Double,
	curvetype As LeaderCurveType,
	arrowtype As AnnotationArrowheadType,
	arrow_name As String
) As RLeader
Parameters
richtext
Type: Rhino.Geometry.RichText
[Missing <param name="richtext"/> documentation for "M:Rhino.Geometry.RLeader.Create(Rhino.Geometry.RichText,Rhino.Geometry.Plane,Rhino.Geometry.Point3d[],System.Double,Rhino.Geometry.LeaderCurveType,Rhino.Geometry.AnnotationArrowheadType,System.String)"]
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.RLeader.Create(Rhino.Geometry.RichText,Rhino.Geometry.Plane,Rhino.Geometry.Point3d[],System.Double,Rhino.Geometry.LeaderCurveType,Rhino.Geometry.AnnotationArrowheadType,System.String)"]
points
Type: Rhino.Geometry.Point3d[]
[Missing <param name="points"/> documentation for "M:Rhino.Geometry.RLeader.Create(Rhino.Geometry.RichText,Rhino.Geometry.Plane,Rhino.Geometry.Point3d[],System.Double,Rhino.Geometry.LeaderCurveType,Rhino.Geometry.AnnotationArrowheadType,System.String)"]
leaderscale
Type: System.Double
[Missing <param name="leaderscale"/> documentation for "M:Rhino.Geometry.RLeader.Create(Rhino.Geometry.RichText,Rhino.Geometry.Plane,Rhino.Geometry.Point3d[],System.Double,Rhino.Geometry.LeaderCurveType,Rhino.Geometry.AnnotationArrowheadType,System.String)"]
curvetype
Type: Rhino.Geometry.LeaderCurveType
[Missing <param name="curvetype"/> documentation for "M:Rhino.Geometry.RLeader.Create(Rhino.Geometry.RichText,Rhino.Geometry.Plane,Rhino.Geometry.Point3d[],System.Double,Rhino.Geometry.LeaderCurveType,Rhino.Geometry.AnnotationArrowheadType,System.String)"]
arrowtype
Type: Rhino.Geometry.AnnotationArrowheadType
[Missing <param name="arrowtype"/> documentation for "M:Rhino.Geometry.RLeader.Create(Rhino.Geometry.RichText,Rhino.Geometry.Plane,Rhino.Geometry.Point3d[],System.Double,Rhino.Geometry.LeaderCurveType,Rhino.Geometry.AnnotationArrowheadType,System.String)"]
arrow_name
Type: System.String
[Missing <param name="arrow_name"/> documentation for "M:Rhino.Geometry.RLeader.Create(Rhino.Geometry.RichText,Rhino.Geometry.Plane,Rhino.Geometry.Point3d[],System.Double,Rhino.Geometry.LeaderCurveType,Rhino.Geometry.AnnotationArrowheadType,System.String)"]
Return Value
Type: RLeader
[Missing <returns> documentation for "M:Rhino.Geometry.RLeader.Create(Rhino.Geometry.RichText,Rhino.Geometry.Plane,Rhino.Geometry.Point3d[],System.Double,Rhino.Geometry.LeaderCurveType,Rhino.Geometry.AnnotationArrowheadType,System.String)"]
See Also
Reference
RLeader Class
Rhino.Geometry Namespace