RhinoCommon API
ObjectTable.AddPoints Method (IEnumerable<Point3f>)
 Adds multiple points to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoList<Guid> AddPoints(
	IEnumerable<Point3f> points
)
Public Function AddPoints (
	points As IEnumerable(Of Point3f)
) As RhinoList(Of Guid)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3f>
Points to add.
Return Value
Type: RhinoList<Guid>
List of object ids.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectTable Class
AddPoints Overload
Rhino.DocObjects.Tables Namespace