RhinoCommon API
OptionColor.Dispose Method
Releases all resources used by the OptionColor
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
OptionColor Class
Dispose Overload
Rhino.Input.Custom Namespace