RhinoCommon API
Vector3f.Multiply Method (Single, Vector3f)
 Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3f Multiply(
	float t,
	Vector3f vector
)
Public Shared Function Multiply (
	t As Single,
	vector As Vector3f
) As Vector3f
Parameters
t
Type: System.Single
A number.
vector
Type: Rhino.Geometry.Vector3f
A vector.
Return Value
Type: Vector3f
A new vector that is the original vector coordinate-wise multiplied by t.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Vector3f Structure
Multiply Overload
Rhino.Geometry Namespace