RhinoCommon SDK
Dialogs.StringBoxRects Method
Rhino 5 for Windows
 FOR INTERNAL TESTING Ignore - this is for internal testing and will be removed.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.30000.17 (5.13.60913.21340)
Syntax
public static Rectangle[] StringBoxRects()
Public Shared Function StringBoxRects As Rectangle()
Return Value
Type: Rectangle[]
 On Windows (.NET) {X=0,Y=0,Width=300,Height=126} {X=0,Y=0,Width=284,Height=88} {X=0,Y=0,Width=284,Height=88} {X=10,Y=9,Width=49,Height=13} {X=0,Y=0,Width=49,Height=13} {X=0,Y=0,Width=49,Height=13} {X=197,Y=55,Width=75,Height=23} {X=0,Y=0,Width=75,Height=23} {X=0,Y=0,Width=75,Height=23} {X=116,Y=55,Width=75,Height=23} {X=0,Y=0,Width=75,Height=23} {X=0,Y=0,Width=75,Height=23} {X=13,Y=29,Width=259,Height=20} {X=0,Y=0,Width=255,Height=16} {X=0,Y=0,Width=255,Height=16}
See Also
Reference
Dialogs Class
Rhino.UI Namespace