RhinoCommon API
HermiteSurface.NonConstPointer Method
 Gets the non-const pointer (for modification) of this class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr NonConstPointer()
Public Function NonConstPointer As IntPtr
Return Value
Type: IntPtr
The non-const pointer.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace