RhinoCommon API
SubDFaceList.GetEnumerator Method
 Implementation of IEnumerable
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<SubDFace> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of SubDFace)
Return Value
Type: IEnumerator<SubDFace>
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDFaceList.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SubDFaceList Class
Rhino.Geometry.Collections Namespace