RhinoCommon API
Mesh.NonConstOperation Method
 Clear local cache on non constant calls
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void NonConstOperation()
Protected Overrides Sub NonConstOperation
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Mesh Class
Rhino.Geometry Namespace