RhinoCommon API
MaterialRef.Dispose Method
Releases all resources used by the MaterialRef
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace