RhinoCommon API
Channel.GPU_Const Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.Channel.GPU_Const"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderWindow.ChannelGPU GPU_Const()
Public Function GPU_Const As RenderWindow.ChannelGPU
Return Value
Type: RenderWindow.ChannelGPU
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.Channel.GPU_Const"]
See Also
Reference
Channel Class
Rhino.Render.PostEffects Namespace