RhinoCommon SDK
Sun.Dispose Method (Boolean)
Rhino 5 for Windows
Releases the unmanaged resources used by the Sun and optionally releases the managed resources
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.30000.17 (5.13.60913.21340)
Syntax
protected virtual void Dispose(
	bool disposing
)
Protected Overridable Sub Dispose (
	disposing As Boolean
)
Parameters
disposing
Type: System.Boolean
True to release both managed and unmanaged resources; false to release only unmanaged resources
See Also
Reference
Sun Class
Dispose Overload
Rhino.Render Namespace