RhinoCommon API
ChannelDataCollection Constructor
Initializes a new instance of the ChannelDataCollection class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ChannelDataCollection()
Public Sub New
See Also
Reference
ChannelDataCollection Class
Rhino.Render.PostEffects Namespace