RhinoCommon SDK
MeshVertexNormalList.Flip Method
 Reverses direction of all vertex normals
This is the same as Mesh.Flip(true, false, false)
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Flip()
Public Sub Flip
See Also
Reference
MeshVertexNormalList Class
Rhino.Geometry.Collections Namespace