RhinoCommon API
StretchSpaceMorph Constructor (Point3d, Point3d, Point3d)
 Constructs a stretch space morph.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public StretchSpaceMorph(
	Point3d start,
	Point3d end,
	Point3d point
)
Public Sub New (
	start As Point3d,
	end As Point3d,
	point As Point3d
)
Parameters
start
Type: Rhino.Geometry.Point3d
Start of stretch axis.
end
Type: Rhino.Geometry.Point3d
End of stretch axis.>
point
Type: Rhino.Geometry.Point3d
End of new stretch axis.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
StretchSpaceMorph Class
StretchSpaceMorph Overload
Rhino.Geometry.Morphs Namespace