RhinoCommon API
ObjectAttributes.SetClipParticipationForNone Method
 Object is immune to the effects of all clipping planes
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetClipParticipationForNone()
Public Sub SetClipParticipationForNone
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace