RhinoCommon API
BinaryArchiveWriter.WritePoint2d Method
 Writes a Point2d value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WritePoint2d(
	Point2d value
)
Public Sub WritePoint2d (
	value As Point2d
)
Parameters
value
Type: Rhino.Geometry.Point2d
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace