RhinoCommon SDK
TextureEvaluator.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.TextureEvaluator.Finalize"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace