RhinoCommon API
CursorTooltipSettings.GetDefaultState Method
 Gets the cursor tooltip factory settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static CursorTooltipSettingsState GetDefaultState()
Public Shared Function GetDefaultState As CursorTooltipSettingsState
Return Value
Type: CursorTooltipSettingsState
A new cursor tooltip state with factory settings.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace