RhinoCommon API
ToneMappingPostEffectPlugIn Constructor
Initializes a new instance of the ToneMappingPostEffectPlugIn class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ToneMappingPostEffectPlugIn()
Public Sub New
See Also
Reference
ToneMappingPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace