RhinoCommon API
NamedParametersEventArgs.Set Method (String, Color)
 Set a Point3d value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Set(
	string name,
	Color value
)
Public Sub Set (
	name As String,
	value As Color
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Drawing.Color)"]
value
Type: System.Drawing.Color
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Drawing.Color)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
NamedParametersEventArgs Class
Set Overload
Rhino.Runtime Namespace