RhinoCommon API
ListablePostEffectPlugIn Constructor
Initializes a new instance of the ListablePostEffectPlugIn class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ListablePostEffectPlugIn()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ListablePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace