RhinoCommon API
RenderContent.IsReference Method
 Query whether or not the content or any of its ancestors is a reference content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsReference()
Public Function IsReference As Boolean
Return Value
Type: Boolean
true if the content is a reference, else false
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderContent Class
Rhino.Render Namespace