RhinoCommon SDK
RichText.Create Method
 Create RichText geometry or null if input is invalid
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static RichText Create(
	string richTextString,
	TextStyleTable textStyleTable,
	Plane plane,
	double height,
	TextHorizontalAlignment horizontalAlignment,
	TextVerticalAlignment verticalAlignment,
	double rectWidth,
	double rectHeight
)
Public Shared Function Create (
	richTextString As String,
	textStyleTable As TextStyleTable,
	plane As Plane,
	height As Double,
	horizontalAlignment As TextHorizontalAlignment,
	verticalAlignment As TextVerticalAlignment,
	rectWidth As Double,
	rectHeight As Double
) As RichText
Parameters
richTextString
Type: System.String
textStyleTable
Type: Rhino.DocObjects.Tables.TextStyleTable
plane
Type: Rhino.Geometry.Plane
height
Type: System.Double
horizontalAlignment
Type: Rhino.Geometry.TextHorizontalAlignment
verticalAlignment
Type: Rhino.Geometry.TextVerticalAlignment
rectWidth
Type: System.Double
rectHeight
Type: System.Double
Return Value
Type: RichText
[Missing <returns> documentation for "M:Rhino.Geometry.RichText.Create(System.String,Rhino.DocObjects.Tables.TextStyleTable,Rhino.Geometry.Plane,System.Double,Rhino.Geometry.TextHorizontalAlignment,Rhino.Geometry.TextVerticalAlignment,System.Double,System.Double)"]
See Also
Reference
RichText Class
Rhino.Geometry Namespace