RhinoCommon API
RhinoViewport.GetFrustumCenter Method
 Returns world coordinates of frustum's center.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetFrustumCenter(
	out Point3d center
)
Public Function GetFrustumCenter (
	<OutAttribute> ByRef center As Point3d
) As Boolean
Parameters
center
Type: Rhino.Geometry.Point3d
The center coordinate is assigned to this out parameter if this call succeeds.
Return Value
Type: Boolean
true if the center was successfully computed.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace