RhinoCommon SDK
CurveBlend.HandlePoint Method
 Returns the location of a handle point of the blend
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d HandlePoint(
	int end,
	int index
)
Public Function HandlePoint (
	end As Integer,
	index As Integer
) As Point3d
Parameters
end
Type: System.Int32
Get 0: start, 1: end
index
Type: System.Int32
Point to get
Return Value
Type: Point3d
Point location
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace