RhinoCommon API
Curve.RemoveShortSegments Method
 Looks for segments that are shorter than tolerance that can be removed. Does not change the domain, but it will change the relative parameterization.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RemoveShortSegments(
	double tolerance
)
Public Function RemoveShortSegments (
	tolerance As Double
) As Boolean
Parameters
tolerance
Type: System.Double
Tolerance which defines "short" segments.
Return Value
Type: Boolean
 true if removable short segments were found. false if no removable short segments were found.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Curve Class
Rhino.Geometry Namespace