RhinoCommon SDK
SurfaceProxy Constructor
 Protected constructor for internal use.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected SurfaceProxy()
Protected Sub New
See Also
Reference
SurfaceProxy Class
Rhino.Geometry Namespace