RhinoCommon SDK
MeshVertexHiddenList.Add Method
 Adds a new flag at the end of the list.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Add(
	bool hidden
)
Public Sub Add (
	hidden As Boolean
)
Parameters
hidden
Type: System.Boolean
True if vertex is hidden.
Return Value
Type:
The index of the newly added hidden vertex.
See Also
Reference
MeshVertexHiddenList Class
Rhino.Geometry.Collections Namespace