RhinoCommon API
Surface.TryGetSphere Method (Sphere)
Test a surface to see if it is a portion of a sphere and return the sphere.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetSphere(
	out Sphere sphere
)
Public Function TryGetSphere (
	<OutAttribute> ByRef sphere As Sphere
) As Boolean
Parameters
sphere
Type: Rhino.Geometry.Sphere
On success, the sphere parameters are filled in.
Return Value
Type: Boolean
true if the surface is a portion of a sphere.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Surface Class
TryGetSphere Overload
Rhino.Geometry Namespace