RhinoCommon API
RhinoViewport.KeyboardDollyInOut Method
 Emulates the keyboard arrow key in terms of interaction.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool KeyboardDollyInOut(
	double amount
)
Public Function KeyboardDollyInOut (
	amount As Double
) As Boolean
Parameters
amount
Type: System.Double
The dolly amount.
Return Value
Type: Boolean
true if operation succeeded; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace