RhinoCommon API
SweepTwoRail Constructor
Initializes a new instance of the SweepTwoRail class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SweepTwoRail()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace