RhinoCommon SDK
Dialogs.ShowMessageBox Method (String, String)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static ShowMessageBoxResult ShowMessageBox(
	string message,
	string title
)
Public Shared Function ShowMessageBox (
	message As String,
	title As String
) As ShowMessageBoxResult
Parameters
message
Type: System.String
Message box text content.
title
Type: System.String
Message box title text.
Return Value
Type: ShowMessageBoxResult
One of the ShowMessageBoxResult values.
See Also
Reference
Dialogs Class
ShowMessageBox Overload
Rhino.UI Namespace