RhinoCommon API
TextureEvaluator.Rdk_TextureEvaluator_ApplyGamma Method
[Missing <summary> documentation for "M:Rhino.Render.TextureEvaluator.Rdk_TextureEvaluator_ApplyGamma(System.IntPtr,System.Int32,System.Int32,System.Single)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void Rdk_TextureEvaluator_ApplyGamma(
	IntPtr p,
	int width,
	int height,
	float gamma
)
Public Shared Sub Rdk_TextureEvaluator_ApplyGamma (
	p As IntPtr,
	width As Integer,
	height As Integer,
	gamma As Single
)
Parameters
p
Type: System.IntPtr
[Missing <param name="p"/> documentation for "M:Rhino.Render.TextureEvaluator.Rdk_TextureEvaluator_ApplyGamma(System.IntPtr,System.Int32,System.Int32,System.Single)"]
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.Render.TextureEvaluator.Rdk_TextureEvaluator_ApplyGamma(System.IntPtr,System.Int32,System.Int32,System.Single)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.Render.TextureEvaluator.Rdk_TextureEvaluator_ApplyGamma(System.IntPtr,System.Int32,System.Int32,System.Single)"]
gamma
Type: System.Single
[Missing <param name="gamma"/> documentation for "M:Rhino.Render.TextureEvaluator.Rdk_TextureEvaluator_ApplyGamma(System.IntPtr,System.Int32,System.Int32,System.Single)"]
Return Value
Type:
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace