RhinoCommon API
GetTruncatedCone Constructor
Initializes a new instance of the GetTruncatedCone class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetTruncatedCone()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetTruncatedCone Class
Rhino.Input.Custom Namespace