RhinoCommon SDK
MeshNgon Constructor
 Constructs an empty ngon.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MeshNgon()
Public Sub New
See Also
Reference
MeshNgon Class
MeshNgon Overload
Rhino.Geometry Namespace