RhinoCommon API
Command.GetMostRecentCommands Method
 Gets an array of most recent command descriptions.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static MostRecentCommandDescription[] GetMostRecentCommands()
Public Shared Function GetMostRecentCommands As MostRecentCommandDescription()
Return Value
Type: MostRecentCommandDescription[]
An array of command descriptions.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Command Class
Rhino.Commands Namespace