RhinoCommon API
FieldDictionary.AddTextured Method (String, Double, String)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Double,System.String)"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.7
Syntax
[ObsoleteAttribute]
public DoubleField AddTextured(
	string key,
	double value,
	string prompt
)
<ObsoleteAttribute>
Public Function AddTextured (
	key As String,
	value As Double,
	prompt As String
) As DoubleField
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Double,System.String)"]
value
Type: System.Double
[Missing <param name="value"/> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Double,System.String)"]
prompt
Type: System.String
[Missing <param name="prompt"/> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Double,System.String)"]
Return Value
Type: DoubleField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Double,System.String)"]
See Also
Reference
FieldDictionary Class
AddTextured Overload
Rhino.Render.Fields Namespace