RhinoCommon API
Point3d Explicit Conversion (Point3d to Vector3d)
 Converts a point in a vector, needing casting.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static explicit operator Vector3d (
	Point3d point
)
Public Shared Narrowing Operator CType (
	point As Point3d
) As Vector3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
Return Value
Type: Vector3d
The resulting vector.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Point3d Structure
Explicit Overload
Rhino.Geometry Namespace