RhinoCommon API
PostEffectPlugIn.CRC Method
 A CRC of the state of this PEP.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual uint CRC()
Public Overridable Function CRC As UInteger
Return Value
Type: UInt32
returns a crc of PEP state
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace