RhinoCommon API
ChangeQueue.GetQueueRenderSettings Method
 Get render settings known to the queue at the time of the Flush
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderSettings GetQueueRenderSettings()
Public Function GetQueueRenderSettings As RenderSettings
Return Value
Type: RenderSettings
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.GetQueueRenderSettings"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace