RhinoCommon API
IHeaderButtonHandler.OnButtonClicked Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IHeaderButtonHandler.OnButtonClicked(System.Int32)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
bool OnButtonClicked(
	int index
)
Function OnButtonClicked (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.Controls.IHeaderButtonHandler.OnButtonClicked(System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.IHeaderButtonHandler.OnButtonClicked(System.Int32)"]
See Also
Reference
IHeaderButtonHandler Interface
Rhino.UI.Controls Namespace