RhinoCommon API
NamedParametersEventArgs.SetUnsignedInt Method
 Set an unsigned int for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetUnsignedInt(
	string name,
	uint value
)
Public Sub SetUnsignedInt (
	name As String,
	value As UInteger
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetUnsignedInt(System.String,System.UInt32)"]
value
Type: System.UInt32
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetUnsignedInt(System.String,System.UInt32)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace