RhinoCommon SDK
Utilities.LoadPersistantRenderContentFromFile Method
Rhino 5 for Windows
 Loads a content from a library file. Adds the content to the persistent content list.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.30000.16 (5.0.20693.0)
Syntax
public static RenderContent LoadPersistantRenderContentFromFile(
	string filename
)
Public Shared Function LoadPersistantRenderContentFromFile (
	filename As String
) As RenderContent
Parameters
filename
Type: System.String
is the full path to the file to be loaded.
Return Value
Type: RenderContent
The loaded content or null if an error occurred.
See Also
Reference
Utilities Class
Rhino.Render Namespace