RhinoCommon API
LatePostEffectPlugIn.Dispose Method
Releases all resources used by the LatePostEffectPlugIn
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LatePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace