RhinoCommon API
TextFields.GetInstanceAttributeFields Method
[Missing <summary> documentation for "M:Rhino.Runtime.TextFields.GetInstanceAttributeFields(Rhino.DocObjects.InstanceDefinition)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static TextFields.InstanceAttributeField[] GetInstanceAttributeFields(
	InstanceDefinition idef
)
Public Shared Function GetInstanceAttributeFields (
	idef As InstanceDefinition
) As TextFields.InstanceAttributeField()
Parameters
idef
Type: Rhino.DocObjects.InstanceDefinition
[Missing <param name="idef"/> documentation for "M:Rhino.Runtime.TextFields.GetInstanceAttributeFields(Rhino.DocObjects.InstanceDefinition)"]
Return Value
Type: TextFields.InstanceAttributeField[]
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.GetInstanceAttributeFields(Rhino.DocObjects.InstanceDefinition)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextFields Class
Rhino.Runtime Namespace