RhinoCommon API
ObjRef.Geometry Method
 Gets the geometry linked to the object targeted by this reference.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GeometryBase Geometry()
Public Function Geometry As GeometryBase
Return Value
Type: GeometryBase
The geometry.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace