RhinoCommon API
Squisher.SquishSurface Method (SquishParameters, Surface)
 Squish the surface into a flat brep
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep SquishSurface(
	SquishParameters sp,
	Surface surface
)
Public Function SquishSurface (
	sp As SquishParameters,
	surface As Surface
) As Brep
Parameters
sp
Type: Rhino.Geometry.SquishParameters
The parameters for the squish operation
surface
Type: Rhino.Geometry.Surface
The surface to be squished
Return Value
Type: Brep
A brep representing the flattened surface
See Also
Reference
Squisher Class
SquishSurface Overload
Rhino.Geometry Namespace