RhinoCommon API
DisplayPipeline.PopDepthWriting Method
 Pop a DepthWriting flag off the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void PopDepthWriting()
Public Sub PopDepthWriting
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace