RhinoCommon SDK
Silhouette.Dispose Method
 Disposes curves that this class has as fields
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
Silhouette Class
Rhino.Geometry Namespace