RhinoCommon API
DisplayPipeline.DrawBrepWires Method (Brep, Color, Int32)
 Draws all the wireframe curves of a brep object.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawBrepWires(
	Brep brep,
	Color color,
	int wireDensity
)
Public Sub DrawBrepWires (
	brep As Brep,
	color As Color,
	wireDensity As Integer
)
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to draw.
color
Type: System.Drawing.Color
Color of Wireframe curves.
wireDensity
Type: System.Int32
 "Density" of wireframe curves.
-1 = no internal wires.
 0 = default internal wires.
>0 = custom high density.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayPipeline Class
DrawBrepWires Overload
Rhino.Display Namespace