RhinoCommon API
TextureEvaluator.DumpToBytes Method
 Fast access to bitmap evaluator for Cycles - supply size (which you will probably have received from CRhRdkTexture::PixelSize) to see if the data can be extracted direct to a width*height*4 array of unsigned chars. This is implemented by EVF(L"CanBeDumpedToBytes", ON_2iSize*) != nullptr;
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public virtual void DumpToBytes(
	int width,
	int height,
	IntPtr buffer
)
Public Overridable Sub DumpToBytes (
	width As Integer,
	height As Integer,
	buffer As IntPtr
)
Parameters
width
Type: System.Int32
is the point for which to evaluate the texture.
height
Type: System.Int32
duvwdx is a ray differential.
buffer
Type: System.IntPtr
duvwdx is a ray differential.
Return Value
Type:
True if the evaluator returned a valid color. Otherwise false.
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace