RhinoCommon API
Line.ToString Method
 Constructs the string representation of this line, in the form "From,To".
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A text string.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Line Structure
ToString Overload
Rhino.Geometry Namespace