RhinoCommon API
Brep.CreateBooleanSplit Method (Brep, Brep, Double)
 Splits shared areas of Breps and creates separate Breps from the shared and unshared parts.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Brep[] CreateBooleanSplit(
	Brep firstBrep,
	Brep secondBrep,
	double tolerance
)
Public Shared Function CreateBooleanSplit (
	firstBrep As Brep,
	secondBrep As Brep,
	tolerance As Double
) As Brep()
Parameters
firstBrep
Type: Rhino.Geometry.Brep
The Brep to split.
secondBrep
Type: Rhino.Geometry.Brep
The cutting Brep.
tolerance
Type: System.Double
Tolerance to use for splitting operation. When in doubt, use the document's model absolute tolerance.
Return Value
Type: Brep[]
An array of Brep if successful, an empty array on failure.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Brep Class
CreateBooleanSplit Overload
Rhino.Geometry Namespace