RhinoCommon API
InstanceDefinitionTable.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.GetEnumerator"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<InstanceDefinition> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of InstanceDefinition)
Return Value
Type: IEnumerator<InstanceDefinition>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.InstanceDefinitionTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace