RhinoCommon API
SimpleArrayMeshPointer Constructor
 Initializes a new SimpleArrayMeshPointer instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayMeshPointer()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
SimpleArrayMeshPointer Class
Rhino.Runtime.InteropWrappers Namespace