RhinoCommon API
DrawingUtilities.DarkModeConvertPixel Method
[Missing <summary> documentation for "M:Rhino.UI.DrawingUtilities.DarkModeConvertPixel(System.Byte@,System.Byte@,System.Byte@)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void DarkModeConvertPixel(
	ref byte r,
	ref byte g,
	ref byte b
)
Public Shared Sub DarkModeConvertPixel (
	ByRef r As Byte,
	ByRef g As Byte,
	ByRef b As Byte
)
Parameters
r
Type: System.Byte
[Missing <param name="r"/> documentation for "M:Rhino.UI.DrawingUtilities.DarkModeConvertPixel(System.Byte@,System.Byte@,System.Byte@)"]
g
Type: System.Byte
[Missing <param name="g"/> documentation for "M:Rhino.UI.DrawingUtilities.DarkModeConvertPixel(System.Byte@,System.Byte@,System.Byte@)"]
b
Type: System.Byte
[Missing <param name="b"/> documentation for "M:Rhino.UI.DrawingUtilities.DarkModeConvertPixel(System.Byte@,System.Byte@,System.Byte@)"]
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace