RhinoCommon API
OptionsDialogPage.RunScript Method
[Missing <summary> documentation for "M:Rhino.UI.OptionsDialogPage.RunScript(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual Result RunScript(
	RhinoDoc doc,
	RunMode mode
)
Public Overridable Function RunScript (
	doc As RhinoDoc,
	mode As RunMode
) As Result
Parameters
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.UI.OptionsDialogPage.RunScript(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
mode
Type: Rhino.Commands.RunMode
[Missing <param name="mode"/> documentation for "M:Rhino.UI.OptionsDialogPage.RunScript(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
Return Value
Type: Result
[Missing <returns> documentation for "M:Rhino.UI.OptionsDialogPage.RunScript(Rhino.RhinoDoc,Rhino.Commands.RunMode)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
OptionsDialogPage Class
Rhino.UI Namespace