RhinoCommon API
Skin.ShowHelp Method
 Called when the "help" splash screen should be shown. Default implementation just calls ShowSplash()
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ShowHelp()
Protected Overridable Sub ShowHelp
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Skin Class
Rhino.Runtime Namespace