RhinoCommon API
RhinoCore.RaiseIdle Method
 Raises the Idle event.
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RaiseIdle()
Public Sub RaiseIdle
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoCore Class
Rhino.Runtime.InProcess Namespace