RhinoCommon API
SafeFrame Constructor (SafeFrame)
 Create an utility object not associated with any document from another object
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SafeFrame(
	SafeFrame g
)
Public Sub New (
	g As SafeFrame
)
Parameters
g
Type: Rhino.Render.SafeFrame
[Missing <param name="g"/> documentation for "M:Rhino.Render.SafeFrame.#ctor(Rhino.Render.SafeFrame)"]
See Also
Reference
SafeFrame Class
SafeFrame Overload
Rhino.Render Namespace