RhinoCommon API
HermiteSurface Constructor (Int32, Int32)
 Initializes a new HermiteSurface instance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HermiteSurface(
	int uCount,
	int vCount
)
Public Sub New (
	uCount As Integer,
	vCount As Integer
)
Parameters
uCount
Type: System.Int32
The number of parameters in the "u" direction.
vCount
Type: System.Int32
The number of parameters in the "v" direction.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
HermiteSurface Class
HermiteSurface Overload
Rhino.Geometry Namespace