RhinoCommon API
Decal.TextureRenderCRC Method (TextureRenderHashFlags)
 Get the texture render CRC for the referenced texture using the TextureRenderHashFlags given
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public uint TextureRenderCRC(
	TextureRenderHashFlags rh
)
Public Function TextureRenderCRC (
	rh As TextureRenderHashFlags
) As UInteger
Parameters
rh
Type: Rhino.Render.TextureRenderHashFlags
[Missing <param name="rh"/> documentation for "M:Rhino.Render.Decal.TextureRenderCRC(Rhino.Render.TextureRenderHashFlags)"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.Decal.TextureRenderCRC(Rhino.Render.TextureRenderHashFlags)"]
See Also
Reference
Decal Class
TextureRenderCRC Overload
Rhino.Render Namespace