RhinoCommon API
TextFields.NumPages Method
 Number of layout pages in a document
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int NumPages()
Public Shared Function NumPages As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.NumPages"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextFields Class
Rhino.Runtime Namespace