RhinoCommon API
Skin.HideSplash Method
Is called when the splash screen should be hidden.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void HideSplash()
Protected Overridable Sub HideSplash
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Skin Class
Rhino.Runtime Namespace