RhinoCommon API
Localization.LocalizeString Method (String, Int32)
 Returns localized version of a given English string. This function should be auto-generated by the RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string LocalizeString(
	string english,
	int contextId
)
Public Shared Function LocalizeString (
	english As String,
	contextId As Integer
) As String
Parameters
english
Type: System.String
The text in English.
contextId
Type: System.Int32
The context ID.
Return Value
Type: String
The localized string.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Localization Class
LocalizeString Overload
Rhino.UI Namespace