RhinoCommon API
ObjectAttributes Constructor
Initializes a new instance of the ObjectAttributes class
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectAttributes()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectAttributes Class
ObjectAttributes Overload
Rhino.DocObjects Namespace