RhinoCommon API
ToneMappingPostEffectPlugIn.AddUISections Method
 Create each of your UI sections using 'new' and then call ui.AddSection() on them. RDK takes ownership of the sections.If your post effect does not need a UI, then your implementation of this method can be a no-op.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract void AddUISections(
	PostEffectUI ui
)
Public MustOverride Sub AddUISections (
	ui As PostEffectUI
)
Parameters
ui
Type: Rhino.Render.PostEffects.PostEffectUI
PostEffectUI
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ToneMappingPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace