RhinoCommon API
PickContext Constructor
Initializes a new instance of the PickContext class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PickContext()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace