RhinoCommon API
FileSettings.SetAutoSaveBeforeCommands Method
Set list of commands that force AutoSave prior to running.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void SetAutoSaveBeforeCommands(
	string[] commands
)
Public Shared Sub SetAutoSaveBeforeCommands (
	commands As String()
)
Parameters
commands
Type: System.String[]
[Missing <param name="commands"/> documentation for "M:Rhino.ApplicationSettings.FileSettings.SetAutoSaveBeforeCommands(System.String[])"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace