RhinoCommon API
LayerTable.AddReferenceLayer Method
 Adds a new reference layer with default definition to the layer table. Reference layers are not saved in files.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AddReferenceLayer()
Public Function AddReferenceLayer As Integer
Return Value
Type: Int32
index of new layer.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
LayerTable Class
AddReferenceLayer Overload
Rhino.DocObjects.Tables Namespace