RhinoCommon API
VolumeMassProperties.Compute Method (Brep)
 Compute the VolumeMassProperties for a single Brep.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static VolumeMassProperties Compute(
	Brep brep
)
Public Shared Function Compute (
	brep As Brep
) As VolumeMassProperties
Parameters
brep
Type: Rhino.Geometry.Brep
Brep to measure.
Return Value
Type: VolumeMassProperties
The VolumeMassProperties for the given Brep or null on failure.
Exceptions
Exception | Condition
ArgumentNullException | When brep is null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
VolumeMassProperties Class
Compute Overload
Rhino.Geometry Namespace