RhinoCommon API
RenderWindow.ChannelGPU.Close Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.Close"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Close()
Public Sub Close
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace