RhinoCommon API
PostEffectPipeline.IsRendering Method
 IsRendering
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsRendering()
Public Function IsRendering As Boolean
Return Value
Type: Boolean
Return true if rendering is active, else false.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace