RhinoCommon API
TextFields.BlockInstanceDescription Method
 Returns a block definition description
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public static string BlockInstanceDescription(
	string instanceDefinitionNameOrId
)
Public Shared Function BlockInstanceDescription (
	instanceDefinitionNameOrId As String
) As String
Parameters
instanceDefinitionNameOrId
Type: System.String
[Missing <param name="instanceDefinitionNameOrId"/> documentation for "M:Rhino.Runtime.TextFields.BlockInstanceDescription(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.BlockInstanceDescription(System.String)"]
See Also
Reference
TextFields Class
Rhino.Runtime Namespace