RhinoCommon API
Quaternion.Division Operator
 Divides all quaternion coefficients by a factor and returns a new quaternion with the result.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Quaternion operator /(
	Quaternion q,
	double y
)
Public Shared Operator / (
	q As Quaternion,
	y As Double
) As Quaternion
Parameters
q
Type: Rhino.Geometry.Quaternion
A quaternion.
y
Type: System.Double
A number.
Return Value
Type: Quaternion
A new quaternion.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace