RhinoCommon API
RealtimeDisplayMode.SignalRedraw Method
 Use to signal the underlying pipeline a redraw is wanted. This can be used for instance when a renderer has completed a pass which should be updated in the associated viewport.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SignalRedraw()
Public Sub SignalRedraw
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace