RhinoCommon API
TextureEvaluator.GetByteArrayValue Method
[Missing <summary> documentation for "M:Rhino.Render.TextureEvaluator.GetByteArrayValue(System.IntPtr,System.Int32)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static byte GetByteArrayValue(
	IntPtr p,
	int offset
)
Public Shared Function GetByteArrayValue (
	p As IntPtr,
	offset As Integer
) As Byte
Parameters
p
Type: System.IntPtr
[Missing <param name="p"/> documentation for "M:Rhino.Render.TextureEvaluator.GetByteArrayValue(System.IntPtr,System.Int32)"]
offset
Type: System.Int32
[Missing <param name="offset"/> documentation for "M:Rhino.Render.TextureEvaluator.GetByteArrayValue(System.IntPtr,System.Int32)"]
Return Value
Type: Byte
[Missing <returns> documentation for "M:Rhino.Render.TextureEvaluator.GetByteArrayValue(System.IntPtr,System.Int32)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace