RhinoCommon API
DisplayPipeline.CrossCompileHLSL Method
 Convert HLSL code to a different shading language
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string CrossCompileHLSL(
	string hlsl,
	string functionName,
	ShaderLanguage targetLanguage
)
Public Shared Function CrossCompileHLSL (
	hlsl As String,
	functionName As String,
	targetLanguage As ShaderLanguage
) As String
Parameters
hlsl
Type: System.String
[Missing <param name="hlsl"/> documentation for "M:Rhino.Display.DisplayPipeline.CrossCompileHLSL(System.String,System.String,Rhino.Display.ShaderLanguage)"]
functionName
Type: System.String
[Missing <param name="functionName"/> documentation for "M:Rhino.Display.DisplayPipeline.CrossCompileHLSL(System.String,System.String,Rhino.Display.ShaderLanguage)"]
targetLanguage
Type: Rhino.Display.ShaderLanguage
[Missing <param name="targetLanguage"/> documentation for "M:Rhino.Display.DisplayPipeline.CrossCompileHLSL(System.String,System.String,Rhino.Display.ShaderLanguage)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Display.DisplayPipeline.CrossCompileHLSL(System.String,System.String,Rhino.Display.ShaderLanguage)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace