RhinoCommon SDK
Dialogs.ShowMessageBox Method (Object, String, String, ShowMessageBoxButton, ShowMessageBoxIcon, ShowMessageBoxDefaultButton, ShowMessageBoxOptions, ShowMessageBoxMode)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static ShowMessageBoxResult ShowMessageBox(
	Object parent,
	string message,
	string title,
	ShowMessageBoxButton buttons,
	ShowMessageBoxIcon icon,
	ShowMessageBoxDefaultButton defaultButton,
	ShowMessageBoxOptions options,
	ShowMessageBoxMode mode
)
Public Shared Function ShowMessageBox (
	parent As Object,
	message As String,
	title As String,
	buttons As ShowMessageBoxButton,
	icon As ShowMessageBoxIcon,
	defaultButton As ShowMessageBoxDefaultButton,
	options As ShowMessageBoxOptions,
	mode As ShowMessageBoxMode
) As ShowMessageBoxResult
Parameters
parent
Type: System.Object
Parent window
message
Type: System.String
Message box text content.
title
Type: System.String
Message box title text.
buttons
Type: Rhino.UI.ShowMessageBoxButton
Which buttons to display in the message box.
icon
Type: Rhino.UI.ShowMessageBoxIcon
Which icon to display in the message box.
defaultButton
Type: Rhino.UI.ShowMessageBoxDefaultButton
Which button is the default button.
options
Type: Rhino.UI.ShowMessageBoxOptions
Additional message box options.
mode
Type: Rhino.UI.ShowMessageBoxMode
The modality of the message box.
Return Value
Type: ShowMessageBoxResult
One of the ShowMessageBoxResult values.
See Also
Reference
Dialogs Class
ShowMessageBox Overload
Rhino.UI Namespace