RhinoCommon API
BinaryArchiveReader.ReadPoint3f Method
 Reads a Point3f from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3f ReadPoint3f()
Public Function ReadPoint3f As Point3f
Return Value
Type: Point3f
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace