RhinoCommon SDK
GeometryBase.OnSwitchToNonConst Method
 Is called when a non-const operation occurs.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void OnSwitchToNonConst()
Protected Overrides Sub OnSwitchToNonConst
See Also
Reference
GeometryBase Class
Rhino.Geometry Namespace