RhinoCommon SDK
CurveBlend.DrawBlend Method
 Draw the blend
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void DrawBlend(
	DisplayPipeline pPipe,
	bool draw_handles
)
Public Sub DrawBlend (
	pPipe As DisplayPipeline,
	draw_handles As Boolean
)
Parameters
pPipe
Type: Rhino.Display.DisplayPipeline
pipeline to draw with
draw_handles
Type: System.Boolean
draw the adjuster handles or not
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace