RhinoCommon SDK
RenderPipeline.SaveImage Method (String, Boolean)
Rhino 5 for Windows
 Saves the rendered image to a file.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.30000.17 (5.13.60913.21340)
Syntax
public bool SaveImage(
	string fileName,
	bool saveAlpha
)
Public Function SaveImage (
	fileName As String,
	saveAlpha As Boolean
) As Boolean
Parameters
fileName
Type: System.String
 the full path to the file name to save to. If null or empty a file dialog will be displayed prompting the user for a save file name.
saveAlpha
Type: System.Boolean
 Determines if alpha will be saved in files that support it (e.g., PNG).
Return Value
Type: Boolean
 Returns true if a file was written or false if a file dialog was canceled or the file was not written.
See Also
Reference
RenderPipeline Class
SaveImage Overload
Rhino.Render Namespace