RhinoCommon API
PostEffects.PostEffectFromId Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffects.PostEffectFromId(System.Guid)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PostEffectPlugIn PostEffectFromId(
	Guid uuid
)
Public Function PostEffectFromId (
	uuid As Guid
) As PostEffectPlugIn
Parameters
uuid
Type: System.Guid
[Missing <param name="uuid"/> documentation for "M:Rhino.Render.PostEffects.PostEffects.PostEffectFromId(System.Guid)"]
Return Value
Type: PostEffectPlugIn
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffects.PostEffectFromId(System.Guid)"]
See Also
Reference
PostEffects Class
Rhino.Render.PostEffects Namespace