RhinoCommon API
IRhRdkThumbnailList.SetShowLabels Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.SetShowLabels(System.Boolean)"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
void SetShowLabels(
	bool b
)
Sub SetShowLabels (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.SetShowLabels(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
IRhRdkThumbnailList Interface
Rhino.UI.Controls.ThumbnailUI Namespace