RhinoCommon API
StackedDialogPage.OnCancel Method
Called when stacked dialog Cancel button is pressed.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void OnCancel()
Public Overridable Sub OnCancel
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace