RhinoCommon SDK
RadialDimensionObject.DisplayHelper Method
[Missing <summary> documentation for "M:Rhino.DocObjects.RadialDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Point2d@,Rhino.Geometry.Vector2d@)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Line[] DisplayHelper(
	ViewportInfo viewport,
	Transform modelTransform,
	out Point2d arrowHeadTip,
	out Vector2d arrowheadDirection
)
Public Function DisplayHelper (
	viewport As ViewportInfo,
	modelTransform As Transform,
	<OutAttribute> ByRef arrowHeadTip As Point2d,
	<OutAttribute> ByRef arrowheadDirection As Vector2d
) As Line()
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
[Missing <param name="viewport"/> documentation for "M:Rhino.DocObjects.RadialDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Point2d@,Rhino.Geometry.Vector2d@)"]
modelTransform
Type: Rhino.Geometry.Transform
[Missing <param name="modelTransform"/> documentation for "M:Rhino.DocObjects.RadialDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Point2d@,Rhino.Geometry.Vector2d@)"]
arrowHeadTip
Type: Rhino.Geometry.Point2d
[Missing <param name="arrowHeadTip"/> documentation for "M:Rhino.DocObjects.RadialDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Point2d@,Rhino.Geometry.Vector2d@)"]
arrowheadDirection
Type: Rhino.Geometry.Vector2d
[Missing <param name="arrowheadDirection"/> documentation for "M:Rhino.DocObjects.RadialDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Point2d@,Rhino.Geometry.Vector2d@)"]
Return Value
Type: Line[]
[Missing <returns> documentation for "M:Rhino.DocObjects.RadialDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Point2d@,Rhino.Geometry.Vector2d@)"]
See Also
Reference
RadialDimensionObject Class
Rhino.DocObjects Namespace