RhinoCommon API
PythonScript.GetStackTraceFromException Method
 Retrieves a meaningful representation of the call stack.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract string GetStackTraceFromException(
	Exception ex
)
Public MustOverride Function GetStackTraceFromException (
	ex As Exception
) As String
Parameters
ex
Type: System.Exception
An exception that was thrown by some of the methods in this class.
Return Value
Type: String
A string that represents the Python exception.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace