RhinoCommon API
NamedParametersEventArgs.SetHatchObjects Method
 Sets a HatchObject collection for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetHatchObjects(
	string name,
	IEnumerable<HatchObject> value
)
Public Sub SetHatchObjects (
	name As String,
	value As IEnumerable(Of HatchObject)
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetHatchObjects(System.String,System.Collections.Generic.IEnumerable{Rhino.DocObjects.HatchObject})"]
value
Type: System.Collections.Generic.IEnumerable<HatchObject>
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetHatchObjects(System.String,System.Collections.Generic.IEnumerable{Rhino.DocObjects.HatchObject})"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace