RhinoCommon API
File3dmLinetypeTable.FindName Method
 Finds a Linetype given its name.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Linetype FindName(
	string name
)
Public Function FindName (
	name As String
) As Linetype
Parameters
name
Type: System.String
The name of the Linetype to be searched.
Return Value
Type: Linetype
A Linetype, or null on error.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmLinetypeTable Class
Rhino.FileIO Namespace