RhinoCommon API
StringWrapper.ToString Method
 Returns the string contents of this wrapper.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
A managed string.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
StringWrapper Class
Rhino.Runtime.InteropWrappers Namespace