RhinoCommon API
Mesh.SolidOrientation Method
 Determines orientation of a "solid" mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SolidOrientation()
Public Function SolidOrientation As Integer
Return Value
Type: Int32
+1 = mesh is solid with outward facing normals.
-1 = mesh is solid with inward facing normals.
0 = mesh is not solid.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Mesh Class
Rhino.Geometry Namespace