RhinoCommon API
FieldDictionary.AddTextured Method (String, Guid, String)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Guid,System.String)"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute]
public GuidField AddTextured(
	string key,
	Guid value,
	string prompt
)
<ObsoleteAttribute>
Public Function AddTextured (
	key As String,
	value As Guid,
	prompt As String
) As GuidField
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Guid,System.String)"]
value
Type: System.Guid
[Missing <param name="value"/> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Guid,System.String)"]
prompt
Type: System.String
[Missing <param name="prompt"/> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Guid,System.String)"]
Return Value
Type: GuidField
[Missing <returns> documentation for "M:Rhino.Render.Fields.FieldDictionary.AddTextured(System.String,System.Guid,System.String)"]
Version Information
Rhino for Windows
Obsolete (compiler warning) in 7.0
See Also
Reference
FieldDictionary Class
AddTextured Overload
Rhino.Render.Fields Namespace