RhinoCommon API
RenderWindow.ChannelGPU.Clone Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.Clone"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderWindow.ChannelGPU Clone()
Public Function Clone As RenderWindow.ChannelGPU
Return Value
Type: RenderWindow.ChannelGPU
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.Clone"]
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace