RhinoCommon API
DisplayModeDescription.Dispose Method
Releases all resources used by the DisplayModeDescription
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayModeDescription Class
Dispose Overload
Rhino.Display Namespace