RhinoCommon API
MeshFace.Set Method (Int32, Int32, Int32)
 Sets all the corners for this face as a triangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Set(
	int a,
	int b,
	int c
)
Public Sub Set (
	a As Integer,
	b As Integer,
	c As Integer
)
Parameters
a
Type: System.Int32
Index of first corner.
b
Type: System.Int32
Index of second corner.
c
Type: System.Int32
Index of third corner.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshFace Structure
Set Overload
Rhino.Geometry Namespace