RhinoCommon API
Surface.Reverse Method (Int32)
 Reverses parameterization Domain changes from [a,b] to [-b,-a]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Surface Reverse(
	int direction
)
Public Function Reverse (
	direction As Integer
) As Surface
Parameters
direction
Type: System.Int32
 0 for first parameter's domain, 1 for second parameter's domain.
Return Value
Type: Surface
a new reversed surface on success.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Surface Class
Reverse Overload
Rhino.Geometry Namespace