RhinoCommon SDK
ViewCapture.Write Method
[Missing <summary> documentation for "M:Rhino.Display.ViewCapture.Write(Rhino.Display.ViewCaptureSettings,Rhino.Display.DisplayEngine)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static bool Write(
	ViewCaptureSettings settings,
	DisplayEngine engine
)
Public Shared Function Write (
	settings As ViewCaptureSettings,
	engine As DisplayEngine
) As Boolean
Parameters
settings
Type: Rhino.Display.ViewCaptureSettings
[Missing <param name="settings"/> documentation for "M:Rhino.Display.ViewCapture.Write(Rhino.Display.ViewCaptureSettings,Rhino.Display.DisplayEngine)"]
engine
Type: Rhino.Display.DisplayEngine
[Missing <param name="engine"/> documentation for "M:Rhino.Display.ViewCapture.Write(Rhino.Display.ViewCaptureSettings,Rhino.Display.DisplayEngine)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Display.ViewCapture.Write(Rhino.Display.ViewCaptureSettings,Rhino.Display.DisplayEngine)"]
See Also
Reference
ViewCapture Class
Rhino.Display Namespace