RhinoCommon API
ObjectTable.AddLine Method (Line)
Adds a line object to Rhino.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddLine(
	Line line
)
Public Function AddLine (
	line As Line
) As Guid
Parameters
line
Type: Rhino.Geometry.Line
[Missing <param name="line"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Line)"]
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectTable Class
AddLine Overload
Rhino.DocObjects.Tables Namespace