RhinoCommon API
GripObject.UndoMove Method
 Undoes any grip moves made by calling Move.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void UndoMove()
Public Sub UndoMove
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GripObject Class
Rhino.DocObjects Namespace