RhinoCommon API
ViewportInfo.UnlockFrustumSymmetry Method
 Unlocks frustum horizontal and vertical symmetries.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void UnlockFrustumSymmetry()
Public Sub UnlockFrustumSymmetry
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace