RhinoCommon API
MeshExtruder.Finalize Method
 Destructor
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace