RhinoCommon API
ChannelData.Id Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.ChannelData.Id"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id()
Public Function Id As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.ChannelData.Id"]
See Also
Reference
ChannelData Class
Rhino.Render.PostEffects Namespace