RhinoCommon API
Channel.GPU Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.Channel.GPU"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderWindow.ChannelGPU GPU()
Public Function GPU As RenderWindow.ChannelGPU
Return Value
Type: RenderWindow.ChannelGPU
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.Channel.GPU"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Channel Class
Rhino.Render.PostEffects Namespace