RhinoCommon API
PlugIn.FlushSettingsSavedQueue Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.FlushSettingsSavedQueue"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void FlushSettingsSavedQueue()
Public Shared Sub FlushSettingsSavedQueue
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace