RhinoCommon API
ObjectTable.AddPolyline Method (IEnumerable<Point3d>, ObjectAttributes)
Adds a polyline object to Rhino.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddPolyline(
	IEnumerable<Point3d> points,
	ObjectAttributes attributes
)
Public Function AddPolyline (
	points As IEnumerable(Of Point3d),
	attributes As ObjectAttributes
) As Guid
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
A Polyline; a list, an array, or any enumerable set of Point3d.
attributes
Type: Rhino.DocObjects.ObjectAttributes
attributes to apply to line.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectTable Class
AddPolyline Overload
Rhino.DocObjects.Tables Namespace