RhinoCommon API
MeshFaceNormalList.Clear Method
 Clears the Face Normal list on the mesh.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshFaceNormalList Class
Rhino.Geometry.Collections Namespace