RhinoCommon API
PostEffectPipeline.DateTimeStringEnd Method
 Formats the end time with the date and time using the user's control panel preferences.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string DateTimeStringEnd()
Public Function DateTimeStringEnd As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectPipeline.DateTimeStringEnd"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace