RhinoCommon SDK
Decal.ConstPointer Method
[Missing <summary> documentation for "M:Rhino.Render.Decal.ConstPointer"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
[Missing <returns> documentation for "M:Rhino.Render.Decal.ConstPointer"]
See Also
Reference
Decal Class
Rhino.Render Namespace