RhinoCommon API
PostEffectPipeline.GetWatermarkText Method
 Get the watermark text set by the renderer (if any).
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string GetWatermarkText()
Public Function GetWatermarkText As String
Return Value
Type: String
string watermark text
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace