RhinoCommon API
ToneMappingPostEffectPlugIn.UUID Method
 Return The unique identifier of this PEP.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Guid UUID()
Public MustOverride Function UUID As Guid
Return Value
Type: Guid
PEP uuid
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ToneMappingPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace