RhinoCommon API
PostEffectPlugIn.LocalName Method
 Return The localized name of this PEP.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract string LocalName()
Public MustOverride Function LocalName As String
Return Value
Type: String
PEP localized name
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace