RhinoCommon API
ViewportInfo.DollyFrustum Method
 Moves the frustum clipping planes.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DollyFrustum(
	double dollyDistance
)
Public Function DollyFrustum (
	dollyDistance As Double
) As Boolean
Parameters
dollyDistance
Type: System.Double
Distance to move in camera direction.
Return Value
Type: Boolean
true if the operation succeeded; otherwise, false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace