RhinoCommon API
GumballDisplayConduit Constructor
Initializes a new instance of the GumballDisplayConduit class
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public GumballDisplayConduit()
Public Sub New
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace