RhinoCommon API
RenderContentKindList Constructor
Initializes a new instance of the RenderContentKindList class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.7
Syntax
public RenderContentKindList()
Public Sub New
See Also
Reference
RenderContentKindList Class
RenderContentKindList Overload
Rhino.Render Namespace