RhinoCommon SDK
RenderSettings.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
RenderSettings Class
Dispose Overload
Rhino.Render Namespace