RhinoCommon API
DisplayBitmapDrawList.Sort Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayBitmapDrawList.Sort(Rhino.Geometry.Vector3d)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] Sort(
	Vector3d cameraDirection
)
Public Function Sort (
	cameraDirection As Vector3d
) As Integer()
Parameters
cameraDirection
Type: Rhino.Geometry.Vector3d
[Missing <param name="cameraDirection"/> documentation for "M:Rhino.Display.DisplayBitmapDrawList.Sort(Rhino.Geometry.Vector3d)"]
Return Value
Type: Int32[]
[Missing <returns> documentation for "M:Rhino.Display.DisplayBitmapDrawList.Sort(Rhino.Geometry.Vector3d)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayBitmapDrawList Class
Rhino.Display Namespace