RhinoCommon API
ListablePostEffectPlugIn.SetShown Method
 Show or hide the PEP.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void SetShown(
	bool bShown
)
Public Overridable Sub SetShown (
	bShown As Boolean
)
Parameters
bShown
Type: System.Boolean
[Missing <param name="bShown"/> documentation for "M:Rhino.Render.PostEffects.ListablePostEffectPlugIn.SetShown(System.Boolean)"]
See Also
Reference
ListablePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace