RhinoCommon API
QuadRemeshParameters Constructor
Initializes a new instance of the QuadRemeshParameters class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public QuadRemeshParameters()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
QuadRemeshParameters Class
Rhino.Geometry Namespace