RhinoCommon API
PostEffectPlugIn.CanExecute Method
 Return true if the PEP can execute, else false. The default implementation checks if the PEP is 'On' and 'Shown'. PEP authors can override this to include other criteria but please be sure to call the base class.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool CanExecute(
	PostEffectPipeline pipeline
)
Public Overridable Function CanExecute (
	pipeline As PostEffectPipeline
) As Boolean
Parameters
pipeline
Type: Rhino.Render.PostEffects.PostEffectPipeline
PostEffectPipeline
Return Value
Type: Boolean
Return true if the PEP can execute, else false
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace