RhinoCommon API
SubD.CreateFromMesh Method (Mesh)
 Create a new SubD from a mesh
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static SubD CreateFromMesh(
	Mesh mesh
)
Public Shared Function CreateFromMesh (
	mesh As Mesh
) As SubD
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.Geometry.SubD.CreateFromMesh(Rhino.Geometry.Mesh)"]
Return Value
Type: SubD
[Missing <returns> documentation for "M:Rhino.Geometry.SubD.CreateFromMesh(Rhino.Geometry.Mesh)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SubD Class
CreateFromMesh Overload
Rhino.Geometry Namespace