RhinoCommon API
Sphere.ToNurbsSurface Method
 Converts this sphere to its NurbsSurface representation. This is synonymous with calling NurbsSurface.CreateFromSphere().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsSurface ToNurbsSurface()
Public Function ToNurbsSurface As NurbsSurface
Return Value
Type: NurbsSurface
A nurbs surface representation of this sphere or null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace