RhinoCommon API
RhinoCore.OnIdle Method
Note: This API is now obsolete.
 Dispatches Rhino Idle tasks
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Please use the expresion (DoIdle() | DoEvents()) instead")]
public bool OnIdle()
<ObsoleteAttribute("Please use the expresion (DoIdle() | DoEvents()) instead")>
Public Function OnIdle As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.InProcess.RhinoCore.OnIdle"]
Version Information
Rhino for Windows
Obsolete (compiler warning) in 7.0
See Also
Reference
RhinoCore Class
Rhino.Runtime.InProcess Namespace