RhinoCommon API
RhinoObject.GetSubObjects Method
 Gets an array of sub-objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public RhinoObject[] GetSubObjects()
Public Function GetSubObjects As RhinoObject()
Return Value
Type: RhinoObject[]
An array of sub-objects, or null if there are none.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace