RhinoCommon API
Mesh.CreateFromMeshArrayCleanUp Method
Repairs meshes with vertices that are too near, using a tolerance value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Mesh[] CreateFromMeshArrayCleanUp(
	IEnumerable<Mesh> meshes,
	double tolerance,
	bool mendSinglePrecisionVertexJump
)
Public Shared Function CreateFromMeshArrayCleanUp (
	meshes As IEnumerable(Of Mesh),
	tolerance As Double,
	mendSinglePrecisionVertexJump As Boolean
) As Mesh()
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
The meshes to be repared.
tolerance
Type: System.Double
A minimum distance for clean vertices.
mendSinglePrecisionVertexJump
Type: System.Boolean
If true, operations are performed on double precision vertices so that, when single precision vertices are computed, they will keep consistent.
Return Value
Type: Mesh[]
A valid meshes array if successful. If no change was required, some meshes can be null. Otherwise, null, when no changes were done.
Remarks
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Mesh Class
Rhino.Geometry Namespace
MeshVertexList.ComputeMeshArrayCleanUpThreshold(IEnumerable<Mesh>, Boolean)