RhinoCommon API
HiddenLineDrawingParameters.AddClippingPlane Method
 Specify clipping planes that are active for this view.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddClippingPlane(
	Plane plane
)
Public Sub AddClippingPlane (
	plane As Plane
)
Parameters
plane
Type: Rhino.Geometry.Plane
[Missing <param name="plane"/> documentation for "M:Rhino.Geometry.HiddenLineDrawingParameters.AddClippingPlane(Rhino.Geometry.Plane)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace