RhinoCommon API
Channel.Commit Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.Channel.Commit"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Commit()
Public Sub Commit
See Also
Reference
Channel Class
Rhino.Render.PostEffects Namespace