RhinoCommon API
PostEffects.CopyFrom Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffects.CopyFrom(Rhino.Render.FreeFloatingBase)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override void CopyFrom(
	FreeFloatingBase src
)
Public Overrides Sub CopyFrom (
	src As FreeFloatingBase
)
Parameters
src
Type: Rhino.Render.FreeFloatingBase
[Missing <param name="src"/> documentation for "M:Rhino.Render.PostEffects.PostEffects.CopyFrom(Rhino.Render.FreeFloatingBase)"]
See Also
Reference
PostEffects Class
Rhino.Render.PostEffects Namespace