RhinoCommon API
FieldDictionary.GetField Method
 Call this method to get the field with the matching name.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Field GetField(
	string fieldName
)
Public Function GetField (
	fieldName As String
) As Field
Parameters
fieldName
Type: System.String
Field name to search for.
Return Value
Type: Field
 If the field exists in the Fields dictionary then the field is returned otherwise; null is returned.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
FieldDictionary Class
Rhino.Render.Fields Namespace