RhinoCommon API
Point2d.Multiply Operator (Double, Point2d)
 Multiplies a Point2d by a number.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point2d operator *(
	double t,
	Point2d point
)
Public Shared Operator * (
	t As Double,
	point As Point2d
) As Point2d
Parameters
t
Type: System.Double
A number.
point
Type: Rhino.Geometry.Point2d
A point.
Return Value
Type: Point2d
A new point that is coordinate-wise multiplied by t.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Point2d Structure
Multiply Overload
Rhino.Geometry Namespace