RhinoCommon API
Layer.Default Method
 Sets layer to default settings.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Default()
Public Sub Default
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Layer Class
Rhino.DocObjects Namespace