RhinoCommon API
ColorLAB Implicit Conversion (ColorLAB to Color)
 Implicitly converts a LAB color into a .Net library color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static implicit operator Color (
	ColorLAB lab
)
Public Shared Widening Operator CType (
	lab As ColorLAB
) As Color
Parameters
lab
Type: Rhino.Display.ColorLAB
A LAB color.
Return Value
Type: Color
A ARGB .Net library color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ColorLAB Structure
Rhino.Display Namespace