RhinoCommon API
ChannelDataCollection.At Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.ChannelDataCollection.At(System.Int32)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ChannelData At(
	int index
)
Public Function At (
	index As Integer
) As ChannelData
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.Render.PostEffects.ChannelDataCollection.At(System.Int32)"]
Return Value
Type: ChannelData
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.ChannelDataCollection.At(System.Int32)"]
See Also
Reference
ChannelDataCollection Class
Rhino.Render.PostEffects Namespace