RhinoCommon SDK
FieldDictionary.Set Method (String, Point3d, RenderContent.ChangeContexts)
 Set the field value and send the appropriate change notification to the render SDK. Will throw a InvalidOperationException exception if the key name is not valid.
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Set(
	string key,
	Point3d value,
	RenderContent.ChangeContexts changeContext
)
Public Sub Set (
	key As String,
	value As Point3d,
	changeContext As RenderContent.ChangeContexts
)
Parameters
key
Type: System.String
Key name for the field value to change.
value
Type: Rhino.Geometry.Point3d
New value for this field.
changeContext
Type: Rhino.Render.RenderContent.ChangeContexts
The reason why the value is changing.
See Also
Reference
FieldDictionary Class
Set Overload
Rhino.Render.Fields Namespace