RhinoCommon API
TextFields.FileName Method
 Return full path to the document
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string FileName()
Public Shared Function FileName As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.FileName"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextFields Class
FileName Overload
Rhino.Runtime Namespace