RhinoCommon API
TextFields.PageNumber Method
 Returns the current layouts page number
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int PageNumber()
Public Shared Function PageNumber As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.PageNumber"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextFields Class
Rhino.Runtime Namespace