RhinoCommon API
GetTorus Constructor
Initializes a new instance of the GetTorus class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetTorus()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetTorus Class
Rhino.Input.Custom Namespace