RhinoCommon API
ChannelDataCollection.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.ChannelDataCollection.Finalize"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ChannelDataCollection Class
Rhino.Render.PostEffects Namespace