RhinoCommon API
Line.ToNurbsCurve Method
 Constructs a nurbs curve representation of this line. This amounts to the same as calling NurbsCurve.CreateFromLine().
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsCurve ToNurbsCurve()
Public Function ToNurbsCurve As NurbsCurve
Return Value
Type: NurbsCurve
A nurbs curve representation of this line or null if no such representation could be made.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Line Structure
Rhino.Geometry Namespace