RhinoCommon API
DisplayPipeline.DrawPointCloud Method (PointCloud, Int32)
 Draws a point cloud.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawPointCloud(
	PointCloud cloud,
	int size
)
Public Sub DrawPointCloud (
	cloud As PointCloud,
	size As Integer
)
Parameters
cloud
Type: Rhino.Geometry.PointCloud
Point cloud to draw, if the cloud has a color array, it will be used, otherwise the points will be black.
size
Type: System.Int32
Size of points.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayPipeline Class
DrawPointCloud Overload
Rhino.Display Namespace