RhinoCommon API
RenderMaterial.SimulatedPhysicallyBasedMaterial Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.SimulatedPhysicallyBasedMaterial(Rhino.Render.RenderTexture.TextureGeneration)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PhysicallyBasedMaterial SimulatedPhysicallyBasedMaterial(
	RenderTexture.TextureGeneration tg
)
Public Function SimulatedPhysicallyBasedMaterial (
	tg As RenderTexture.TextureGeneration
) As PhysicallyBasedMaterial
Parameters
tg
Type: Rhino.Render.RenderTexture.TextureGeneration
[Missing <param name="tg"/> documentation for "M:Rhino.Render.RenderMaterial.SimulatedPhysicallyBasedMaterial(Rhino.Render.RenderTexture.TextureGeneration)"]
Return Value
Type: PhysicallyBasedMaterial
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.SimulatedPhysicallyBasedMaterial(Rhino.Render.RenderTexture.TextureGeneration)"]
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace