RhinoCommon API
ChannelData Constructor (ChannelData)
Initializes a new instance of the ChannelData class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ChannelData(
	ChannelData cd
)
Public Sub New (
	cd As ChannelData
)
Parameters
cd
Type: Rhino.Render.PostEffects.ChannelData
[Missing <param name="cd"/> documentation for "M:Rhino.Render.PostEffects.ChannelData.#ctor(Rhino.Render.PostEffects.ChannelData)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ChannelData Class
ChannelData Overload
Rhino.Render.PostEffects Namespace