RhinoCommon SDK
ObjectPropertiesPage.ShouldDisplay Method
 Called when the selected objects list changes, return true if the object list contains one or more object the page can modify.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual bool ShouldDisplay(
	RhinoObject rhObj
)
Public Overridable Function ShouldDisplay (
	rhObj As RhinoObject
) As Boolean
Parameters
rhObj
Type: Rhino.DocObjects.RhinoObject
[Missing <param name="rhObj"/> documentation for "M:Rhino.UI.ObjectPropertiesPage.ShouldDisplay(Rhino.DocObjects.RhinoObject)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.ObjectPropertiesPage.ShouldDisplay(Rhino.DocObjects.RhinoObject)"]
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace