RhinoCommon API
Material.SetTransparencyTexture Method (Texture)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.SetTransparencyTexture(Rhino.DocObjects.Texture)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use SetTexture instead")]
public bool SetTransparencyTexture(
	Texture texture
)
<ObsoleteAttribute("Use SetTexture instead")>
Public Function SetTransparencyTexture (
	texture As Texture
) As Boolean
Parameters
texture
Type: Rhino.DocObjects.Texture
[Missing <param name="texture"/> documentation for "M:Rhino.DocObjects.Material.SetTransparencyTexture(Rhino.DocObjects.Texture)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.SetTransparencyTexture(Rhino.DocObjects.Texture)"]
See Also
Reference
Material Class
SetTransparencyTexture Overload
Rhino.DocObjects Namespace