RhinoCommon API
PhysicallyBasedMaterial.SynchronizeLegacyMaterial Method
[Missing <summary> documentation for "M:Rhino.Render.PhysicallyBasedMaterial.SynchronizeLegacyMaterial"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SynchronizeLegacyMaterial()
Public Sub SynchronizeLegacyMaterial
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace