RhinoCommon API
DocumentCollectedException Constructor
 Initializes a new instance of the document controlled exception class.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DocumentCollectedException()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DocumentCollectedException Class
DocumentCollectedException Overload
Rhino.Runtime Namespace