RhinoCommon SDK
RenderWindow.Invalidate Method
 Invalidate the entire view window so that the pixels get painted.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Invalidate()
Public Sub Invalidate
See Also
Reference
RenderWindow Class
Rhino.Render Namespace