RhinoCommon API
EarlyPostEffectPlugInArray.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.EarlyPostEffectPlugInArray.Finalize"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
EarlyPostEffectPlugInArray Class
Rhino.Render.PostEffects Namespace