RhinoCommon API
Curve.CreateBooleanDifference Method (Curve, Curve)
 Calculates the boolean difference between two closed, planar curves. Note, curves must be co-planar.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Curve[] CreateBooleanDifference(
	Curve curveA,
	Curve curveB
)
Public Shared Function CreateBooleanDifference (
	curveA As Curve,
	curveB As Curve
) As Curve()
Parameters
curveA
Type: Rhino.Geometry.Curve
The first closed, planar curve.
curveB
Type: Rhino.Geometry.Curve
The second closed, planar curve.
Return Value
Type: Curve[]
Result curves on success, empty array if no difference could be calculated.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 7.0
See Also
Reference
Curve Class
CreateBooleanDifference Overload
Rhino.Geometry Namespace