RhinoCommon SDK
DisplayPipeline.DrawLeader Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayPipeline.DrawLeader(Rhino.Geometry.RLeader,System.Drawing.Color)"]
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void DrawLeader(
	RLeader leader,
	Color color
)
Public Sub DrawLeader (
	leader As RLeader,
	color As Color
)
Parameters
leader
Type: Rhino.Geometry.RLeader
[Missing <param name="leader"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawLeader(Rhino.Geometry.RLeader,System.Drawing.Color)"]
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.DisplayPipeline.DrawLeader(Rhino.Geometry.RLeader,System.Drawing.Color)"]
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace