RhinoCommon API
ColorGradient Constructor
Initializes a new instance of the ColorGradient class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ColorGradient()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ColorGradient Class
Rhino.Display Namespace