RhinoCommon SDK
RenderContent.AddPersistentRenderContent Method (RenderContent)
Note: This API is now obsolete.
 Add a material, environment or texture to the internal RDK document lists as top level content. The content must have been returned from RenderContent::MakeCopy, NewContentFromType or a similar function that returns a non-document content.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("Use version that takes a document")]
public static bool AddPersistentRenderContent(
	RenderContent renderContent
)
<ObsoleteAttribute("Use version that takes a document")>
Public Shared Function AddPersistentRenderContent (
	renderContent As RenderContent
) As Boolean
Parameters
renderContent
Type: Rhino.Render.RenderContent
The render content.
Return Value
Type: Boolean
true on success.
See Also
Reference
RenderContent Class
AddPersistentRenderContent Overload
Rhino.Render Namespace