RhinoCommon SDK
ObjRef.Finalize Method
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace