RhinoCommon SDK
AngularDimensionObject.DisplayHelper Method
[Missing <summary> documentation for "M:Rhino.DocObjects.AngularDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Line[]@,Rhino.Geometry.Point2d[]@,Rhino.Geometry.Vector2d[]@)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Arc[] DisplayHelper(
	ViewportInfo viewport,
	Transform modelTransform,
	out Line[] lines,
	out Point2d[] arrowHeadTips,
	out Vector2d[] arrowheadDirections
)
Public Function DisplayHelper (
	viewport As ViewportInfo,
	modelTransform As Transform,
	<OutAttribute> ByRef lines As Line(),
	<OutAttribute> ByRef arrowHeadTips As Point2d(),
	<OutAttribute> ByRef arrowheadDirections As Vector2d()
) As Arc()
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
[Missing <param name="viewport"/> documentation for "M:Rhino.DocObjects.AngularDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Line[]@,Rhino.Geometry.Point2d[]@,Rhino.Geometry.Vector2d[]@)"]
modelTransform
Type: Rhino.Geometry.Transform
[Missing <param name="modelTransform"/> documentation for "M:Rhino.DocObjects.AngularDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Line[]@,Rhino.Geometry.Point2d[]@,Rhino.Geometry.Vector2d[]@)"]
lines
Type: Rhino.Geometry.Line[]
[Missing <param name="lines"/> documentation for "M:Rhino.DocObjects.AngularDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Line[]@,Rhino.Geometry.Point2d[]@,Rhino.Geometry.Vector2d[]@)"]
arrowHeadTips
Type: Rhino.Geometry.Point2d[]
[Missing <param name="arrowHeadTips"/> documentation for "M:Rhino.DocObjects.AngularDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Line[]@,Rhino.Geometry.Point2d[]@,Rhino.Geometry.Vector2d[]@)"]
arrowheadDirections
Type: Rhino.Geometry.Vector2d[]
[Missing <param name="arrowheadDirections"/> documentation for "M:Rhino.DocObjects.AngularDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Line[]@,Rhino.Geometry.Point2d[]@,Rhino.Geometry.Vector2d[]@)"]
Return Value
Type: Arc[]
[Missing <returns> documentation for "M:Rhino.DocObjects.AngularDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Line[]@,Rhino.Geometry.Point2d[]@,Rhino.Geometry.Vector2d[]@)"]
See Also
Reference
AngularDimensionObject Class
Rhino.DocObjects Namespace