RhinoCommon API
Channel.WasCommit Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.Channel.WasCommit"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool WasCommit()
Public Function WasCommit As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.Channel.WasCommit"]
See Also
Reference
Channel Class
Rhino.Render.PostEffects Namespace