RhinoCommon API
EarlyPostEffectPlugIn.WriteState Method
 Write the state. If your PEP has no state, you must still return true for success.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool WriteState(
	ref PostEffectState state
)
Public MustOverride Function WriteState (
	ByRef state As PostEffectState
) As Boolean
Parameters
state
Type: Rhino.Render.PostEffects.PostEffectState
PostEffectState
Return Value
Type: Boolean
Return true if successful, else false.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
EarlyPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace