RhinoCommon API
SnapShotsClient.ObjectsCategory Method
 Predefined objects category
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string ObjectsCategory()
Public Shared Function ObjectsCategory As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.ObjectsCategory"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace