RhinoCommon SDK
MouseCallback.OnBeginMouseMove Method
 Called at the beginning of handling of a mouse move event in Rhino. If you don't want the default Rhino functionality to be run, then set Cancel to true on the passed in event args. Base class implementation of this function does nothing.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void OnBeginMouseMove(
	MouseCallbackEventArgs e
)
Protected Overridable Sub OnBeginMouseMove (
	e As MouseCallbackEventArgs
)
Parameters
e
Type: Rhino.UI.MouseCallbackEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.UI.MouseCallback.OnBeginMouseMove(Rhino.UI.MouseCallbackEventArgs)"]
See Also
Reference
MouseCallback Class
Rhino.UI Namespace