RhinoCommon API
PostEffectPlugIn.UsageFlags Method
 See PostEfectsPlugIn variables: uf_ProductionRendering uf_RealtimeRendering uf_ViewportDisplay
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract uint UsageFlags()
Public MustOverride Function UsageFlags As UInteger
Return Value
Type: UInt32
returns the usageflags
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace