RhinoCommon SDK
ChangeQueue.Finalize Method
 Deconstructor
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace