RhinoCommon API
GetPoint.PermitObjectSnap Method
 By default, object snaps like "end", "near", etc. are controled by the user. If you want to disable this ability, then call PermitObjectSnap(false).
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void PermitObjectSnap(
	bool permit
)
Public Sub PermitObjectSnap (
	permit As Boolean
)
Parameters
permit
Type: System.Boolean
true to permit snapping to objects.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace