RhinoCommon API
PreviewAppearance.Geometry Method
 Geometry
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PreviewGeometry Geometry()
Public Function Geometry As PreviewGeometry
Return Value
Type: PreviewGeometry
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.Geometry"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace