RhinoCommon API
ContentCollectionIterator.DeleteThis Method
[Missing <summary> documentation for "M:Rhino.Render.ContentCollectionIterator.DeleteThis"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void DeleteThis()
Public Sub DeleteThis
See Also
Reference
ContentCollectionIterator Class
Rhino.Render Namespace