RhinoCommon API
ZBufferCapture.ShowPoints Method
[Missing <summary> documentation for "M:Rhino.Display.ZBufferCapture.ShowPoints(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ShowPoints(
	bool on
)
Public Sub ShowPoints (
	on As Boolean
)
Parameters
on
Type: System.Boolean
[Missing <param name="on"/> documentation for "M:Rhino.Display.ZBufferCapture.ShowPoints(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ZBufferCapture Class
Rhino.Display Namespace