RhinoCommon API
PostEffects.GetLatePostEffects Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffects.GetLatePostEffects"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LatePostEffectPlugInArray GetLatePostEffects()
Public Function GetLatePostEffects As LatePostEffectPlugInArray
Return Value
Type: LatePostEffectPlugInArray
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffects.GetLatePostEffects"]
See Also
Reference
PostEffects Class
Rhino.Render.PostEffects Namespace