RhinoCommon API
SubDEdgeList.GetEnumerator Method
 Implementation of IEnumerable
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerator<SubDEdge> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of SubDEdge)
Return Value
Type: IEnumerator<SubDEdge>
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.SubDEdgeList.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SubDEdgeList Class
Rhino.Geometry.Collections Namespace