RhinoCommon API
ObjectTable.AddPointCloud Method (PointCloud)
Adds a point cloud object to the document.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddPointCloud(
	PointCloud cloud
)
Public Function AddPointCloud (
	cloud As PointCloud
) As Guid
Parameters
cloud
Type: Rhino.Geometry.PointCloud
PointCloud to add.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectTable Class
AddPointCloud Overload
Rhino.DocObjects.Tables Namespace