RhinoCommon SDK
Curve Constructor
 Protected constructor for internal use.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected Curve()
Protected Sub New
See Also
Reference
Curve Class
Curve Overload
Rhino.Geometry Namespace