RhinoCommon API
PointCloud.GetColors Method
 Copy all the point colors in this point cloud to an array.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color[] GetColors()
Public Function GetColors As Color()
Return Value
Type: Color[]
An array containing all the colors in this point cloud.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace