RhinoCommon API
RenderWindow.ChannelGPU.Width Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.Width"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Width()
Public Function Width As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.Width"]
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace