RhinoCommon API
PostEffectPipeline.FindPostEffect Method
 Return a pointer to the specified post effect or null if not found.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PostEffectPlugIn FindPostEffect(
	Guid uuid
)
Public Function FindPostEffect (
	uuid As Guid
) As PostEffectPlugIn
Parameters
uuid
Type: System.Guid
uuid of the poest effect plugin
Return Value
Type: PostEffectPlugIn
Return a pointer to the specified post effect or null if not found.
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace