RhinoCommon API
DrawingUtilities.BitmapFromSvg Method (String, Int32, Int32, Boolean)
 Create bitmap of a given size from an svg string
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Bitmap BitmapFromSvg(
	string svg,
	int width,
	int height,
	bool adjustForDarkMode
)
Public Shared Function BitmapFromSvg (
	svg As String,
	width As Integer,
	height As Integer,
	adjustForDarkMode As Boolean
) As Bitmap
Parameters
svg
Type: System.String
[Missing <param name="svg"/> documentation for "M:Rhino.UI.DrawingUtilities.BitmapFromSvg(System.String,System.Int32,System.Int32,System.Boolean)"]
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.UI.DrawingUtilities.BitmapFromSvg(System.String,System.Int32,System.Int32,System.Boolean)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.UI.DrawingUtilities.BitmapFromSvg(System.String,System.Int32,System.Int32,System.Boolean)"]
adjustForDarkMode
Type: System.Boolean
[Missing <param name="adjustForDarkMode"/> documentation for "M:Rhino.UI.DrawingUtilities.BitmapFromSvg(System.String,System.Int32,System.Int32,System.Boolean)"]
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.UI.DrawingUtilities.BitmapFromSvg(System.String,System.Int32,System.Int32,System.Boolean)"]
See Also
Reference
DrawingUtilities Class
BitmapFromSvg Overload
Rhino.UI Namespace