RhinoCommon API
ToneMappingPostEffectPlugIn.ResetToFactoryDefaults Method
 Reset the state to factory defaults.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract void ResetToFactoryDefaults()
Public MustOverride Sub ResetToFactoryDefaults
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ToneMappingPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace