RhinoCommon API
Material.GetBumpTexture Method
 Gets the bump texture of this material.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Texture GetBumpTexture()
Public Function GetBumpTexture As Texture
Return Value
Type: Texture
A texture; or null if no bump texture has been added to this material.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 7.0
See Also
Reference
Material Class
Rhino.DocObjects Namespace