RhinoCommon API
GetContextCallback.BeforeGetPoint Method
 Called before a GetPoint() operation. Setting the point or result on the input arguments will cause the default GetPoint operation to be skipped and results will immediately be returned to the caller of the initial GetPoint.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void BeforeGetPoint(
	GetPoint gp,
	bool onMouseUp,
	bool get2DPoint,
	GetContextArgs args
)
Public Overridable Sub BeforeGetPoint (
	gp As GetPoint,
	onMouseUp As Boolean,
	get2DPoint As Boolean,
	args As GetContextArgs
)
Parameters
gp
Type: Rhino.Input.Custom.GetPoint
[Missing <param name="gp"/> documentation for "M:Rhino.Input.Custom.GetContextCallback.BeforeGetPoint(Rhino.Input.Custom.GetPoint,System.Boolean,System.Boolean,Rhino.Input.Custom.GetContextArgs)"]
onMouseUp
Type: System.Boolean
[Missing <param name="onMouseUp"/> documentation for "M:Rhino.Input.Custom.GetContextCallback.BeforeGetPoint(Rhino.Input.Custom.GetPoint,System.Boolean,System.Boolean,Rhino.Input.Custom.GetContextArgs)"]
get2DPoint
Type: System.Boolean
[Missing <param name="get2DPoint"/> documentation for "M:Rhino.Input.Custom.GetContextCallback.BeforeGetPoint(Rhino.Input.Custom.GetPoint,System.Boolean,System.Boolean,Rhino.Input.Custom.GetContextArgs)"]
args
Type: Rhino.Input.Custom.GetContextArgs
[Missing <param name="args"/> documentation for "M:Rhino.Input.Custom.GetContextCallback.BeforeGetPoint(Rhino.Input.Custom.GetPoint,System.Boolean,System.Boolean,Rhino.Input.Custom.GetContextArgs)"]
Return Value
Type:
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetContextCallback Class
Rhino.Input.Custom Namespace