RhinoCommon SDK
Sun.ShowDialog Method
Show the tabbed sun dialog.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ShowDialog()
Public Function ShowDialog As Boolean
Return Value
Type: Boolean
 Returns true if the user clicked OK, or false if the user cancelled.
See Also
Reference
Sun Class
Rhino.Render Namespace