RhinoCommon API
SimulatedTexture Constructor
Initializes a new instance of the SimulatedTexture class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.1
Syntax
public SimulatedTexture()
Public Sub New
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace