RhinoCommon API
ChannelDataCollection.Count Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.ChannelDataCollection.Count"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count()
Public Function Count As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.ChannelDataCollection.Count"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ChannelDataCollection Class
Rhino.Render.PostEffects Namespace