RhinoCommon API
TextureEvaluator.SetByteArrayValue Method
[Missing <summary> documentation for "M:Rhino.Render.TextureEvaluator.SetByteArrayValue(System.IntPtr,System.Int32,System.Byte)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static void SetByteArrayValue(
	IntPtr p,
	int offset,
	byte value
)
Public Shared Sub SetByteArrayValue (
	p As IntPtr,
	offset As Integer,
	value As Byte
)
Parameters
p
Type: System.IntPtr
[Missing <param name="p"/> documentation for "M:Rhino.Render.TextureEvaluator.SetByteArrayValue(System.IntPtr,System.Int32,System.Byte)"]
offset
Type: System.Int32
[Missing <param name="offset"/> documentation for "M:Rhino.Render.TextureEvaluator.SetByteArrayValue(System.IntPtr,System.Int32,System.Byte)"]
value
Type: System.Byte
[Missing <param name="value"/> documentation for "M:Rhino.Render.TextureEvaluator.SetByteArrayValue(System.IntPtr,System.Int32,System.Byte)"]
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace