RhinoCommon API
Mesh.ClearSurfaceData Method
 Removes surface parameters, curvature parameters and surface statistics from the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearSurfaceData()
Public Sub ClearSurfaceData
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Mesh Class
Rhino.Geometry Namespace