RhinoCommon API
CustomDisplay.AddLine Method (Line, Color, Int32)
 Adds a new, colored line to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddLine(
	Line line,
	Color color,
	int thickness
)
Public Sub AddLine (
	line As Line,
	color As Color,
	thickness As Integer
)
Parameters
line
Type: Rhino.Geometry.Line
Line to add.
color
Type: System.Drawing.Color
Color of line.
thickness
Type: System.Int32
Thickness of line.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CustomDisplay Class
AddLine Overload
Rhino.Display Namespace