RhinoCommon API
Matrix.Multiply Operator
 Multiplies two matrices and returns a new product matrix.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Matrix operator *(
	Matrix a,
	Matrix b
)
Public Shared Operator * (
	a As Matrix,
	b As Matrix
) As Matrix
Parameters
a
Type: Rhino.Geometry.Matrix
A first matrix to use in calculation.
b
Type: Rhino.Geometry.Matrix
Another matrix to use in calculation.
Return Value
Type: Matrix
The product matrix.
Exceptions
Exception | Condition
ArgumentException |  When a.ColumnCount != b.RowCount.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Matrix Class
Rhino.Geometry Namespace