RhinoCommon API
RenderWindow.ChannelEx.Clone Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.Clone"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderWindow.ChannelEx Clone()
Public Function Clone As RenderWindow.ChannelEx
Return Value
Type: RenderWindow.ChannelEx
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.Clone"]
See Also
Reference
RenderWindow.ChannelEx Class
Rhino.Render Namespace