RhinoCommon API
LightManagerSupport.RenderEngineId Method
 The Guid of the render engine
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Guid RenderEngineId()
Public MustOverride Function RenderEngineId As Guid
Return Value
Type: Guid
Returns the Guid of the render engine that is associated with this light manager
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LightManagerSupport Class
Rhino.Render Namespace