RhinoCommon API
Circle.Rotate Method (Double, Vector3d)
 Rotates the circle through a given angle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Rotate(
	double angle,
	Vector3d axis
)
Public Function Rotate (
	angle As Double,
	axis As Vector3d
) As Boolean
Parameters
angle
Type: System.Double
Angle (in radians) of the rotation.
axis
Type: Rhino.Geometry.Vector3d
Rotation axis.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Circle Structure
Rotate Overload
Rhino.Geometry Namespace