RhinoCommon API
CustomDisplay.AddPoints Method (IEnumerable<Point3d>, Color)
 Adds a collection of colored points to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddPoints(
	IEnumerable<Point3d> points,
	Color color
)
Public Sub AddPoints (
	points As IEnumerable(Of Point3d),
	color As Color
)
Parameters
points
Type: System.Collections.Generic.IEnumerable<Point3d>
Points to add.
color
Type: System.Drawing.Color
Color of points.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CustomDisplay Class
AddPoints Overload
Rhino.Display Namespace