RhinoCommon API
PlugIn.LoadPlugIn Method (Guid)
 Loads an installed plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool LoadPlugIn(
	Guid pluginId
)
Public Shared Function LoadPlugIn (
	pluginId As Guid
) As Boolean
Parameters
pluginId
Type: System.Guid
The id of the installed plug-in.
Return Value
Type: Boolean
true if successful, false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PlugIn Class
LoadPlugIn Overload
Rhino.PlugIns Namespace