RhinoCommon SDK
TextStyle Constructor
 Creates a new non-document control ON_Font
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextStyle()
Public Sub New
See Also
Reference
TextStyle Class
Rhino.DocObjects Namespace