RhinoCommon API
PhysicallyBasedMaterial.GetTexture Method
 Get the texture that corresponds with the specified texture type for this material.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Texture GetTexture(
	TextureType which
)
Public Function GetTexture (
	which As TextureType
) As Texture
Parameters
which
Type: Rhino.DocObjects.TextureType
[Missing <param name="which"/> documentation for "M:Rhino.Render.PhysicallyBasedMaterial.GetTexture(Rhino.DocObjects.TextureType)"]
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.Render.PhysicallyBasedMaterial.GetTexture(Rhino.DocObjects.TextureType)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace