RhinoCommon API
GetContextArgs.SetGetResult Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetContextArgs.SetGetResult(Rhino.Input.GetResult)"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetGetResult(
	GetResult result
)
Public Sub SetGetResult (
	result As GetResult
)
Parameters
result
Type: Rhino.Input.GetResult
[Missing <param name="result"/> documentation for "M:Rhino.Input.Custom.GetContextArgs.SetGetResult(Rhino.Input.GetResult)"]
See Also
Reference
GetContextArgs Class
Rhino.Input.Custom Namespace