RhinoCommon API
ToneMappingPostEffectPlugInArray.Dispose Method
Releases all resources used by the ToneMappingPostEffectPlugInArray
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ToneMappingPostEffectPlugInArray Class
Rhino.Render.PostEffects Namespace