RhinoCommon API
PostEffectPipeline.DateTimeStringStart Method
 Formats the start time with the date and time using the user's control panel preferences.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string DateTimeStringStart()
Public Function DateTimeStringStart As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectPipeline.DateTimeStringStart"]
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace