RhinoCommon API
RenderContentCollection.Remove Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentCollection.Remove(Rhino.Render.RenderContentCollection)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void Remove(
	RenderContentCollection collection
)
Public Sub Remove (
	collection As RenderContentCollection
)
Parameters
collection
Type: Rhino.Render.RenderContentCollection
[Missing <param name="collection"/> documentation for "M:Rhino.Render.RenderContentCollection.Remove(Rhino.Render.RenderContentCollection)"]
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace