RhinoCommon API
RenderWindow.ChannelGPU.PixelSize Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.PixelSize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint PixelSize()
Public Function PixelSize As UInteger
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.PixelSize"]
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace