RhinoCommon API
PreviewAppearance.SetRotationX Method
 SetRotationX
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetRotationX(
	double d
)
Public Sub SetRotationX (
	d As Double
)
Parameters
d
Type: System.Double
[Missing <param name="d"/> documentation for "M:Rhino.Render.PreviewAppearance.SetRotationX(System.Double)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace