RhinoCommon API
Channel.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.Channel.Finalize"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
Channel Class
Rhino.Render.PostEffects Namespace