RhinoCommon SDK
Layer.GetChildren Method
 Gets immediate children of this layer. Note that child layers may have their own children.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Layer[] GetChildren()
Public Function GetChildren As Layer()
Return Value
Type: Layer[]
Array of child layers. null if this layer does not have any children.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace