RhinoCommon API
Point3d Constructor (Point4d)
 Initializes a new point by copying coordinates from a four-dimensional point. The first three coordinates are divided by the last one. If the W (fourth) dimension of the input point is zero, then it will be just discarded.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d(
	Point4d point
)
Public Sub New (
	point As Point4d
)
Parameters
point
Type: Rhino.Geometry.Point4d
A point.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Point3d Structure
Point3d Overload
Rhino.Geometry Namespace