RhinoCommon API
BrepFace.RefitTrim Method
[Missing <summary> documentation for "M:Rhino.Geometry.BrepFace.RefitTrim(Rhino.Geometry.BrepEdge,System.Collections.Generic.IEnumerable{System.Double},System.Double,System.Boolean,System.Double@)"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Surface[] RefitTrim(
	BrepEdge edge,
	IEnumerable<double> knots,
	double tolerance,
	bool bSections,
	ref double fitQuality
)
Public Function RefitTrim (
	edge As BrepEdge,
	knots As IEnumerable(Of Double),
	tolerance As Double,
	bSections As Boolean,
	ByRef fitQuality As Double
) As Surface()
Parameters
edge
Type: Rhino.Geometry.BrepEdge
[Missing <param name="edge"/> documentation for "M:Rhino.Geometry.BrepFace.RefitTrim(Rhino.Geometry.BrepEdge,System.Collections.Generic.IEnumerable{System.Double},System.Double,System.Boolean,System.Double@)"]
knots
Type: System.Collections.Generic.IEnumerable<Double>
[Missing <param name="knots"/> documentation for "M:Rhino.Geometry.BrepFace.RefitTrim(Rhino.Geometry.BrepEdge,System.Collections.Generic.IEnumerable{System.Double},System.Double,System.Boolean,System.Double@)"]
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.BrepFace.RefitTrim(Rhino.Geometry.BrepEdge,System.Collections.Generic.IEnumerable{System.Double},System.Double,System.Boolean,System.Double@)"]
bSections
Type: System.Boolean
[Missing <param name="bSections"/> documentation for "M:Rhino.Geometry.BrepFace.RefitTrim(Rhino.Geometry.BrepEdge,System.Collections.Generic.IEnumerable{System.Double},System.Double,System.Boolean,System.Double@)"]
fitQuality
Type: System.Double
[Missing <param name="fitQuality"/> documentation for "M:Rhino.Geometry.BrepFace.RefitTrim(Rhino.Geometry.BrepEdge,System.Collections.Generic.IEnumerable{System.Double},System.Double,System.Boolean,System.Double@)"]
Return Value
Type: Surface[]
[Missing <returns> documentation for "M:Rhino.Geometry.BrepFace.RefitTrim(Rhino.Geometry.BrepEdge,System.Collections.Generic.IEnumerable{System.Double},System.Double,System.Boolean,System.Double@)"]
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace