RhinoCommon SDK
MeshVertexHiddenList.AddRange Method
 Appends an array, a list or any enumerable of flags to the end of the list.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void AddRange(
	IEnumerable<bool> values
)
Public Sub AddRange (
	values As IEnumerable(Of Boolean)
)
Parameters
values
Type: System.Collections.Generic.IEnumerable<Boolean>
Hidden values to append.
Return Value
Type:
true on success, false on failure.
See Also
Reference
MeshVertexHiddenList Class
Rhino.Geometry.Collections Namespace