RhinoCommon API
PostEffectPipeline.ElapsedTimeString Method
 Formats the elapsed time (start to end) as days, hours, minutes and seconds.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ElapsedTimeString()
Public Function ElapsedTimeString As String
Return Value
Type: String
string elapsed time
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace