RhinoCommon API
MeshVertexList.ComputeMeshArrayCleanUpThreshold Method
 Analyzes some meshes, and determines the intrinsic minimal tolerance, which is the minimal vertex-to-vertex and vertex-to-edge distance. Also, informs the caller if any double precision vertex would transform into another different, existing one when converted to single precision.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double ComputeMeshArrayCleanUpThreshold(
	IEnumerable<Mesh> meshes,
	out bool singlePrecisionVertexJump
)
Public Shared Function ComputeMeshArrayCleanUpThreshold (
	meshes As IEnumerable(Of Mesh),
	<OutAttribute> ByRef singlePrecisionVertexJump As Boolean
) As Double
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
A list, and array or any enumerable of meshes.
singlePrecisionVertexJump
Type: System.Boolean
Explains if any double precision vertex would collapse into another when transformed into single precision.
Return Value
Type: Double
The smallest distance edge-to-vertex or vertex-to-vertex in the mesh.
Remarks
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace
Mesh.CreateFromMeshArrayCleanUp(IEnumerable<Mesh>, Double, Boolean)