RhinoCommon API
Polyline.Duplicate Method
 Returns a deep copy of this polyline instance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Polyline Duplicate()
Public Function Duplicate As Polyline
Return Value
Type: Polyline
The duplicated polyline.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Polyline Class
Rhino.Geometry Namespace