RhinoCommon API
GetContextCallback.EnableForContext Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetContextCallback.EnableForContext(System.String)"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void EnableForContext(
	string contextName
)
Public Sub EnableForContext (
	contextName As String
)
Parameters
contextName
Type: System.String
[Missing <param name="contextName"/> documentation for "M:Rhino.Input.Custom.GetContextCallback.EnableForContext(System.String)"]
See Also
Reference
GetContextCallback Class
Rhino.Input.Custom Namespace