RhinoCommon API
RenderMaterial.PhysicallyBased.ParametersNames Constructor
Initializes a new instance of the RenderMaterial.PhysicallyBased.ParametersNames class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ParametersNames()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderMaterial.PhysicallyBased.ParametersNames Class
Rhino.Render Namespace