RhinoCommon API
LicenseData.Dispose Method
Releases all resources used by the LicenseData
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace