RhinoCommon API
Dialogs.ShowLineTypes Method
 Displays Rhino's LineType list box.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Object ShowLineTypes(
	string title,
	string message,
	RhinoDoc doc
)
Public Shared Function ShowLineTypes (
	title As String,
	message As String,
	doc As RhinoDoc
) As Object
Parameters
title
Type: System.String
The dialog title.
message
Type: System.String
The dialog message.
doc
Type: Rhino.RhinoDoc
The active document.
Return Value
Type: Object
The id of the selected item if successful, null on cancel.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Dialogs Class
Rhino.UI Namespace