RhinoCommon API
SupportOptions.SetShowDocuments Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetShowDocuments(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void SetShowDocuments(
	bool b
)
Public Shared Sub SetShowDocuments (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetShowDocuments(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace