RhinoCommon API
RenderContentCollection.SetForcedVaries Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentCollection.SetForcedVaries(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.9
Syntax
public void SetForcedVaries(
	bool b
)
Public Sub SetForcedVaries (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.RenderContentCollection.SetForcedVaries(System.Boolean)"]
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace