RhinoCommon API
PostEffectPlugIn.CanDisplayHelp Method
 Return true if the PEP can display a help page, else false.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool CanDisplayHelp()
Public MustOverride Function CanDisplayHelp As Boolean
Return Value
Type: Boolean
Return true if the PEP can display a help page, else false.
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace