RhinoCommon API
SubD.CreateFromMesh Method (Mesh, SubDCreationOptions)
 Create a new SubD from a mesh
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static SubD CreateFromMesh(
	Mesh mesh,
	SubDCreationOptions options
)
Public Shared Function CreateFromMesh (
	mesh As Mesh,
	options As SubDCreationOptions
) As SubD
Parameters
mesh
Type: Rhino.Geometry.Mesh
[Missing <param name="mesh"/> documentation for "M:Rhino.Geometry.SubD.CreateFromMesh(Rhino.Geometry.Mesh,Rhino.Geometry.SubDCreationOptions)"]
options
Type: Rhino.Geometry.SubDCreationOptions
[Missing <param name="options"/> documentation for "M:Rhino.Geometry.SubD.CreateFromMesh(Rhino.Geometry.Mesh,Rhino.Geometry.SubDCreationOptions)"]
Return Value
Type: SubD
[Missing <returns> documentation for "M:Rhino.Geometry.SubD.CreateFromMesh(Rhino.Geometry.Mesh,Rhino.Geometry.SubDCreationOptions)"]
See Also
Reference
SubD Class
CreateFromMesh Overload
Rhino.Geometry Namespace