RhinoCommon SDK
ObjectTable.AddRichText Method (RichText)
 Adds a rich text object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddRichText(
	RichText richText
)
Public Function AddRichText (
	richText As RichText
) As Guid
Parameters
richText
Type: Rhino.Geometry.RichText
 Rich text object to add.
Return Value
Type: Guid
 The Id of the newly added object or Guid.Empty on failure.
See Also
Reference
ObjectTable Class
AddRichText Overload
Rhino.DocObjects.Tables Namespace