RhinoCommon API
DisplayMaterial.GetEnvironmentTexture Method
[Missing <summary> documentation for "M:Rhino.Display.DisplayMaterial.GetEnvironmentTexture(System.Boolean)"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Texture GetEnvironmentTexture(
	bool front
)
Public Function GetEnvironmentTexture (
	front As Boolean
) As Texture
Parameters
front
Type: System.Boolean
[Missing <param name="front"/> documentation for "M:Rhino.Display.DisplayMaterial.GetEnvironmentTexture(System.Boolean)"]
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.Display.DisplayMaterial.GetEnvironmentTexture(System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace