RhinoCommon API
RhinoSettings.Dispose Method
Releases all resources used by the RhinoSettings
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoSettings Class
Rhino.Render.DataSources Namespace