RhinoCommon API
PreviewAppearance.RotationType Method
 RotationType
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IRhRdkPreviewSceneServer_eRotationType RotationType()
Public Function RotationType As IRhRdkPreviewSceneServer_eRotationType
Return Value
Type: IRhRdkPreviewSceneServer_eRotationType
[Missing <returns> documentation for "M:Rhino.Render.PreviewAppearance.RotationType"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PreviewAppearance Class
Rhino.Render Namespace