RhinoCommon API
LinearWorkflow Constructor
 Create an utility object not associated with any document
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LinearWorkflow()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LinearWorkflow Class
LinearWorkflow Overload
Rhino.Render Namespace