RhinoCommon SDK
RhinoObject.SupportsRenderPrimitiveList Method
 Determines if custom render meshes will be built for a particular object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool SupportsRenderPrimitiveList(
	ViewportInfo viewport,
	bool preview
)
Public Function SupportsRenderPrimitiveList (
	viewport As ViewportInfo,
	preview As Boolean
) As Boolean
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
The viewport being rendered.
preview
Type: System.Boolean
 Type of mesh to build. If preview is true then a smaller mesh may be generated in less time, false is meant when actually rendering.
Return Value
Type: Boolean
 Returns true if custom render mesh(es) will get built for this object.
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace