RhinoCommon API
ToneMappingPostEffectPlugInArray Constructor
Initializes a new instance of the ToneMappingPostEffectPlugInArray class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ToneMappingPostEffectPlugInArray()
Public Sub New
See Also
Reference
ToneMappingPostEffectPlugInArray Class
ToneMappingPostEffectPlugInArray Overload
Rhino.Render.PostEffects Namespace