RhinoCommon API
RenderContentCollection.ContentNeedsPreviewThumbnail Method (RenderContent, Boolean)
[Missing <summary> documentation for "M:Rhino.Render.RenderContentCollection.ContentNeedsPreviewThumbnail(Rhino.Render.RenderContent,System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ContentNeedsPreviewThumbnail(
	RenderContent c,
	bool bIncludeChildren
)
Public Function ContentNeedsPreviewThumbnail (
	c As RenderContent,
	bIncludeChildren As Boolean
) As Boolean
Parameters
c
Type: Rhino.Render.RenderContent
[Missing <param name="c"/> documentation for "M:Rhino.Render.RenderContentCollection.ContentNeedsPreviewThumbnail(Rhino.Render.RenderContent,System.Boolean)"]
bIncludeChildren
Type: System.Boolean
[Missing <param name="bIncludeChildren"/> documentation for "M:Rhino.Render.RenderContentCollection.ContentNeedsPreviewThumbnail(Rhino.Render.RenderContent,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContentCollection.ContentNeedsPreviewThumbnail(Rhino.Render.RenderContent,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderContentCollection Class
ContentNeedsPreviewThumbnail Overload
Rhino.Render Namespace