RhinoCommon SDK
BezierCurve.MakeRational Method
Make bezier rational
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool MakeRational()
Public Function MakeRational As Boolean
Return Value
Type: Boolean
true if successful
See Also
Reference
BezierCurve Class
Rhino.Geometry Namespace