RhinoCommon API
RenderWindow.InvalidateArea Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.InvalidateArea(System.Drawing.Rectangle)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void InvalidateArea(
	Rectangle rect
)
Public Sub InvalidateArea (
	rect As Rectangle
)
Parameters
rect
Type: System.Drawing.Rectangle
[Missing <param name="rect"/> documentation for "M:Rhino.Render.RenderWindow.InvalidateArea(System.Drawing.Rectangle)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderWindow Class
Rhino.Render Namespace