RhinoCommon API
SplopSpaceMorph Constructor (Plane, Surface, Point2d, Double)
 Constructs a flow space morph.
 Namespace: Rhino.Geometry.Morphs
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SplopSpaceMorph(
	Plane plane,
	Surface surface,
	Point2d surfaceParam,
	double scale
)
Public Sub New (
	plane As Plane,
	surface As Surface,
	surfaceParam As Point2d,
	scale As Double
)
Parameters
plane
Type: Rhino.Geometry.Plane
Source plane of deformation.
surface
Type: Rhino.Geometry.Surface
Surface to wrap objects onto.
surfaceParam
Type: Rhino.Geometry.Point2d
U,V parameter on surface used for orienting.
scale
Type: System.Double
Scale factor.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
SplopSpaceMorph Class
SplopSpaceMorph Overload
Rhino.Geometry.Morphs Namespace