RhinoCommon API
RhinoApp.EnableContinuousMainLoop Method
 This function makes it so that Rhino's main loop is executed continuously. This is useful when Rhino needs to be doing something as often as possible, such as rendering a view at interactive frame rates.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static bool EnableContinuousMainLoop()
Public Shared Function EnableContinuousMainLoop As Boolean
Return Value
Type: Boolean
 True if the functionality was enabled successfully, false otherwise.
See Also
Reference
RhinoApp Class
Rhino Namespace