RhinoCommon API
ClassArrayString Constructor
 Initializes a new ClassArrayString instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ClassArrayString()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ClassArrayString Class
Rhino.Runtime.InteropWrappers Namespace