RhinoCommon API
Point3d.Add Method (Point3d, Vector3d)
 Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point3d Add(
	Point3d point,
	Vector3d vector
)
Public Shared Function Add (
	point As Point3d,
	vector As Vector3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
A point.
vector
Type: Rhino.Geometry.Vector3d
A vector.
Return Value
Type: Point3d
A new point that results from the addition of point and vector.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Point3d Structure
Add Overload
Rhino.Geometry Namespace