RhinoCommon API
RenderWindow.ChannelEx.Finalize Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.Finalize"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
RenderWindow.ChannelEx Class
Rhino.Render Namespace