RhinoCommon API
Mesh.GetOutlines Method (Plane)
 Constructs the outlines of a mesh projected against a plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Polyline[] GetOutlines(
	Plane plane
)
Public Function GetOutlines (
	plane As Plane
) As Polyline()
Parameters
plane
Type: Rhino.Geometry.Plane
A plane to project against.
Return Value
Type: Polyline[]
An array of polylines, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Mesh Class
GetOutlines Overload
Rhino.Geometry Namespace