RhinoCommon API
Channel.Id Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.Channel.Id"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual Guid Id()
Public Overridable Function Id As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.Channel.Id"]
See Also
Reference
Channel Class
Rhino.Render.PostEffects Namespace