RhinoCommon SDK
CurveBlend.SetHandlePoint Method
 Set the location of a handle point on the blend
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetHandlePoint(
	int end,
	int index,
	Point3d position
)
Public Sub SetHandlePoint (
	end As Integer,
	index As Integer,
	position As Point3d
)
Parameters
end
Type: System.Int32
Adjust 0: start, 1: end
index
Type: System.Int32
Point to adjust
position
Type: Rhino.Geometry.Point3d
New location
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace