RhinoCommon API
Transform.Affineize Method
 Replaces the last row with (0 0 0 1), discarding any perspective part of this transform
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Affineize()
Public Sub Affineize
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Transform Structure
Rhino.Geometry Namespace