RhinoCommon API
RenderContentCollection.ContentNeedsPreviewThumbnail Method (RenderContent)
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.Render.RenderContentCollection.ContentNeedsPreviewThumbnail(Rhino.Render.RenderContent)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("This method is deprecated and no longer called. For more information see ContentNeedsPreviewThumbnail(Rhino.Render.RenderContent c, bool bIncludeChildren")]
public bool ContentNeedsPreviewThumbnail(
	RenderContent c
)
<ObsoleteAttribute("This method is deprecated and no longer called. For more information see ContentNeedsPreviewThumbnail(Rhino.Render.RenderContent c, bool bIncludeChildren")>
Public Function ContentNeedsPreviewThumbnail (
	c As RenderContent
) As Boolean
Parameters
c
Type: Rhino.Render.RenderContent
[Missing <param name="c"/> documentation for "M:Rhino.Render.RenderContentCollection.ContentNeedsPreviewThumbnail(Rhino.Render.RenderContent)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContentCollection.ContentNeedsPreviewThumbnail(Rhino.Render.RenderContent)"]
Version Information
Rhino for Windows
Obsolete (compiler warning) in 7.0
See Also
Reference
RenderContentCollection Class
ContentNeedsPreviewThumbnail Overload
Rhino.Render Namespace