RhinoCommon API
MeshFaceList.ExtractDuplicateFaces Method
 Extracts, or removes, duplicate faces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh ExtractDuplicateFaces()
Public Function ExtractDuplicateFaces As Mesh
Return Value
Type: Mesh
A mesh containing the extracted duplicate faces if successful, null otherwise.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshFaceList Class
Rhino.Geometry.Collections Namespace