RhinoCommon API
MeshUnsafeLock.VertexPoint3fArray Method
 Retrieves a pointer to the raw mesh vertex array, which uses coordinates defined with single precision floating point numbers.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3f* VertexPoint3fArray(
	out int length
)
Visual Basic does not support APIs that consume or return unsafe types.
Parameters
length
Type: System.Int32
The length of the array. This value is returned by reference (out in C#).
Return Value
Type: Point3f*
The beginning of the vertex array. Item 0 is the first vertex, and item length-1 is the last valid one.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshUnsafeLock Class
Rhino.Geometry Namespace