RhinoCommon API
PostEffectFactory.NewPostEffect Method
 Create the new PEP instance.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract PostEffectPlugIn NewPostEffect()
Public MustOverride Function NewPostEffect As PostEffectPlugIn
Return Value
Type: PostEffectPlugIn
Return an instance to the new PEP object. Do not return null.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectFactory Class
Rhino.Render.PostEffects Namespace