RhinoCommon SDK
RLeader Constructor
 Constructotr
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RLeader()
Public Sub New
See Also
Reference
RLeader Class
Rhino.Geometry Namespace