RhinoCommon SDK
Panels.OpenPanel Method (Guid, Type)
[Missing <summary> documentation for "M:Rhino.UI.Panels.OpenPanel(System.Guid,System.Type)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid OpenPanel(
	Guid dockBarId,
	Type panelType
)
Public Shared Function OpenPanel (
	dockBarId As Guid,
	panelType As Type
) As Guid
Parameters
dockBarId
Type: System.Guid
[Missing <param name="dockBarId"/> documentation for "M:Rhino.UI.Panels.OpenPanel(System.Guid,System.Type)"]
panelType
Type: System.Type
[Missing <param name="panelType"/> documentation for "M:Rhino.UI.Panels.OpenPanel(System.Guid,System.Type)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.Panels.OpenPanel(System.Guid,System.Type)"]
See Also
Reference
Panels Class
OpenPanel Overload
Rhino.UI Namespace