RhinoCommon API
OpenGLSettings.RestoreDefaults Method
 Updates from the default setting state.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void RestoreDefaults()
Public Shared Sub RestoreDefaults
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
OpenGLSettings Class
Rhino.ApplicationSettings Namespace