RhinoCommon SDK
ObjectTable.AddRichText Method (RichText, ObjectAttributes)
 Adds a rich text object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddRichText(
	RichText richText,
	ObjectAttributes attributes
)
Public Function AddRichText (
	richText As RichText,
	attributes As ObjectAttributes
) As Guid
Parameters
richText
Type: Rhino.Geometry.RichText
[Missing <param name="richText"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRichText(Rhino.Geometry.RichText,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRichText(Rhino.Geometry.RichText,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRichText(Rhino.Geometry.RichText,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ObjectTable Class
AddRichText Overload
Rhino.DocObjects.Tables Namespace