RhinoCommon API
PostEffectState Constructor
Initializes a new instance of the PostEffectState class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PostEffectState(
	IntPtr p
)
Public Sub New (
	p As IntPtr
)
Parameters
p
Type: System.IntPtr
[Missing <param name="p"/> documentation for "M:Rhino.Render.PostEffects.PostEffectState.#ctor(System.IntPtr)"]
See Also
Reference
PostEffectState Class
Rhino.Render.PostEffects Namespace