RhinoCommon API
ListablePostEffectPlugIn.On Method
 Return true if the PEP is turned on. Only PEPs that are on will execute.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool On()
Public Overridable Function On As Boolean
Return Value
Type: Boolean
Return true if the PEP is turned on
See Also
Reference
ListablePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace