RhinoCommon API
SimpleArrayGeometryPointer.ToNonConstArray Method
 Copies the unmanaged array to a managed counterpart.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GeometryBase[] ToNonConstArray()
Public Function ToNonConstArray As GeometryBase()
Return Value
Type: GeometryBase[]
The managed array.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
SimpleArrayGeometryPointer Class
Rhino.Runtime.InteropWrappers Namespace