RhinoCommon API
Material.GetTransparencyTexture Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.GetTransparencyTexture"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use GetTexture instead")]
public Texture GetTransparencyTexture()
<ObsoleteAttribute("Use GetTexture instead")>
Public Function GetTransparencyTexture As Texture
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.GetTransparencyTexture"]
See Also
Reference
Material Class
Rhino.DocObjects Namespace