RhinoCommon SDK
UserInterfaceSection.GetSibling Method
 Look for a UI section in the same container with the specified class Id.
Namespace: Rhino.Render.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public UserInterfaceSection GetSibling(
	Guid id
)
Public Function GetSibling (
	id As Guid
) As UserInterfaceSection
Parameters
id
Type: System.Guid
The class Id of the section to search for.
Return Value
Type: UserInterfaceSection
 Returns the first section in this sections container whose window class Id matches the specified Id or null if no match is found.
See Also
Reference
UserInterfaceSection Class
Rhino.Render.UI Namespace