RhinoCommon API
Curve.DuplicateSegments Method
 Polylines will be exploded into line segments. ExplodeCurves will return the curves in topological order.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve[] DuplicateSegments()
Public Function DuplicateSegments As Curve()
Return Value
Type: Curve[]
 An array of all the segments that make up this curve.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Curve Class
Rhino.Geometry Namespace