RhinoCommon API
LatePostEffectPlugIn.GetParam Method
 Get a parameter.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool GetParam(
	string param,
	ref Object var
)
Public MustOverride Function GetParam (
	param As String,
	ByRef var As Object
) As Boolean
Parameters
param
Type: System.String
is the name of the parameter to get.
var
Type: System.Object
accepts the parameter value.
Return Value
Type: Boolean
 Returns true if successful or false if the parameter was not found.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LatePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace