RhinoCommon API
CommonObject.OnSwitchToNonConst Method
 Is called when a non-constant operation first occurs.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void OnSwitchToNonConst()
Protected Overridable Sub OnSwitchToNonConst
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CommonObject Class
Rhino.Runtime Namespace