RhinoCommon API
GetPoint.PointOnObject Method
 Call this function to see if the point was on an object. If the point was on an object an ObjRef is returned; otherwise null is returned.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjRef PointOnObject()
Public Function PointOnObject As ObjRef
Return Value
Type: ObjRef
A point object reference.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace