RhinoCommon API
GetString.GetLiteralString Method
Returns the string that the user typed. By default, space does not stop input.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetResult GetLiteralString()
Public Function GetLiteralString As GetResult
Return Value
Type: GetResult
The result type. If the user typed a string, this is String.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetString Class
Rhino.Input.Custom Namespace