RhinoCommon API
BrepRegion.BoundaryBrep Method
 Gets the boundary of a region as a brep object. If the region is finite, the boundary will be a closed manifold brep. The boundary may have more than one connected component.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep BoundaryBrep()
Public Function BoundaryBrep As Brep
Return Value
Type: Brep
A brep or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace