RhinoCommon API
RhinoViewport.NextViewProjection Method
 Sets the view projection and target to the settings that were active before the last call to PrevView.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool NextViewProjection()
Public Function NextViewProjection As Boolean
Return Value
Type: Boolean
true if the view stack was popped.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace