RhinoCommon API
Extrusion Constructor
 Initializes a new instance of the Extrusion class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Extrusion()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Extrusion Class
Extrusion Overload
Rhino.Geometry Namespace