RhinoCommon API
SupportOptions.SetUseDefaultLibraryPath Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.SetUseDefaultLibraryPath(System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static void SetUseDefaultLibraryPath(
	bool b
)
Public Shared Sub SetUseDefaultLibraryPath (
	b As Boolean
)
Parameters
b
Type: System.Boolean
[Missing <param name="b"/> documentation for "M:Rhino.Render.SupportOptions.SetUseDefaultLibraryPath(System.Boolean)"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace