RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.FromTextureType Method
[Missing <summary> documentation for "M:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.FromTextureType(Rhino.DocObjects.TextureType)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string FromTextureType(
	TextureType tt
)
Public Shared Function FromTextureType (
	tt As TextureType
) As String
Parameters
tt
Type: Rhino.DocObjects.TextureType
[Missing <param name="tt"/> documentation for "M:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.FromTextureType(Rhino.DocObjects.TextureType)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.FromTextureType(Rhino.DocObjects.TextureType)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace