RhinoCommon API
DisplayPipeline.DrawSubDWires Method
 Draws all the wireframe curves of a SubD object
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void DrawSubDWires(
	SubD subd,
	Color color,
	float thickness
)
Public Sub DrawSubDWires (
	subd As SubD,
	color As Color,
	thickness As Single
)
Parameters
subd
Type: Rhino.Geometry.SubD
SubD to draw
color
Type: System.Drawing.Color
wire color
thickness
Type: System.Single
wire thickness
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace