RhinoCommon API
SubD.InterpolateSurfacePoints Method
 Modifies the SubD so that the SubD vertex limit surface points are equal to surface_points[]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.1
Syntax
public bool InterpolateSurfacePoints(
	Point3d[] surfacePoints
)
Public Function InterpolateSurfacePoints (
	surfacePoints As Point3d()
) As Boolean
Parameters
surfacePoints
Type: Rhino.Geometry.Point3d[]
 point for limit surface to interpolate. surface_points[i] is the location for the i-th vertex returned by SubVertexIterator vit(this)
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.SubD.InterpolateSurfacePoints(Rhino.Geometry.Point3d[])"]
See Also
Reference
SubD Class
Rhino.Geometry Namespace