RhinoCommon API
Ray3d.PointAt Method
 Evaluates a point along the ray.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PointAt(
	double t
)
Public Function PointAt (
	t As Double
) As Point3d
Parameters
t
Type: System.Double
The t parameter.
Return Value
Type: Point3d
A point at (Direction*t + Position).
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Ray3d Structure
Rhino.Geometry Namespace