RhinoCommon API
MeshTopologyVertexList.ConnectedTopologyVertices Method (Int32)
 Gets all topological vertices that are connected to a given vertex.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] ConnectedTopologyVertices(
	int topologyVertexIndex
)
Public Function ConnectedTopologyVertices (
	topologyVertexIndex As Integer
) As Integer()
Parameters
topologyVertexIndex
Type: System.Int32
index of a topology vertex in Mesh.TopologyVertices.
Return Value
Type: Int32[]
 Indices of all topological vertices that are connected to this topological vertex. null if no vertices are connected to this vertex.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshTopologyVertexList Class
ConnectedTopologyVertices Overload
Rhino.Geometry.Collections Namespace