RhinoCommon API
BrepFaceList.Flip Method
 Flips the orientation of faces.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Flip(
	bool onlyReversedFaces
)
Public Sub Flip (
	onlyReversedFaces As Boolean
)
Parameters
onlyReversedFaces
Type: System.Boolean
 If true, clears all BrepFace.OrientationIsReversed flags by calling BrepFace.Transpose() on each face with a true OrientationIsReversed setting. If false, all of the faces are flipped regardless of their orientation.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace