RhinoCommon API
MorphControl.Morph Method
Applies the space morph to geometry.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Morph(
	GeometryBase geometry
)
Public Function Morph (
	geometry As GeometryBase
) As Boolean
Parameters
geometry
Type: Rhino.Geometry.GeometryBase
The geometry to be morphed.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MorphControl Class
Rhino.Geometry Namespace