RhinoCommon API
RenderWindow.ChannelGPU Constructor
Initializes a new instance of the RenderWindow.ChannelGPU class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ChannelGPU(
	IntPtr p
)
Public Sub New (
	p As IntPtr
)
Parameters
p
Type: System.IntPtr
[Missing <param name="p"/> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.#ctor(System.IntPtr)"]
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace