RhinoCommon API
DracoCompression.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace