RhinoCommon SDK
RLeaderObject.DuplicateLeaderGeometry Method
 Constructs a deep (full) copy of the RLeader geometry.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RLeader DuplicateLeaderGeometry()
Public Function DuplicateLeaderGeometry As RLeader
Return Value
Type: RLeader
 A copy of the internal RLeader geometry.
See Also
Reference
RLeaderObject Class
Rhino.DocObjects Namespace