RhinoCommon API
Pixels Constructor
Initializes a new instance of the Pixels class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Pixels(
	IntPtr p
)
Public Sub New (
	p As IntPtr
)
Parameters
p
Type: System.IntPtr
[Missing <param name="p"/> documentation for "M:Rhino.Render.PostEffects.Pixels.#ctor(System.IntPtr)"]
See Also
Reference
Pixels Class
Rhino.Render.PostEffects Namespace