RhinoCommon API
Mesh.CreateBooleanUnion Method
 Computes the solid union of a set of meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Mesh[] CreateBooleanUnion(
	IEnumerable<Mesh> meshes
)
Public Shared Function CreateBooleanUnion (
	meshes As IEnumerable(Of Mesh)
) As Mesh()
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
Meshes to union.
Return Value
Type: Mesh[]
An array of Mesh results or null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Mesh Class
Rhino.Geometry Namespace