RhinoCommon API
Material.ConvertToPhysicallyBased Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.ConvertToPhysicallyBased"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PhysicallyBasedMaterial ConvertToPhysicallyBased()
Public Function ConvertToPhysicallyBased As PhysicallyBasedMaterial
Return Value
Type: PhysicallyBasedMaterial
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.ConvertToPhysicallyBased"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Material Class
Rhino.DocObjects Namespace