RhinoCommon API
Box.MakeValid Method
 Attempts to make the Box valid. This is not always possible.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MakeValid()
Public Function MakeValid As Boolean
Return Value
Type: Boolean
true if the box was made valid, or if it was valid to begin with. false if the box remains unchanged.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Box Structure
Rhino.Geometry Namespace