RhinoCommon API
PostEffectPlugIn.DisplayHelp Method
 Displays the PEP's help page, if any.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool DisplayHelp()
Public MustOverride Function DisplayHelp As Boolean
Return Value
Type: Boolean
 Return true if successful, else false.
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace