RhinoCommon API
Mesh.SetTextureCoordinates Method (TextureMapping, Transform, Boolean, Boolean)
 Set texture coordinates using given mapping and applying given transform. Set lazy to false to generate texture coordinates right away.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void SetTextureCoordinates(
	TextureMapping tm,
	Transform xf,
	bool lazy,
	bool seamCheck
)
Public Sub SetTextureCoordinates (
	tm As TextureMapping,
	xf As Transform,
	lazy As Boolean,
	seamCheck As Boolean
)
Parameters
tm
Type: Rhino.Render.TextureMapping
Texture mapping
xf
Type: Rhino.Geometry.Transform
Transform to apply to the texture mapping
lazy
Type: System.Boolean
Whether to generate lazily (true) or right away (false)
seamCheck
Type: System.Boolean
If true then some mesh edges might be unwelded to better represent UV discontinuities in the texture mapping. This only happens for the following mappings: Box, Sphere, Cylinder
See Also
Reference
Mesh Class
SetTextureCoordinates Overload
Rhino.Geometry Namespace