RhinoCommon API
AnnotationBase.RunReplace Method
 Replace text within a formatted string
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RunReplace(
	string repl_string,
	int start_run_idx,
	int start_run_pos,
	int end_run_idx,
	int end_run_pos
)
Public Function RunReplace (
	repl_string As String,
	start_run_idx As Integer,
	start_run_pos As Integer,
	end_run_idx As Integer,
	end_run_pos As Integer
) As Boolean
Parameters
repl_string
Type: System.String
[Missing <param name="repl_string"/> documentation for "M:Rhino.Geometry.AnnotationBase.RunReplace(System.String,System.Int32,System.Int32,System.Int32,System.Int32)"]
start_run_idx
Type: System.Int32
[Missing <param name="start_run_idx"/> documentation for "M:Rhino.Geometry.AnnotationBase.RunReplace(System.String,System.Int32,System.Int32,System.Int32,System.Int32)"]
start_run_pos
Type: System.Int32
[Missing <param name="start_run_pos"/> documentation for "M:Rhino.Geometry.AnnotationBase.RunReplace(System.String,System.Int32,System.Int32,System.Int32,System.Int32)"]
end_run_idx
Type: System.Int32
[Missing <param name="end_run_idx"/> documentation for "M:Rhino.Geometry.AnnotationBase.RunReplace(System.String,System.Int32,System.Int32,System.Int32,System.Int32)"]
end_run_pos
Type: System.Int32
[Missing <param name="end_run_pos"/> documentation for "M:Rhino.Geometry.AnnotationBase.RunReplace(System.String,System.Int32,System.Int32,System.Int32,System.Int32)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.AnnotationBase.RunReplace(System.String,System.Int32,System.Int32,System.Int32,System.Int32)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace