RhinoCommon API
BinaryArchiveWriter.WriteSingle Method
 Writes a Single value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteSingle(
	float value
)
Public Sub WriteSingle (
	value As Single
)
Parameters
value
Type: System.Single
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace