RhinoCommon SDK
Dialogs.PushPickButton Method
Rhino 5 for Windows
 Hides a form, calls a provided function, and then shows the form. This works for modal forms. Useful for selecting objects or getting points while a modal dialog is running.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.30000.17 (5.13.60913.21340)
Syntax
public static void PushPickButton(
	Form form,
	EventHandler<EventArgs> pickFunction
)
Public Shared Sub PushPickButton (
	form As Form,
	pickFunction As EventHandler(Of EventArgs)
)
Parameters
form
Type: System.Windows.Forms.Form
A form window.
pickFunction
Type: System.EventHandler<EventArgs>
A picking delegate.
See Also
Reference
Dialogs Class
Rhino.UI Namespace