RhinoCommon API
Brep.CullUnusedVertices Method
Culls vertices with m_vertex_index == -1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CullUnusedVertices()
Public Function CullUnusedVertices As Boolean
Return Value
Type: Boolean
true if operation succeeded; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Brep Class
Rhino.Geometry Namespace