RhinoCommon API
BrepFace.AdjacentFaces Method
 Gets the indices of all the BrepFaces that surround (are adjacent to) this face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] AdjacentFaces()
Public Function AdjacentFaces As Integer()
Return Value
Type: Int32[]
[Missing <returns> documentation for "M:Rhino.Geometry.BrepFace.AdjacentFaces"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace