RhinoCommon API
BrepFaceList.Add Method (Int32)
 Create and add a new face to this list. An incomplete face is added. The caller must create and fill in the loops used by the face.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepFace Add(
	int surfaceIndex
)
Public Function Add (
	surfaceIndex As Integer
) As BrepFace
Parameters
surfaceIndex
Type: System.Int32
index of surface in brep's Surfaces list
Return Value
Type: BrepFace
[Missing <returns> documentation for "M:Rhino.Geometry.Collections.BrepFaceList.Add(System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BrepFaceList Class
Add Overload
Rhino.Geometry.Collections Namespace