RhinoCommon SDK
Point3dGrid Constructor
 Initializes a rectangular grid of points, with no points in it.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3dGrid()
Public Sub New
See Also
Reference
Point3dGrid Class
Point3dGrid Overload
Rhino.Geometry Namespace