RhinoCommon API
ObjRef Constructor (Guid)
 Initializes a new object reference from a globally unique identifier (Guid).
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjRef(
	Guid id
)
Public Sub New (
	id As Guid
)
Parameters
id
Type: System.Guid
The ID.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjRef Class
ObjRef Overload
Rhino.DocObjects Namespace