RhinoCommon API
Plane.PointAt Method (Double, Double, Double)
 Evaluate a point on the plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PointAt(
	double u,
	double v,
	double w
)
Public Function PointAt (
	u As Double,
	v As Double,
	w As Double
) As Point3d
Parameters
u
Type: System.Double
evaluation parameter.
v
Type: System.Double
evaluation parameter.
w
Type: System.Double
evaluation parameter.
Return Value
Type: Point3d
plane.origin + u*plane.xaxis + v*plane.yaxis + z*plane.zaxis.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Plane Structure
PointAt Overload
Rhino.Geometry Namespace