RhinoCommon API
PointCloud Constructor
 Initializes a new instance of the PointCloud class that is empty.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointCloud()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PointCloud Class
PointCloud Overload
Rhino.Geometry Namespace