RhinoCommon API
RhinoApp.InFullScreen Method
 Verifies that Rhino is running in full screen mode.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool InFullScreen()
Public Shared Function InFullScreen As Boolean
Return Value
Type: Boolean
true if Rhino is running full screen, false otherwise.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoApp Class
Rhino Namespace