RhinoCommon API
Vector3d.CompareTo Method
 Compares this Vector3d with another Vector3d.
Component evaluation priority is first X, then Y, then Z.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int CompareTo(
	Vector3d other
)
Public Function CompareTo (
	other As Vector3d
) As Integer
Parameters
other
Type: Rhino.Geometry.Vector3d
The other Vector3d to use in comparison.
Return Value
Type: Int32
 0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
-1: if this.X == other.X and this.Y == other.Y and this.Z < other.Z
+1: otherwise.
Implements
IComparable<T>.CompareTo(T)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace