RhinoCommon API
PlugIn.NameFromPath Method
 Gets a plug-in name for an installed plug-in given the path to that plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string NameFromPath(
	string pluginPath
)
Public Shared Function NameFromPath (
	pluginPath As String
) As String
Parameters
pluginPath
Type: System.String
The path of the plug-in.
Return Value
Type: String
The plug-in name.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace