RhinoCommon SDK
MeshNgon Constructor (Int32[], Int32[])
 Constructs an ngon from lists of mesh vertex and face indexes.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MeshNgon(
	int[] meshVertexIndexList,
	int[] meshFaceIndexList
)
Public Sub New (
	meshVertexIndexList As Integer(),
	meshFaceIndexList As Integer()
)
Parameters
meshVertexIndexList
Type: System.Int32[]
 A list of mesh vertex indexes that define the outer boundary of the ngon. The mesh vertex indexes must be in the correct order.
meshFaceIndexList
Type: System.Int32[]
 A list of mesh face indexes that define the interior of the ngon. The mesh face indexes may be in any order.
See Also
Reference
MeshNgon Class
MeshNgon Overload
Rhino.Geometry Namespace