RhinoCommon API
BrepFaceList.SplitFacesAtTangents Method
 Splits all of the faces of a Brep at tangent locations.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool SplitFacesAtTangents()
Public Function SplitFacesAtTangents As Boolean
Return Value
Type: Boolean
True if successful, false otherwise.
See Also
Reference
BrepFaceList Class
Rhino.Geometry.Collections Namespace