RhinoCommon API
NurbsCurve.CreateFromLine Method
 Gets a non-rational, degree 1 Nurbs curve representation of the line.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static NurbsCurve CreateFromLine(
	Line line
)
Public Shared Function CreateFromLine (
	line As Line
) As NurbsCurve
Parameters
line
Type: Rhino.Geometry.Line
[Missing <param name="line"/> documentation for "M:Rhino.Geometry.NurbsCurve.CreateFromLine(Rhino.Geometry.Line)"]
Return Value
Type: NurbsCurve
Curve on success, null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace