RhinoCommon API
PostEffectPipeline Constructor
Initializes a new instance of the PostEffectPipeline class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PostEffectPipeline(
	IntPtr p
)
Public Sub New (
	p As IntPtr
)
Parameters
p
Type: System.IntPtr
[Missing <param name="p"/> documentation for "M:Rhino.Render.PostEffects.PostEffectPipeline.#ctor(System.IntPtr)"]
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace