RhinoCommon API
ToneMappingPostEffectPlugIn.SetManager Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.ToneMappingPostEffectPlugIn.SetManager(System.IntPtr)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetManager(
	IntPtr pManager
)
Public Sub SetManager (
	pManager As IntPtr
)
Parameters
pManager
Type: System.IntPtr
[Missing <param name="pManager"/> documentation for "M:Rhino.Render.PostEffects.ToneMappingPostEffectPlugIn.SetManager(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ToneMappingPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace