RhinoCommon API
HatchObject.SetHatchGeometry Method
 Replaces a hatch object's underlying hatch geometry. This only works for non-document hatch objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool SetHatchGeometry(
	Hatch hatch
)
Public Function SetHatchGeometry (
	hatch As Hatch
) As Boolean
Parameters
hatch
Type: Rhino.Geometry.Hatch
The replacement hatch geometry.
Return Value
Type: Boolean
true if successful, false otherwise.
See Also
Reference
HatchObject Class
Rhino.DocObjects Namespace