RhinoCommon API
Channel.SetIsCommitable Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.Channel.SetIsCommitable"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetIsCommitable()
Public Sub SetIsCommitable
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Channel Class
Rhino.Render.PostEffects Namespace