RhinoCommon API
ToneMappingPostEffectPlugInArray Constructor (IntPtr)
Initializes a new instance of the ToneMappingPostEffectPlugInArray class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ToneMappingPostEffectPlugInArray(
	IntPtr pArray
)
Public Sub New (
	pArray As IntPtr
)
Parameters
pArray
Type: System.IntPtr
[Missing <param name="pArray"/> documentation for "M:Rhino.Render.PostEffects.ToneMappingPostEffectPlugInArray.#ctor(System.IntPtr)"]
See Also
Reference
ToneMappingPostEffectPlugInArray Class
ToneMappingPostEffectPlugInArray Overload
Rhino.Render.PostEffects Namespace