RhinoCommon API
LayerTable.GetParentLayers Method
 Culls a list of layer and returns only the parent layers.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Layer[] GetParentLayers(
	IEnumerable<Layer> layers
)
Public Function GetParentLayers (
	layers As IEnumerable(Of Layer)
) As Layer()
Parameters
layers
Type: System.Collections.Generic.IEnumerable<Layer>
An enumeration of layers to cull.
Return Value
Type: Layer[]
The parent layers.
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace