RhinoCommon API
ChannelData Constructor (IntPtr)
Initializes a new instance of the ChannelData class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ChannelData(
	IntPtr p
)
Public Sub New (
	p As IntPtr
)
Parameters
p
Type: System.IntPtr
[Missing <param name="p"/> documentation for "M:Rhino.Render.PostEffects.ChannelData.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ChannelData Class
ChannelData Overload
Rhino.Render.PostEffects Namespace