RhinoCommon API
LOC.COV Method (String, Object)
 Command option name strings that need to be localized should call this function. The COV function doesn't actually do anything but return the original string. The LocalizationProcessor application walks through the source code of a project and looks for LOC.COV. The function is then replaced with a call to Localization.LocalizeCommandOptionValue using a unique context ID.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static LocalizeStringPair COV(
	string engilsh,
	Object assemblyFromObject
)
Public Shared Function COV (
	engilsh As String,
	assemblyFromObject As Object
) As LocalizeStringPair
Parameters
engilsh
Type: System.String
[Missing <param name="engilsh"/> documentation for "M:Rhino.UI.LOC.COV(System.String,System.Object)"]
assemblyFromObject
Type: System.Object
[in] The object that identifies the assembly that owns the command option value.
Return Value
Type: LocalizeStringPair
Returns localized string pair with both the English and local names set to the English value.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
LOC Class
COV Overload
Rhino.UI Namespace