RhinoCommon API
Mesh.MatchEdges Method
 Moves face edges of an open mesh to meet adjacent face edges. The method will first try to match vertices, and then then it will try to split edges to make the edges match.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
public bool MatchEdges(
	double distance,
	bool rachet
)
Public Function MatchEdges (
	distance As Double,
	rachet As Boolean
) As Boolean
Parameters
distance
Type: System.Double
The distance tolerance. Use larger tolerances only if you select specific edges to close.
rachet
Type: System.Boolean
 If true, matching the mesh takes place in four passes starting at a tolerance that is smaller than your specified tolerance and working up to the specified tolerance with successive passes. This matches small edges first and works up to larger edges. If false, then a single pass is made.
Return Value
Type: Boolean
True of edges were matched, false otherwise.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace