RhinoCommon API
PostEffectPlugIn.ReadFromDocumentDefaults Method
 Read the state from document defaults. This is implemented by RDK to call ReadState() so usually a PEP only has to implement ReadState(). However, a PEP can override this method to take complete control of how the document defaults are read.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool ReadFromDocumentDefaults(
	RhinoDoc doc
)
Public Overridable Function ReadFromDocumentDefaults (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
Rhino document
Return Value
Type: Boolean
Return true if read was succesfull
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace