RhinoCommon SDK
CurveBlend.CalcBlend Method
 Calculate the shape of the blend and make a curve to represent it
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void CalcBlend()
Public Sub CalcBlend
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace