RhinoCommon API
PostEffectUI Constructor
Initializes a new instance of the PostEffectUI class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PostEffectUI(
	IntPtr p
)
Public Sub New (
	p As IntPtr
)
Parameters
p
Type: System.IntPtr
[Missing <param name="p"/> documentation for "M:Rhino.Render.PostEffects.PostEffectUI.#ctor(System.IntPtr)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectUI Class
Rhino.Render.PostEffects Namespace