RhinoCommon API
BinaryArchiveReader.ReadGeometry Method
 Reads a GeometryBase-derived object from the archive.
The GeometryBase class is abstract.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GeometryBase ReadGeometry()
Public Function ReadGeometry As GeometryBase
Return Value
Type: GeometryBase
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace