RhinoCommon API
RhinoDoc.GetCurrentMeshingParameters Method
 Get the custom meshing parameters that this document will use.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshingParameters GetCurrentMeshingParameters()
Public Function GetCurrentMeshingParameters As MeshingParameters
Return Value
Type: MeshingParameters
[Missing <returns> documentation for "M:Rhino.RhinoDoc.GetCurrentMeshingParameters"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace