RhinoCommon API
File3dmLayerTable.AddLayer Method
 Easy way to add a layer to the model
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AddLayer(
	string name,
	Color color
)
Public Function AddLayer (
	name As String,
	color As Color
) As Integer
Parameters
name
Type: System.String
new layer name
color
Type: System.Drawing.Color
new layer color
Return Value
Type: Int32
 If layer_name is valid, the layer's index (>=0) is returned. Otherwise, RhinoMath.UnsetIntIndex is returned.
See Also
Reference
File3dmLayerTable Class
Rhino.FileIO Namespace