RhinoCommon API
NamedParametersEventArgs.SetPoint Method
 Set a Point3d value for a given key name
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetPoint(
	string name,
	Point3d value
)
Public Sub SetPoint (
	name As String,
	value As Point3d
)
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetPoint(System.String,Rhino.Geometry.Point3d)"]
value
Type: Rhino.Geometry.Point3d
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.SetPoint(System.String,Rhino.Geometry.Point3d)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace