RhinoCommon API
Field.GetValue<T> Method
 Parametrized version of GetValue calling appropriate ValueAs* methods.
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public T GetValue<T>()
Public Function GetValue(Of T) As T
Type Parameters
T
Type of value to get.
Return Value
Type: T
Value of type T of the field
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Field Class
Rhino.Render.Fields Namespace