RhinoCommon API
File3dmViewTable.Clear Method
 Removes all items from the table.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Clear()
Public Sub Clear
Implements
ICollection<T>.Clear()
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmViewTable Class
Rhino.FileIO Namespace