RhinoCommon API
RenderWindow.ChannelEx.Height Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.Height"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Height()
Public Function Height As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.Height"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderWindow.ChannelEx Class
Rhino.Render Namespace