RhinoCommon API
IPanelsService.GetOpenPanelIds Method
[Missing <summary> documentation for "M:Rhino.UI.IPanelsService.GetOpenPanelIds"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Guid[] GetOpenPanelIds()
Function GetOpenPanelIds As Guid()
Return Value
Type: Guid[]
[Missing <returns> documentation for "M:Rhino.UI.IPanelsService.GetOpenPanelIds"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
IPanelsService Interface
Rhino.UI Namespace