RhinoCommon API
DrawingUtilities.MakeArgb Method
[Missing <summary> documentation for "M:Rhino.UI.DrawingUtilities.MakeArgb(System.Byte,System.Byte,System.Byte,System.Byte)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int MakeArgb(
	byte a,
	byte r,
	byte g,
	byte b
)
Public Shared Function MakeArgb (
	a As Byte,
	r As Byte,
	g As Byte,
	b As Byte
) As Integer
Parameters
a
Type: System.Byte
[Missing <param name="a"/> documentation for "M:Rhino.UI.DrawingUtilities.MakeArgb(System.Byte,System.Byte,System.Byte,System.Byte)"]
r
Type: System.Byte
[Missing <param name="r"/> documentation for "M:Rhino.UI.DrawingUtilities.MakeArgb(System.Byte,System.Byte,System.Byte,System.Byte)"]
g
Type: System.Byte
[Missing <param name="g"/> documentation for "M:Rhino.UI.DrawingUtilities.MakeArgb(System.Byte,System.Byte,System.Byte,System.Byte)"]
b
Type: System.Byte
[Missing <param name="b"/> documentation for "M:Rhino.UI.DrawingUtilities.MakeArgb(System.Byte,System.Byte,System.Byte,System.Byte)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.UI.DrawingUtilities.MakeArgb(System.Byte,System.Byte,System.Byte,System.Byte)"]
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace