RhinoCommon API
File3dmObjectTable.AddEllipse Method (Ellipse)
Adds a curve object to the document representing an ellipse.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddEllipse(
	Ellipse ellipse
)
Public Function AddEllipse (
	ellipse As Ellipse
) As Guid
Parameters
ellipse
Type: Rhino.Geometry.Ellipse
An ellipse to add.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmObjectTable Class
AddEllipse Overload
Rhino.FileIO Namespace