RhinoCommon API
RadialDimension Constructor
Initializes a new instance of the RadialDimension class
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RadialDimension()
Public Sub New
See Also
Reference
RadialDimension Class
RadialDimension Overload
Rhino.Geometry Namespace