RhinoCommon API
PostEffectPipeline.AllowGPU Method
 PEP authors should check that GPU use is allowed before using the GPU in a PEP.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AllowGPU()
Public Function AllowGPU As Boolean
Return Value
Type: Boolean
Return true if the pipeline is allowed to use the GPU, else false
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace