RhinoCommon API
PostEffectPipeline.Commit Method
 Commit changes to a new channel so that those changes can be used by subsequent PEPs in the chain. If the channel has the same id as an existing channel, the existing channel will be replaced by the new one.If the existing channel was created by a previous PEP in the chain, it will be deleted. Changes to channels that are not commited simply get ignored. This call merely sets a flag.The process is deferred until after the PEP has finished executing.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Commit(
	Channel channel
)
Public Sub Commit (
	channel As Channel
)
Parameters
channel
Type: Rhino.Render.PostEffects.Channel
pChannel is a pointer to the channel to commit.
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace