RhinoCommon API
PostEffectPipeline.Execute Method
 Execute the pipeline. This executes all the PEPs in order. Only this rectangle need be modified by the PEPs.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Execute(
	Rectangle p,
	bool bRendering,
	bool bUpdateHistograms
)
Public Function Execute (
	p As Rectangle,
	bRendering As Boolean,
	bUpdateHistograms As Boolean
) As Boolean
Parameters
p
Type: System.Drawing.Rectangle
p is a rectangle within the frame buffer.
bRendering
Type: System.Boolean
bRendering is true if rendering is in progress.
bUpdateHistograms
Type: System.Boolean
bUpdateHistograms is true if the pipeline should update the frame buffer's histograms.
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectPipeline.Execute(System.Drawing.Rectangle,System.Boolean,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace