RhinoCommon SDK
Light Constructor
 Initializes a new light.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Light()
Public Sub New
See Also
Reference
Light Class
Light Overload
Rhino.Geometry Namespace