RhinoCommon SDK
MeshVertexHiddenList.GetEnumerator Method
 Gets an enumerator that yields all flags in this collection.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerator<bool> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of Boolean)
Return Value
Type: IEnumerator<Boolean>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MeshVertexHiddenList Class
Rhino.Geometry.Collections Namespace