RhinoCommon API
Line.MinimumDistanceTo Method (Line)
 Finds the shortest distance between this line as a finite segment and another finite segment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MinimumDistanceTo(
	Line testLine
)
Public Function MinimumDistanceTo (
	testLine As Line
) As Double
Parameters
testLine
Type: Rhino.Geometry.Line
A line to test.
Return Value
Type: Double
The minimum distance.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Line Structure
MinimumDistanceTo Overload
Rhino.Geometry Namespace