RhinoCommon API
Curve.Split Method (Double)
 Splits (divides) the curve at the specified parameter. The parameter must be in the interior of the curve's domain.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve[] Split(
	double t
)
Public Function Split (
	t As Double
) As Curve()
Parameters
t
Type: System.Double
 Parameter to split the curve at in the interval returned by Domain().
Return Value
Type: Curve[]
 Two curves on success, null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Curve Class
Split Overload
Rhino.Geometry Namespace