RhinoCommon API
TextFields.PageContents Method
 Returns the Page Contents string from the current layout
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string PageContents()
Public Shared Function PageContents As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.PageContents"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextFields Class
PageContents Overload
Rhino.Runtime Namespace