RhinoCommon API
HermiteSurface Constructor
 Initializes a new HermiteSurface instance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public HermiteSurface()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
HermiteSurface Class
HermiteSurface Overload
Rhino.Geometry Namespace