RhinoCommon API
TextFields.Volume Method (String, String)
 Returns volume for selected object id in the specified unit system
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static double Volume(
	string id,
	string unitSystem
)
Public Shared Function Volume (
	id As String,
	unitSystem As String
) As Double
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String,System.String)"]
unitSystem
Type: System.String
[Missing <param name="unitSystem"/> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String,System.String)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String,System.String)"]
See Also
Reference
TextFields Class
Volume Overload
Rhino.Runtime Namespace