RhinoCommon API
ObjectTable.FindByFilter Method
 Same as GetObjectList but converts the result to an array.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject[] FindByFilter(
	ObjectEnumeratorSettings filter
)
Public Function FindByFilter (
	filter As ObjectEnumeratorSettings
) As RhinoObject()
Parameters
filter
Type: Rhino.DocObjects.ObjectEnumeratorSettings
The object enumerator filter to customize inclusion requirements.
Return Value
Type: RhinoObject[]
A Rhino object array. This array can be emptry but not null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace