RhinoCommon API
ChannelDataCollection.Dispose Method
Releases all resources used by the ChannelDataCollection
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ChannelDataCollection Class
Rhino.Render.PostEffects Namespace