RhinoCommon API
ViewportInfo Constructor
 Initializes a new instance.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewportInfo()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewportInfo Class
ViewportInfo Overload
Rhino.DocObjects Namespace