RhinoCommon API
ListablePostEffectPlugIn.Fixed Method
 Return true if the PEP is fixed, else false. Fixed plug-ins cannot be un-shown by the user, although they can be turned off.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool Fixed()
Public Overridable Function Fixed As Boolean
Return Value
Type: Boolean
Return true if the PEP is fixed
See Also
Reference
ListablePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace