RhinoCommon API
PersistentSettings.SetChar Method
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetChar(System.String,System.Char)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetChar(
	string key,
	char value
)
Public Sub SetChar (
	key As String,
	value As Char
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetChar(System.String,System.Char)"]
value
Type: System.Char
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetChar(System.String,System.Char)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PersistentSettings Class
Rhino Namespace