RhinoCommon API
RenderContentCollection Constructor (IntPtr)
Initializes a new instance of the RenderContentCollection class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RenderContentCollection(
	IntPtr nativePtr
)
Public Sub New (
	nativePtr As IntPtr
)
Parameters
nativePtr
Type: System.IntPtr
[Missing <param name="nativePtr"/> documentation for "M:Rhino.Render.RenderContentCollection.#ctor(System.IntPtr)"]
See Also
Reference
RenderContentCollection Class
RenderContentCollection Overload
Rhino.Render Namespace