RhinoCommon API
RenderTexture.GetInternalEnvironmentMappingMode Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTexture.GetInternalEnvironmentMappingMode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureEnvironmentMappingMode GetInternalEnvironmentMappingMode()
Public Function GetInternalEnvironmentMappingMode As TextureEnvironmentMappingMode
Return Value
Type: TextureEnvironmentMappingMode
[Missing <returns> documentation for "M:Rhino.Render.RenderTexture.GetInternalEnvironmentMappingMode"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderTexture Class
Rhino.Render Namespace