RhinoCommon API
GetContextCallback.DisableForContext Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetContextCallback.DisableForContext(System.String)"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DisableForContext(
	string contextName
)
Public Sub DisableForContext (
	contextName As String
)
Parameters
contextName
Type: System.String
[Missing <param name="contextName"/> documentation for "M:Rhino.Input.Custom.GetContextCallback.DisableForContext(System.String)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetContextCallback Class
Rhino.Input.Custom Namespace