RhinoCommon API
Channel.CPU_Const Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.Channel.CPU_Const"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderWindow.ChannelEx CPU_Const()
Public Function CPU_Const As RenderWindow.ChannelEx
Return Value
Type: RenderWindow.ChannelEx
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.Channel.CPU_Const"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Channel Class
Rhino.Render.PostEffects Namespace