RhinoCommon API
SelectionFilterSettings.GetCurrentState Method
 Gets the current settings of the application.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static SelectionFilterSettingsState GetCurrentState()
Public Shared Function GetCurrentState As SelectionFilterSettingsState
Return Value
Type: SelectionFilterSettingsState
[Missing <returns> documentation for "M:Rhino.ApplicationSettings.SelectionFilterSettings.GetCurrentState"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SelectionFilterSettings Class
Rhino.ApplicationSettings Namespace