RhinoCommon API
PostEffectFactory.PlugInId Method
 Plugin id
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Guid PlugInId()
Public MustOverride Function PlugInId As Guid
Return Value
Type: Guid
Plugin id
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectFactory Class
Rhino.Render.PostEffects Namespace