RhinoCommon API
BinaryArchiveWriter.WriteSize Method
 Writes a Size value to the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteSize(
	Size value
)
Public Sub WriteSize (
	value As Size
)
Parameters
value
Type: System.Drawing.Size
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace