RhinoCommon API
PostEffectPipeline.ReportProgress Method
 PEPs should call this during execution to report progress. A good strategy is to call this once per pixel row (or several rows). If the function returns \e false, your PEP should exit its pixel loop as the user has requested that the operation be canceled.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ReportProgress(
	int rowsCompleted
)
Public Function ReportProgress (
	rowsCompleted As Integer
) As Boolean
Parameters
rowsCompleted
Type: System.Int32
[Missing <param name="rowsCompleted"/> documentation for "M:Rhino.Render.PostEffects.PostEffectPipeline.ReportProgress(System.Int32)"]
Return Value
Type: Boolean
Return true if the process should continue, else false.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace