RhinoCommon API
DimensionStyle.SetFieldOverride Method
 Set a field as overridden
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetFieldOverride(
	DimensionStyle.Field field
)
Public Sub SetFieldOverride (
	field As DimensionStyle.Field
)
Parameters
field
Type: Rhino.DocObjects.DimensionStyle.Field
[Missing <param name="field"/> documentation for "M:Rhino.DocObjects.DimensionStyle.SetFieldOverride(Rhino.DocObjects.DimensionStyle.Field)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace