RhinoCommon SDK
ChangeQueue.NeedsBakingOnAnyChannel Method
 Override this if you need to control baking behavior for textures.
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual bool NeedsBakingOnAnyChannel(
	RenderMaterial material
)
Protected Overridable Function NeedsBakingOnAnyChannel (
	material As RenderMaterial
) As Boolean
Parameters
material
Type: Rhino.Render.RenderMaterial
[Missing <param name="material"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.NeedsBakingOnAnyChannel(Rhino.Render.RenderMaterial)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.NeedsBakingOnAnyChannel(Rhino.Render.RenderMaterial)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace