RhinoCommon API
RhinoApp.DisableContinuousMainLoop Method
 This function makes it so that Rhino's main loop is not executed continuously. This is default behavior.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static void DisableContinuousMainLoop()
Public Shared Sub DisableContinuousMainLoop
See Also
Reference
RhinoApp Class
Rhino Namespace