RhinoCommon API
DrawingUtilities.BitmapFromSvg Method
 Create bitmap of a given size from an svg string
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Bitmap BitmapFromSvg(
	string svg,
	int width,
	int height
)
Public Shared Function BitmapFromSvg (
	svg As String,
	width As Integer,
	height As Integer
) As Bitmap
Parameters
svg
Type: System.String
[Missing <param name="svg"/> documentation for "M:Rhino.UI.DrawingUtilities.BitmapFromSvg(System.String,System.Int32,System.Int32)"]
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.UI.DrawingUtilities.BitmapFromSvg(System.String,System.Int32,System.Int32)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.UI.DrawingUtilities.BitmapFromSvg(System.String,System.Int32,System.Int32)"]
Return Value
Type: Bitmap
[Missing <returns> documentation for "M:Rhino.UI.DrawingUtilities.BitmapFromSvg(System.String,System.Int32,System.Int32)"]
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace