RhinoCommon API
ChannelData.Dispose Method
Releases all resources used by the ChannelData
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
ChannelData Class
Rhino.Render.PostEffects Namespace