RhinoCommon API
LayerTable.GetRootLayers Method
 Returns an array of root, or top-level, layers. Root layer are layers that do not have a parent layer. Layers are returned user-interface sorted order.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Layer[] GetRootLayers()
Public Function GetRootLayers As Layer()
Return Value
Type: Layer[]
An array of layers if successful, null on failure.
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace