RhinoCommon API
RenderTabs.RegisterTabEx Method
[Missing <summary> documentation for "M:Rhino.Render.RenderTabs.RegisterTabEx(Rhino.PlugIns.PlugIn,System.Type,System.Guid,System.String,System.Drawing.Icon)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void RegisterTabEx(
	PlugIn plugin,
	Type tabType,
	Guid renderEngineId,
	string caption,
	Icon icon
)
Public Sub RegisterTabEx (
	plugin As PlugIn,
	tabType As Type,
	renderEngineId As Guid,
	caption As String,
	icon As Icon
)
Parameters
plugin
Type: Rhino.PlugIns.PlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.RenderTabs.RegisterTabEx(Rhino.PlugIns.PlugIn,System.Type,System.Guid,System.String,System.Drawing.Icon)"]
tabType
Type: System.Type
[Missing <param name="tabType"/> documentation for "M:Rhino.Render.RenderTabs.RegisterTabEx(Rhino.PlugIns.PlugIn,System.Type,System.Guid,System.String,System.Drawing.Icon)"]
renderEngineId
Type: System.Guid
[Missing <param name="renderEngineId"/> documentation for "M:Rhino.Render.RenderTabs.RegisterTabEx(Rhino.PlugIns.PlugIn,System.Type,System.Guid,System.String,System.Drawing.Icon)"]
caption
Type: System.String
[Missing <param name="caption"/> documentation for "M:Rhino.Render.RenderTabs.RegisterTabEx(Rhino.PlugIns.PlugIn,System.Type,System.Guid,System.String,System.Drawing.Icon)"]
icon
Type: System.Drawing.Icon
[Missing <param name="icon"/> documentation for "M:Rhino.Render.RenderTabs.RegisterTabEx(Rhino.PlugIns.PlugIn,System.Type,System.Guid,System.String,System.Drawing.Icon)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderTabs Class
Rhino.Render Namespace