RhinoCommon API
Layer.SetClipParticipationList Method
 Object interacts with a specific list of clipping planes
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetClipParticipationList(
	IEnumerable<Guid> planeIds
)
Public Sub SetClipParticipationList (
	planeIds As IEnumerable(Of Guid)
)
Parameters
planeIds
Type: System.Collections.Generic.IEnumerable<Guid>
[Missing <param name="planeIds"/> documentation for "M:Rhino.DocObjects.Layer.SetClipParticipationList(System.Collections.Generic.IEnumerable{System.Guid})"]
See Also
Reference
Layer Class
Rhino.DocObjects Namespace