RhinoCommon API
Channel.Clone Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.Channel.Clone"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Channel Clone()
Public Function Clone As Channel
Return Value
Type: Channel
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.Channel.Clone"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Channel Class
Rhino.Render.PostEffects Namespace