RhinoCommon API
LicenseUtils.GetLicense Method (ValidateProductKeyDelegate, Int32, String)
 This version of Rhino.PlugIns.LicenseUtils.GetLicense is used by Rhino C++ plug-ins.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool GetLicense(
	ValidateProductKeyDelegate validateDelegate,
	int capabilities,
	string textMask
)
Public Shared Function GetLicense (
	validateDelegate As ValidateProductKeyDelegate,
	capabilities As Integer,
	textMask As String
) As Boolean
Parameters
validateDelegate
Type: Rhino.PlugIns.ValidateProductKeyDelegate
[Missing <param name="validateDelegate"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,System.Int32,System.String)"]
capabilities
Type: System.Int32
[Missing <param name="capabilities"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,System.Int32,System.String)"]
textMask
Type: System.String
[Missing <param name="textMask"/> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,System.Int32,System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,System.Int32,System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
LicenseUtils Class
GetLicense Overload
Rhino.PlugIns Namespace