RhinoCommon API
RhinoViewport.GetFrustumBoundingBox Method
[Missing <summary> documentation for "M:Rhino.Display.RhinoViewport.GetFrustumBoundingBox"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox GetFrustumBoundingBox()
Public Function GetFrustumBoundingBox As BoundingBox
Return Value
Type: BoundingBox
[Missing <returns> documentation for "M:Rhino.Display.RhinoViewport.GetFrustumBoundingBox"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace