RhinoCommon API
RhinoDoc.GetRenderPrimitives Method (ViewportInfo, Boolean, Boolean)
 Get a enumerable list of custom mesh primitives
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerable<RenderPrimitive> GetRenderPrimitives(
	ViewportInfo viewport,
	bool forceTriangleMeshes,
	bool quietly
)
Public Function GetRenderPrimitives (
	viewport As ViewportInfo,
	forceTriangleMeshes As Boolean,
	quietly As Boolean
) As IEnumerable(Of RenderPrimitive)
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
 The rendering view camera.
forceTriangleMeshes
Type: System.Boolean
 If true all mesh faces will be triangulated
quietly
Type: System.Boolean
 Iterate quietly, if true then no user interface will be displayed
Return Value
Type: IEnumerable<RenderPrimitive>
[Missing <returns> documentation for "M:Rhino.RhinoDoc.GetRenderPrimitives(Rhino.DocObjects.ViewportInfo,System.Boolean,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
GetRenderPrimitives Overload
Rhino Namespace