RhinoCommon API
SnapShotsClient.SupportsAnimation Method
 Returns true if the client allows animation.
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool SupportsAnimation()
Public MustOverride Function SupportsAnimation As Boolean
Return Value
Type: Boolean
true if the client allows animation.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace