RhinoCommon API
RhinoCore.Finalize Method
 IDisposable implementation
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoCore Class
Rhino.Runtime.InProcess Namespace