RhinoCommon API
AssemblyResolver.CurrentDomainAssemblyResolve Method
 Standard resolver function used by Rhino. This is added to the AppComain.CurrentDomain AssemblyResolve and ReflectionOnlyAssemblyResolve when RhinoCommon initializes.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Assembly CurrentDomainAssemblyResolve(
	Object sender,
	ResolveEventArgs args
)
Public Shared Function CurrentDomainAssemblyResolve (
	sender As Object,
	args As ResolveEventArgs
) As Assembly
Parameters
sender
Type: System.Object
[Missing <param name="sender"/> documentation for "M:Rhino.Runtime.AssemblyResolver.CurrentDomainAssemblyResolve(System.Object,System.ResolveEventArgs)"]
args
Type: System.ResolveEventArgs
[Missing <param name="args"/> documentation for "M:Rhino.Runtime.AssemblyResolver.CurrentDomainAssemblyResolve(System.Object,System.ResolveEventArgs)"]
Return Value
Type: Assembly
[Missing <returns> documentation for "M:Rhino.Runtime.AssemblyResolver.CurrentDomainAssemblyResolve(System.Object,System.ResolveEventArgs)"]
See Also
Reference
AssemblyResolver Class
Rhino.Runtime Namespace