RhinoCommon API
File3dm.Dump Method
Prepares a text dump of the entire model.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Dump()
Public Function Dump As String
Return Value
Type: String
The text dump.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dm Class
Rhino.FileIO Namespace