RhinoCommon SDK
Point2f.GetHashCode Method
 Computes a hash number that represents the current point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
A hash code that is not unique for each point.
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace