RhinoCommon API
PostEffectPlugIn.ExecuteWhileRenderingDelayMS Method
 If GetExecuteWhileRenderingOption() returns UseDelay then this method returns the delay in milliseconds before the PEP should execute for the first time.After the first time, the PEP will execute every time the dib is updated during rendering. see enum ExecuteWhileRenderingOptions.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual int ExecuteWhileRenderingDelayMS()
Public Overridable Function ExecuteWhileRenderingDelayMS As Integer
Return Value
Type: Int32
returns the delay in milliseconds before
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace