RhinoCommon API
AnimationProperties Constructor (AnimationProperties)
 Initialize new instance of the AnimationProperties class.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public AnimationProperties(
	AnimationProperties source
)
Public Sub New (
	source As AnimationProperties
)
Parameters
source
Type: Rhino.DocObjects.AnimationProperties
If not null, settings are copied from source
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
AnimationProperties Class
AnimationProperties Overload
Rhino.DocObjects Namespace