RhinoCommon API
Channel.PixelSize Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.Channel.PixelSize"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint PixelSize()
Public Function PixelSize As UInteger
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.Channel.PixelSize"]
See Also
Reference
Channel Class
Rhino.Render.PostEffects Namespace