RhinoCommon API
PostEffectPlugIn.ResetToFactoryDefaults Method
 Reset the state to factory defaults.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract void ResetToFactoryDefaults()
Public MustOverride Sub ResetToFactoryDefaults
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace