RhinoCommon SDK
ChangeQueue Constructor (CreatePreviewEventArgs)
 Construct a new ChangeQueue using the given CreatePreviewEventArgs. The preview scene for these args will be used to populate the world.
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected ChangeQueue(
	CreatePreviewEventArgs createPreviewEventArgs
)
Protected Sub New (
	createPreviewEventArgs As CreatePreviewEventArgs
)
Parameters
createPreviewEventArgs
Type: Rhino.Render.CreatePreviewEventArgs
[Missing <param name="createPreviewEventArgs"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.#ctor(Rhino.Render.CreatePreviewEventArgs)"]
See Also
Reference
ChangeQueue Class
ChangeQueue Overload
Rhino.Render.ChangeQueue Namespace