RhinoCommon API
Color4f.AsSystemColor Method
[Missing <summary> documentation for "M:Rhino.Display.Color4f.AsSystemColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color AsSystemColor()
Public Function AsSystemColor As Color
Return Value
Type: Color
[Missing <returns> documentation for "M:Rhino.Display.Color4f.AsSystemColor"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Color4f Structure
Rhino.Display Namespace