RhinoCommon SDK
TextStyleTable.GetEnumerator Method
 for IEnumerable(TextStyle)
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerator<TextStyle> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of TextStyle)
Return Value
Type: IEnumerator<TextStyle>
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.TextStyleTable.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
TextStyleTable Class
Rhino.DocObjects.Tables Namespace