RhinoCommon API
GetEllipsoid Constructor
Initializes a new instance of the GetEllipsoid class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetEllipsoid()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetEllipsoid Class
Rhino.Input.Custom Namespace