RhinoCommon API
Pixels.Get Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.Pixels.Get(System.Guid,Rhino.Render.PostEffects.ComponentOrder@,System.IntPtr@)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Get(
	Guid channel_uuid,
	ref ComponentOrder co,
	ref IntPtr values
)
Public Sub Get (
	channel_uuid As Guid,
	ByRef co As ComponentOrder,
	ByRef values As IntPtr
)
Parameters
channel_uuid
Type: System.Guid
[Missing <param name="channel_uuid"/> documentation for "M:Rhino.Render.PostEffects.Pixels.Get(System.Guid,Rhino.Render.PostEffects.ComponentOrder@,System.IntPtr@)"]
co
Type: Rhino.Render.PostEffects.ComponentOrder
[Missing <param name="co"/> documentation for "M:Rhino.Render.PostEffects.Pixels.Get(System.Guid,Rhino.Render.PostEffects.ComponentOrder@,System.IntPtr@)"]
values
Type: System.IntPtr
[Missing <param name="values"/> documentation for "M:Rhino.Render.PostEffects.Pixels.Get(System.Guid,Rhino.Render.PostEffects.ComponentOrder@,System.IntPtr@)"]
See Also
Reference
Pixels Class
Rhino.Render.PostEffects Namespace