RhinoCommon API
File3dmPlugInData.ArchiveReader Method
 Gets a binary archive reader that can be used to read custom data that was written to the 3dm file by a Rhino plug-in. This custom data must be read in exactly the same manner that owning plug-in reads the data.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public BinaryArchiveReader ArchiveReader()
Public Function ArchiveReader As BinaryArchiveReader
Return Value
Type: BinaryArchiveReader
A binary archive reader if successful, null otherwise.
See Also
Reference
File3dmPlugInData Class
Rhino.FileIO Namespace