RhinoCommon SDK
ChangeQueue.OneShot Method
 Call Flush() once, after that automatically dispose the queue.
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void OneShot()
Public Sub OneShot
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace