RhinoCommon API
RenderWindow.SetAdjust Method
Note: This API is now obsolete.
 Set new ImageAdjust to use. An ImageAdjust instance can be obtained by first querying for one using GetAdjust()
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("The Render Window UI uses post effects for gamma, tone mapping etc. now.")]
public void SetAdjust(
	RenderWindow.ImageAdjust imageAdjust
)
<ObsoleteAttribute("The Render Window UI uses post effects for gamma, tone mapping etc. now.")>
Public Sub SetAdjust (
	imageAdjust As RenderWindow.ImageAdjust
)
Parameters
imageAdjust
Type: Rhino.Render.RenderWindow.ImageAdjust
ImageAdjust
See Also
Reference
RenderWindow Class
Rhino.Render Namespace