RhinoCommon API
LinetypeTable.Add Method (Linetype)
 Adds a new linetype with specified definition to the linetype table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Add(
	Linetype linetype
)
Public Function Add (
	linetype As Linetype
) As Integer
Parameters
linetype
Type: Rhino.DocObjects.Linetype
 Definition of new linetype. The information in linetype is copied. If linetype.Name is empty then a unique name of the form "Linetype 01" will be automatically created.
Return Value
Type: Int32
 Index of newline type or -1 on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
LinetypeTable Class
Add Overload
Rhino.DocObjects.Tables Namespace