RhinoCommon API
Layer.GetSiblings Method
 Gets the siblings of this layer.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Layer[] GetSiblings()
Public Function GetSiblings As Layer()
Return Value
Type: Layer[]
The sibling layers of this layer if successful, or null if this layer does not have any siblings.
See Also
Reference
Layer Class
Rhino.DocObjects Namespace