RhinoCommon API
PythonScript.AddRuntimeAssembly Method
 Add assembly to list of assemblies used by python
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void AddRuntimeAssembly(
	Assembly assembly
)
Public Shared Sub AddRuntimeAssembly (
	assembly As Assembly
)
Parameters
assembly
Type: System.Reflection.Assembly
[Missing <param name="assembly"/> documentation for "M:Rhino.Runtime.PythonScript.AddRuntimeAssembly(System.Reflection.Assembly)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace