RhinoCommon API
RenderMaterial.CreateImportedMaterial Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.CreateImportedMaterial(Rhino.DocObjects.Material,Rhino.RhinoDoc,System.Boolean)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RenderMaterial CreateImportedMaterial(
	Material material,
	RhinoDoc doc,
	bool bReference
)
Public Shared Function CreateImportedMaterial (
	material As Material,
	doc As RhinoDoc,
	bReference As Boolean
) As RenderMaterial
Parameters
material
Type: Rhino.DocObjects.Material
[Missing <param name="material"/> documentation for "M:Rhino.Render.RenderMaterial.CreateImportedMaterial(Rhino.DocObjects.Material,Rhino.RhinoDoc,System.Boolean)"]
doc
Type: Rhino.RhinoDoc
[Missing <param name="doc"/> documentation for "M:Rhino.Render.RenderMaterial.CreateImportedMaterial(Rhino.DocObjects.Material,Rhino.RhinoDoc,System.Boolean)"]
bReference
Type: System.Boolean
[Missing <param name="bReference"/> documentation for "M:Rhino.Render.RenderMaterial.CreateImportedMaterial(Rhino.DocObjects.Material,Rhino.RhinoDoc,System.Boolean)"]
Return Value
Type: RenderMaterial
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.CreateImportedMaterial(Rhino.DocObjects.Material,Rhino.RhinoDoc,System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace