RhinoCommon API
DisplayPipeline.PopDepthTesting Method
 Pop a DepthTesting flag off the engine's stack.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void PopDepthTesting()
Public Sub PopDepthTesting
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace