RhinoCommon SDK
SubDFacesIterator.GetEnumerator Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubDFacesIterator.GetEnumerator"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public IEnumerator<SubDFace> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of SubDFace)
Return Value
Type: IEnumerator<SubDFace>
[Missing <returns> documentation for "M:Rhino.Geometry.SubDFacesIterator.GetEnumerator"]
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
SubDFacesIterator Class
Rhino.Geometry Namespace