RhinoCommon API
PersistentSettings.TryGetDefault Method (String, Point3d)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,Rhino.Geometry.Point3d@)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetDefault(
	string key,
	out Point3d value
)
Public Function TryGetDefault (
	key As String,
	<OutAttribute> ByRef value As Point3d
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,Rhino.Geometry.Point3d@)"]
value
Type: Rhino.Geometry.Point3d
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,Rhino.Geometry.Point3d@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.PersistentSettings.TryGetDefault(System.String,Rhino.Geometry.Point3d@)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PersistentSettings Class
TryGetDefault Overload
Rhino Namespace