RhinoCommon API
NamedViewTable.Restore Method (Int32, RhinoView, Boolean)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoView,System.Boolean)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Restore(
	int index,
	RhinoView view,
	bool backgroundBitmap
)
Public Function Restore (
	index As Integer,
	view As RhinoView,
	backgroundBitmap As Boolean
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoView,System.Boolean)"]
view
Type: Rhino.Display.RhinoView
[Missing <param name="view"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoView,System.Boolean)"]
backgroundBitmap
Type: System.Boolean
[Missing <param name="backgroundBitmap"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoView,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoView,System.Boolean)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 7.0
See Also
Reference
NamedViewTable Class
Restore Overload
Rhino.DocObjects.Tables Namespace