RhinoCommon API
PostEffectPipeline.GetChannel Method
 Get a channel for reading. A PEP will use this to get channel data as input to its process.Output will be written to new channel(s). \see NewChannel()
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Channel GetChannel(
	Guid uuid
)
Public Function GetChannel (
	uuid As Guid
) As Channel
Parameters
uuid
Type: System.Guid
uuidChannel is the channel identifier.
Return Value
Type: Channel
A pointer to the channel or null if the channel is not available.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace