RhinoCommon API
NotLicensedException Constructor
 Default constructor
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NotLicensedException()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
NotLicensedException Class
NotLicensedException Overload
Rhino.Runtime Namespace