RhinoCommon API
FileStpWriteOptions Constructor
Initializes a new instance of the FileStpWriteOptions class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public FileStpWriteOptions()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileStpWriteOptions Class
Rhino.FileIO Namespace