RhinoCommon API
BinaryArchiveFile Constructor
Initializes a new instance of the BinaryArchiveFile class
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BinaryArchiveFile(
	string filename,
	BinaryArchiveMode mode
)
Public Sub New (
	filename As String,
	mode As BinaryArchiveMode
)
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.FileIO.BinaryArchiveFile.#ctor(System.String,Rhino.FileIO.BinaryArchiveMode)"]
mode
Type: Rhino.FileIO.BinaryArchiveMode
[Missing <param name="mode"/> documentation for "M:Rhino.FileIO.BinaryArchiveFile.#ctor(System.String,Rhino.FileIO.BinaryArchiveMode)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace