RhinoCommon API
PhysicallyBasedMaterial.GetTextures Method
 Get array of textures that this material uses
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Texture[] GetTextures()
Public Function GetTextures As Texture()
Return Value
Type: Texture[]
[Missing <returns> documentation for "M:Rhino.Render.PhysicallyBasedMaterial.GetTextures"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace