RhinoCommon API
ArcCurve Constructor (Arc)
 Initializes a new ArcCurve instance, copying values from another Arc.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ArcCurve(
	Arc arc
)
Public Sub New (
	arc As Arc
)
Parameters
arc
Type: Rhino.Geometry.Arc
Another Arc.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ArcCurve Class
ArcCurve Overload
Rhino.Geometry Namespace