RhinoCommon API
RhinoApp.InvokeOnUiThread Method
 Execute a function on the main UI thread.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void InvokeOnUiThread(
	Delegate method,
	params Object[] args
)
Public Shared Sub InvokeOnUiThread (
	method As Delegate,
	ParamArray args As Object()
)
Parameters
method
Type: System.Delegate
function to execute
args
Type: System.Object[]
parameters to pass to the function
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoApp Class
Rhino Namespace