RhinoCommon API
Channel.CPU Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.Channel.CPU"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderWindow.ChannelEx CPU()
Public Function CPU As RenderWindow.ChannelEx
Return Value
Type: RenderWindow.ChannelEx
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.Channel.CPU"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Channel Class
Rhino.Render.PostEffects Namespace