RhinoCommon API
ObjectTable.Replace Method (ObjRef, Arc)
Replaces one object with new curve object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Replace(
	ObjRef objref,
	Arc arc
)
Public Function Replace (
	objref As ObjRef,
	arc As Arc
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
arc
Type: Rhino.Geometry.Arc
new arc to be added. The arc is copied.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace