RhinoCommon API
Point2f.Subtraction Operator
 Subtracts two Point2fs.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector2f operator -(
	Point2f a,
	Point2f b
)
Public Shared Operator - (
	a As Point2f,
	b As Point2f
) As Vector2f
Parameters
a
Type: Rhino.Geometry.Point2f
First point.
b
Type: Rhino.Geometry.Point2f
Second point.
Return Value
Type: Vector2f
A subtracted Vector2f.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Point2f Structure
Rhino.Geometry Namespace