RhinoCommon API
DisplayPipeline.DrawCylinder Method (Cylinder, Color)
 Draw a wireframe cylinder.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DrawCylinder(
	Cylinder cylinder,
	Color color
)
Public Sub DrawCylinder (
	cylinder As Cylinder,
	color As Color
)
Parameters
cylinder
Type: Rhino.Geometry.Cylinder
Cylinder to draw.
color
Type: System.Drawing.Color
Color to draw with.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayPipeline Class
DrawCylinder Overload
Rhino.Display Namespace