RhinoCommon API
Layer.CopyAttributesFrom Method
 Copy typical attributes from another layer
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void CopyAttributesFrom(
	Layer otherLayer
)
Public Sub CopyAttributesFrom (
	otherLayer As Layer
)
Parameters
otherLayer
Type: Rhino.DocObjects.Layer
[Missing <param name="otherLayer"/> documentation for "M:Rhino.DocObjects.Layer.CopyAttributesFrom(Rhino.DocObjects.Layer)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Layer Class
Rhino.DocObjects Namespace