RhinoCommon API
Polyline.ToPolylineCurve Method
 Constructs a polyline curve representation of this polyline.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PolylineCurve ToPolylineCurve()
Public Function ToPolylineCurve As PolylineCurve
Return Value
Type: PolylineCurve
A curve shaped like this polyline or null on failure.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Polyline Class
Rhino.Geometry Namespace