RhinoCommon API
RenderContentCollection.SetSearchPattern Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContentCollection.SetSearchPattern(System.String)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public void SetSearchPattern(
	string pattern
)
Public Sub SetSearchPattern (
	pattern As String
)
Parameters
pattern
Type: System.String
[Missing <param name="pattern"/> documentation for "M:Rhino.Render.RenderContentCollection.SetSearchPattern(System.String)"]
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace