RhinoCommon API
SimpleArrayInt.ToArray Method
 Returns the managed counterpart of the unmanaged array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] ToArray()
Public Function ToArray As Integer()
Return Value
Type: Int32[]
The managed array.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
SimpleArrayInt Class
Rhino.Runtime.InteropWrappers Namespace