RhinoCommon API
EarlyPostEffectPlugInArray Constructor
Initializes a new instance of the EarlyPostEffectPlugInArray class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public EarlyPostEffectPlugInArray()
Public Sub New
See Also
Reference
EarlyPostEffectPlugInArray Class
EarlyPostEffectPlugInArray Overload
Rhino.Render.PostEffects Namespace