RhinoCommon API
LatePostEffectPlugInArray Constructor
Initializes a new instance of the LatePostEffectPlugInArray class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LatePostEffectPlugInArray()
Public Sub New
See Also
Reference
LatePostEffectPlugInArray Class
LatePostEffectPlugInArray Overload
Rhino.Render.PostEffects Namespace