RhinoCommon API
ObjRef.Light Method
 Gets the light if the referenced geometry is one.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Light Light()
Public Function Light As Light
Return Value
Type: Light
A light; or null if the referenced object is not a light, or on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace