RhinoCommon SDK
UserInterfaceSection.GetSiblings Method
 Get a list of the RhinoCommon added content sections associated with this sections container.
Namespace: Rhino.Render.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public UserInterfaceSection[] GetSiblings()
Public Function GetSiblings As UserInterfaceSection()
Return Value
Type: UserInterfaceSection[]
 Returns a list of the RhinoCommon added content sections associated with this sections container.
See Also
Reference
UserInterfaceSection Class
Rhino.Render.UI Namespace