RhinoCommon API
PlugIn.GetCommands Method
 All of the commands associated with this plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Command[] GetCommands()
Public Function GetCommands As Command()
Return Value
Type: Command[]
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.GetCommands"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace