RhinoCommon API
RenderWindow.ChannelEx.GetValueEx Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetValueEx(System.Int32,System.Int32,Rhino.Render.PostEffects.ComponentOrder,System.Single[]@)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void GetValueEx(
	int x,
	int y,
	ComponentOrder order,
	ref float[] values
)
Public Sub GetValueEx (
	x As Integer,
	y As Integer,
	order As ComponentOrder,
	ByRef values As Single()
)
Parameters
x
Type: System.Int32
[Missing <param name="x"/> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetValueEx(System.Int32,System.Int32,Rhino.Render.PostEffects.ComponentOrder,System.Single[]@)"]
y
Type: System.Int32
[Missing <param name="y"/> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetValueEx(System.Int32,System.Int32,Rhino.Render.PostEffects.ComponentOrder,System.Single[]@)"]
order
Type: Rhino.Render.PostEffects.ComponentOrder
[Missing <param name="order"/> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetValueEx(System.Int32,System.Int32,Rhino.Render.PostEffects.ComponentOrder,System.Single[]@)"]
values
Type: System.Single[]
[Missing <param name="values"/> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetValueEx(System.Int32,System.Int32,Rhino.Render.PostEffects.ComponentOrder,System.Single[]@)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderWindow.ChannelEx Class
Rhino.Render Namespace