RhinoCommon API
TextureEvaluator.CanBeDumpedToBytes Method
 Fast access to bitmap evaluator for Cycles - supply size (which you will probably have received from CRhRdkTexture::PixelSize) to see if the data can be extracted direct to a width*height*4 array of unsigned chars. This is implemented by EVF(L"CanBeDumpedToBytes", ON_2iSize*) != nullptr;
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool CanBeDumpedToBytes(
	int width,
	int height
)
Public Overridable Function CanBeDumpedToBytes (
	width As Integer,
	height As Integer
) As Boolean
Parameters
width
Type: System.Int32
is the point for which to evaluate the texture.
height
Type: System.Int32
duvwdx is a ray differential.
Return Value
Type: Boolean
True if the evaluator returned a valid color. Otherwise false.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace