RhinoCommon API
TextFields.DetailScaleValue Method
 Returns a detail views scale
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string DetailScaleValue()
Public Shared Function DetailScaleValue As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.DetailScaleValue"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextFields Class
Rhino.Runtime Namespace