RhinoCommon API
CommandAliasList.IsDefault Method
 Computes a value indicating if the current alias list is the same as the default alias list.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool IsDefault()
Public Shared Function IsDefault As Boolean
Return Value
Type: Boolean
true if the current alias list is exactly equal to the default alias list; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CommandAliasList Class
Rhino.ApplicationSettings Namespace