RhinoCommon API
CustomDisplay.AddArc Method (Arc, Color, Int32)
 Adds a new, colored arc to the display list.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void AddArc(
	Arc arc,
	Color color,
	int thickness
)
Public Sub AddArc (
	arc As Arc,
	color As Color,
	thickness As Integer
)
Parameters
arc
Type: Rhino.Geometry.Arc
Arc to add.
color
Type: System.Drawing.Color
Color of arc.
thickness
Type: System.Int32
Thickness of arc.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CustomDisplay Class
AddArc Overload
Rhino.Display Namespace