RhinoCommon API
BinaryArchiveReader.ReadPointF Method
 Reads a PointF from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointF ReadPointF()
Public Function ReadPointF As PointF
Return Value
Type: PointF
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace