RhinoCommon API
IHeaderButtonHandler.ButtonDetails Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IHeaderButtonHandler.ButtonDetails(System.Int32,System.Drawing.Bitmap@,System.String@)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
bool ButtonDetails(
	int index,
	ref Bitmap iconOut,
	ref string sToolTipOut
)
Function ButtonDetails (
	index As Integer,
	ByRef iconOut As Bitmap,
	ByRef sToolTipOut As String
) As Boolean
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.Controls.IHeaderButtonHandler.ButtonDetails(System.Int32,System.Drawing.Bitmap@,System.String@)"]
iconOut
Type: System.Drawing.Bitmap
[Missing <param name="iconOut"/> documentation for "M:Rhino.UI.Controls.IHeaderButtonHandler.ButtonDetails(System.Int32,System.Drawing.Bitmap@,System.String@)"]
sToolTipOut
Type: System.String
[Missing <param name="sToolTipOut"/> documentation for "M:Rhino.UI.Controls.IHeaderButtonHandler.ButtonDetails(System.Int32,System.Drawing.Bitmap@,System.String@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.UI.Controls.IHeaderButtonHandler.ButtonDetails(System.Int32,System.Drawing.Bitmap@,System.String@)"]
See Also
Reference
IHeaderButtonHandler Interface
Rhino.UI.Controls Namespace