RhinoCommon API
SafeFrame Constructor
 Create an utility object not associated with any document
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SafeFrame()
Public Sub New
See Also
Reference
SafeFrame Class
SafeFrame Overload
Rhino.Render Namespace