RhinoCommon API
Interval.IncludesParameter Method (Double)
 Tests a parameter for Interval inclusion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncludesParameter(
	double t
)
Public Function IncludesParameter (
	t As Double
) As Boolean
Parameters
t
Type: System.Double
Parameter to test.
Return Value
Type: Boolean
true if t is contained within or is coincident with the limits of this Interval.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Interval Structure
IncludesParameter Overload
Rhino.Geometry Namespace