RhinoCommon API
PostEffectPipeline.RenderingId Method
 Return a UUID that uniquely identifies the rendering being processed.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid RenderingId()
Public Function RenderingId As Guid
Return Value
Type: Guid
Return a UUID that uniquely identifies the rendering being processed.
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace