RhinoCommon API
ToneMappingPostEffectPlugIn.ExecuteWhileRenderingOptions Method
 As rendering proceeds, in order for progress to be seen on the screen, small areas of the frame buffer that have been rendered are post-processed and written to an area of the dib which is then shown on the screen.Some PEPs will not be able to support this as they need the whole frame buffer in order to operate. This method allows a PEP to report whether or not it is able to support execution during rendering, and if so, when it should be done. See enum ExecuteWhileRenderingOptions.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract PostEffectPlugIn.ExecuteWhileRenderingOptionsValue ExecuteWhileRenderingOptions()
Public MustOverride Function ExecuteWhileRenderingOptions As PostEffectPlugIn.ExecuteWhileRenderingOptionsValue
Return Value
Type: PostEffectPlugIn.ExecuteWhileRenderingOptionsValue
returns the ExecuteWhileRenderingOptionsValue
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ToneMappingPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace