RhinoCommon API
RenderMaterial.SimulatedMaterial Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.SimulatedMaterial(Rhino.Render.RenderTexture.TextureGeneration)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Material SimulatedMaterial(
	RenderTexture.TextureGeneration tg
)
Public Function SimulatedMaterial (
	tg As RenderTexture.TextureGeneration
) As Material
Parameters
tg
Type: Rhino.Render.RenderTexture.TextureGeneration
[Missing <param name="tg"/> documentation for "M:Rhino.Render.RenderMaterial.SimulatedMaterial(Rhino.Render.RenderTexture.TextureGeneration)"]
Return Value
Type: Material
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.SimulatedMaterial(Rhino.Render.RenderTexture.TextureGeneration)"]
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace