RhinoCommon API
Point4d.Inequality Operator
 Determines whether two Point4d have different values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator !=(
	Point4d a,
	Point4d b
)
Public Shared Operator <> (
	a As Point4d,
	b As Point4d
) As Boolean
Parameters
a
Type: Rhino.Geometry.Point4d
The first point.
b
Type: Rhino.Geometry.Point4d
The second point.
Return Value
Type: Boolean
true if the two points differ in any coordinate; false otherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Point4d Structure
Rhino.Geometry Namespace