RhinoCommon SDK
ChangeQueue.ApplyBackgroundChanges Method
 Override this when you need to handle background changes (through RenderSettings)
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void ApplyBackgroundChanges(
	RenderSettings rs
)
Protected Overridable Sub ApplyBackgroundChanges (
	rs As RenderSettings
)
Parameters
rs
Type: Rhino.Render.RenderSettings
[Missing <param name="rs"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.ApplyBackgroundChanges(Rhino.Render.RenderSettings)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace