RhinoCommon API
SubD.ClearEvaluationCache Method
 Clear cached information that depends on the location of vertex control points
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public void ClearEvaluationCache()
Public Sub ClearEvaluationCache
See Also
Reference
SubD Class
Rhino.Geometry Namespace