RhinoCommon SDK
MeshVertexHiddenList.Contains Method
 Determines if some vertices are hidden or some are shown.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Contains(
	bool hidden
)
Public Function Contains (
	hidden As Boolean
) As Boolean
Parameters
hidden
Type: System.Boolean
The value to be checked. True means some vertex is hidden.
Return Value
Type: Boolean
True if the array contains the specified value.
Implements
ICollection<T>.Contains(T)
See Also
Reference
MeshVertexHiddenList Class
Rhino.Geometry.Collections Namespace