RhinoCommon API
Sphere.LatitudeRadians Method
 Computes the parallel at a specific latitude angle.
The angle is specified in radians.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Circle LatitudeRadians(
	double radians
)
Public Function LatitudeRadians (
	radians As Double
) As Circle
Parameters
radians
Type: System.Double
An angle in radians for the parallel.
Return Value
Type: Circle
A circle.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace