RhinoCommon API
SelectionFilterSettings.RestoreDefaults Method
 Commits the default settings as the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void RestoreDefaults()
Public Shared Sub RestoreDefaults
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SelectionFilterSettings Class
Rhino.ApplicationSettings Namespace