RhinoCommon API
RhinoObject.ShortDescription Method
 Gets a localized short descriptive name of the object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual string ShortDescription(
	bool plural
)
Public Overridable Function ShortDescription (
	plural As Boolean
) As String
Parameters
plural
Type: System.Boolean
true if the descriptive name should in plural.
Return Value
Type: String
A string with the short localized descriptive name.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace