RhinoCommon API
LatePostEffectPlugIn.Execute Method
 Execute the post effect.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool Execute(
	PostEffectPipeline pipeline,
	Rectangle rect
)
Public MustOverride Function Execute (
	pipeline As PostEffectPipeline,
	rect As Rectangle
) As Boolean
Parameters
pipeline
Type: Rhino.Render.PostEffects.PostEffectPipeline
pipeline provides access to the post-effect pipeline.
rect
Type: System.Drawing.Rectangle
rect is the pixel area to process.
Return Value
Type: Boolean
Return true if successful, else false.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LatePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace