RhinoCommon API
PythonScript.Create Method
 Constructs a new Python script context.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static PythonScript Create()
Public Shared Function Create As PythonScript
Return Value
Type: PythonScript
A new Python script, or null if none could be created. Rhino 4 always returns null.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PythonScript Class
Rhino.Runtime Namespace