RhinoCommon API
ChannelData.CO Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.ChannelData.CO"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ComponentOrder CO()
Public Function CO As ComponentOrder
Return Value
Type: ComponentOrder
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.ChannelData.CO"]
See Also
Reference
ChannelData Class
Rhino.Render.PostEffects Namespace