RhinoCommon API
Point3dList.SetAllZ Method
 Set all the Z values for the points to a single value
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetAllZ(
	double zValue
)
Public Sub SetAllZ (
	zValue As Double
)
Parameters
zValue
Type: System.Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Point3dList Class
Rhino.Collections Namespace