RhinoCommon API
RhinoCore Constructor
 Initializes a new instance of the RhinoCore class.
 Namespace: Rhino.Runtime.InProcess
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoCore()
Public Sub New
Remarks
This constructor creates a headless instance of Rhino. No Rhino UI will be created at all.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoCore Class
RhinoCore Overload
Rhino.Runtime.InProcess Namespace