RhinoCommon API
Brep.MakeValidForV2 Method
 No support is available for this function.
Expert user function that converts all geometry in brep to nurbs form.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MakeValidForV2()
Public Function MakeValidForV2 As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Brep.MakeValidForV2"]
Remarks
 Don't call this function unless you know exactly what you are doing.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Brep Class
Rhino.Geometry Namespace