RhinoCommon API
Mesh.CreateFromSubD Method
 Create a mesh from a SubD limit surface
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Mesh CreateFromSubD(
	SubD subd,
	int displayDensity
)
Public Shared Function CreateFromSubD (
	subd As SubD,
	displayDensity As Integer
) As Mesh
Parameters
subd
Type: Rhino.Geometry.SubD
[Missing <param name="subd"/> documentation for "M:Rhino.Geometry.Mesh.CreateFromSubD(Rhino.Geometry.SubD,System.Int32)"]
displayDensity
Type: System.Int32
[Missing <param name="displayDensity"/> documentation for "M:Rhino.Geometry.Mesh.CreateFromSubD(Rhino.Geometry.SubD,System.Int32)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.CreateFromSubD(Rhino.Geometry.SubD,System.Int32)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Mesh Class
Rhino.Geometry Namespace