RhinoCommon API
Intersection.MeshMesh Method (IEnumerable<Mesh>, Double, Boolean, SetsCombinations, Polyline[], Boolean, Polyline[], TextLog, CancellationToken, IProgress<Double>)
 Intersects meshes. Overlaps and perforations are provided in the output list.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool MeshMesh(
	IEnumerable<Mesh> meshes,
	double tolerance,
	bool preprocessing,
	SetsCombinations sets,
	out Polyline[] intersections,
	bool overlaps,
	out Polyline[] overlapsResult,
	TextLog textLog,
	CancellationToken cancel,
	IProgress<double> progress
)
Public Shared Function MeshMesh (
	meshes As IEnumerable(Of Mesh),
	tolerance As Double,
	preprocessing As Boolean,
	sets As SetsCombinations,
	<OutAttribute> ByRef intersections As Polyline(),
	overlaps As Boolean,
	<OutAttribute> ByRef overlapsResult As Polyline(),
	textLog As TextLog,
	cancel As CancellationToken,
	progress As IProgress(Of Double)
) As Boolean
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
The mesh input list. This cannot be null. Null entries are tolerated.
tolerance
Type: System.Double
A tolerance value. If negative, the positive value will be used. WARNING! Good tolerance values are in the magnitude of 10^-7, or RhinoMath.SqrtEpsilon*10.
preprocessing
Type: System.Boolean
Indicates if a preprocessing step can be executed.
Some groups of meshes have distances between vertices and edges that are below the tolerance indicated. In this case, this parameter allows the function to improve the mesh in order to increase likelihood of intersection success. The mesh topology might change slightly, but not the overall shape.
If meshes have no distances between vertices and edges laying below the tolerance that is indicated, this parameter will do nothing.
sets
Type: Rhino.Geometry.Intersect.SetsCombinations
Determines which sets of intersections are considered. See SetsCombinations for definitions.
intersections
Type: Rhino.Geometry.Polyline[]
If true, overlaps are computed and returned.
overlaps
Type: System.Boolean
If true, overlaps are computed and returned.
overlapsResult
Type: Rhino.Geometry.Polyline[]
If requested, overlaps are returned here.
textLog
Type: Rhino.FileIO.TextLog
A text log, or null.
cancel
Type: System.Threading.CancellationToken
A cancellation token to stop the computation at a given point.
progress
Type: System.IProgress<Double>
A progress reporter to inform the user about progress. The reported value is indicative.
Return Value
Type: Boolean
True, if the operation succeeded, otherwise false.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Intersection Class
MeshMesh Overload
Rhino.Geometry.Intersect Namespace