RhinoCommon API
Mesh.ColorAt Method (MeshPoint)
 Evaluate a mesh color at a set of barycentric coordinates.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ColorAt(
	MeshPoint meshPoint
)
Public Function ColorAt (
	meshPoint As MeshPoint
) As Color
Parameters
meshPoint
Type: Rhino.Geometry.MeshPoint
MeshPoint instance contiaining a valid Face Index and Barycentric coordinates.
Return Value
Type: Color
The interpolated vertex color on the mesh or Color.Transparent if the faceIndex is not valid, if the barycentric coordinates could not be evaluated, or if there are no colors defined on the mesh.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Mesh Class
ColorAt Overload
Rhino.Geometry Namespace