RhinoCommon SDK
RichTextObject.DuplicateTextGeometry Method
 Constructs a deep (full) copy of the RichText geometry.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RichText DuplicateTextGeometry()
Public Function DuplicateTextGeometry As RichText
Return Value
Type: RichText
 A copy of the internal RichText geometry.
See Also
Reference
RichTextObject Class
Rhino.DocObjects Namespace