RhinoCommon API
Transform.Diagonal Method (Vector3d)
 Constructs a new transformation with diagonal (d0,d1,d2,1.0).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Transform Diagonal(
	Vector3d diagonal
)
Public Shared Function Diagonal (
	diagonal As Vector3d
) As Transform
Parameters
diagonal
Type: Rhino.Geometry.Vector3d
The diagonal values.
Return Value
Type: Transform
A transformation with diagonal (d0,d1,d2,1.0).
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Transform Structure
Diagonal Overload
Rhino.Geometry Namespace