RhinoCommon API
RenderSourceView.GetViewInfo Method
 Get the ViewInfo as specified by the render source view settings.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewInfo GetViewInfo()
Public Function GetViewInfo As ViewInfo
Return Value
Type: ViewInfo
ViewInfo if view was found, null otherwise
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderSourceView Class
Rhino.Render Namespace