RhinoCommon API
Dithering Constructor
 Create an utility object not associated with any document
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Dithering()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Dithering Class
Dithering Overload
Rhino.Render Namespace