RhinoCommon API
PersistentSettings.SetDefault Method (String, DateTime)
[Missing <summary> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.DateTime)"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDefault(
	string key,
	DateTime value
)
Public Sub SetDefault (
	key As String,
	value As DateTime
)
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.DateTime)"]
value
Type: System.DateTime
[Missing <param name="value"/> documentation for "M:Rhino.PersistentSettings.SetDefault(System.String,System.DateTime)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PersistentSettings Class
SetDefault Overload
Rhino Namespace