RhinoCommon API
ToolbarFile.GetToolbar Method
[Missing <summary> documentation for "M:Rhino.UI.ToolbarFile.GetToolbar(System.Int32)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Toolbar GetToolbar(
	int index
)
Public Function GetToolbar (
	index As Integer
) As Toolbar
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.ToolbarFile.GetToolbar(System.Int32)"]
Return Value
Type: Toolbar
[Missing <returns> documentation for "M:Rhino.UI.ToolbarFile.GetToolbar(System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ToolbarFile Class
Rhino.UI Namespace