RhinoCommon API
PostEffectThreadEngine Constructor
Initializes a new instance of the PostEffectThreadEngine class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PostEffectThreadEngine(
	IntPtr p
)
Public Sub New (
	p As IntPtr
)
Parameters
p
Type: System.IntPtr
[Missing <param name="p"/> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.#ctor(System.IntPtr)"]
See Also
Reference
PostEffectThreadEngine Class
Rhino.Render.PostEffects Namespace