RhinoCommon SDK
Localization.GetAssemblyFromObject Method
Rhino 5 for Windows
 Check to see if the passed object is an assembly, if not then get the assembly that owns the object type.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.30000.17 (5.13.60913.21340)
Syntax
public static Assembly GetAssemblyFromObject(
	Object assemblyOrObject
)
Public Shared Function GetAssemblyFromObject (
	assemblyOrObject As Object
) As Assembly
Parameters
assemblyOrObject
Type: System.Object
An assembly or an object from an assembly.
Return Value
Type: Assembly
The localized string.
See Also
Reference
Localization Class
Rhino.UI Namespace