RhinoCommon API
Mesh.Volume Method
 Compute volume of the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Volume()
Public Function Volume As Double
Return Value
Type: Double
Volume of the mesh.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Mesh Class
Rhino.Geometry Namespace