RhinoCommon API
EarlyPostEffectPlugIn.Dispose Method
Releases all resources used by the EarlyPostEffectPlugIn
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
EarlyPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace