RhinoCommon API
HostUtils.ExceptionReport Method (String, Exception)
 Informs RhinoCommon of an exception that has been handled but that the developer wants to screen.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void ExceptionReport(
	string source,
	Exception ex
)
Public Shared Sub ExceptionReport (
	source As String,
	ex As Exception
)
Parameters
source
Type: System.String
An exception source text.
ex
Type: System.Exception
An exception.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
HostUtils Class
ExceptionReport Overload
Rhino.Runtime Namespace