RhinoCommon SDK
Decals.Add Method
 Add a new Decal to the decals list, use Decal.Create to create a new decal instance to add.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public uint Add(
	Decal decal
)
Public Function Add (
	decal As Decal
) As UInteger
Parameters
decal
Type: Rhino.Render.Decal
[Missing <param name="decal"/> documentation for "M:Rhino.Render.Decals.Add(Rhino.Render.Decal)"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.Decals.Add(Rhino.Render.Decal)"]
See Also
Reference
Decals Class
Rhino.Render Namespace