RhinoCommon API
SimpleArrayLine Constructor
 Initializes a new SimpleArrayLine instance.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayLine()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
SimpleArrayLine Class
Rhino.Runtime.InteropWrappers Namespace