RhinoCommon API
PhysicallyBasedMaterial.SetTexture Method
 Set the texture that corresponds with the specified texture type for this material.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetTexture(
	Texture texture,
	TextureType which
)
Public Function SetTexture (
	texture As Texture,
	which As TextureType
) As Boolean
Parameters
texture
Type: Rhino.DocObjects.Texture
An instance of Rhino.DocObjects.Texture
which
Type: Rhino.DocObjects.TextureType
Use Rhino.DocObjects.TextureType
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PhysicallyBasedMaterial.SetTexture(Rhino.DocObjects.Texture,Rhino.DocObjects.TextureType)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace