RhinoCommon API
SnapShotsClient.ViewsCategory Method
 Predefined views category
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string ViewsCategory()
Public Shared Function ViewsCategory As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.ViewsCategory"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace