RhinoCommon API
RenderWindow.ChannelGPU.Dispose Method
Releases all resources used by the RenderWindow.ChannelGPU
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace