RhinoCommon API
NamedViewTable.Add Method (ViewInfo)
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Add(Rhino.DocObjects.ViewInfo)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Add(
	ViewInfo view
)
Public Function Add (
	view As ViewInfo
) As Integer
Parameters
view
Type: Rhino.DocObjects.ViewInfo
[Missing <param name="view"/> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Add(Rhino.DocObjects.ViewInfo)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.NamedViewTable.Add(Rhino.DocObjects.ViewInfo)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
NamedViewTable Class
Add Overload
Rhino.DocObjects.Tables Namespace