RhinoCommon SDK
RichText.SetTextString Method
[Missing <summary> documentation for "M:Rhino.Geometry.RichText.SetTextString(System.String,Rhino.DocObjects.Tables.TextStyleTable)"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void SetTextString(
	string richText,
	TextStyleTable textStyleTable
)
Public Sub SetTextString (
	richText As String,
	textStyleTable As TextStyleTable
)
Parameters
richText
Type: System.String
[Missing <param name="richText"/> documentation for "M:Rhino.Geometry.RichText.SetTextString(System.String,Rhino.DocObjects.Tables.TextStyleTable)"]
textStyleTable
Type: Rhino.DocObjects.Tables.TextStyleTable
[Missing <param name="textStyleTable"/> documentation for "M:Rhino.Geometry.RichText.SetTextString(System.String,Rhino.DocObjects.Tables.TextStyleTable)"]
See Also
Reference
RichText Class
Rhino.Geometry Namespace