RhinoCommon SDK
Localization.LocalizeToolStripItemCollection Method
Rhino 5 for Windows
 A form or user control should call this in its constructor if it wants to localize context menus that are set on the fly and not assigned to a forms control in design studio. MyForm::MyForm() { SuspendLayout(); InitializeComponent(); Rhino.UI.Localize.LocalizeToolStripItemCollection( this, this.MyToolStrip.Items ); }
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.30000.17 (5.13.60913.21340)
Syntax
public static void LocalizeToolStripItemCollection(
	Control parent,
	ToolStripItemCollection collection
)
Public Shared Sub LocalizeToolStripItemCollection (
	parent As Control,
	collection As ToolStripItemCollection
)
Parameters
parent
Type: System.Windows.Forms.Control
[Missing <param name="parent"/> documentation for "M:Rhino.UI.Localization.LocalizeToolStripItemCollection(System.Windows.Forms.Control,System.Windows.Forms.ToolStripItemCollection)"]
collection
Type: System.Windows.Forms.ToolStripItemCollection
[Missing <param name="collection"/> documentation for "M:Rhino.UI.Localization.LocalizeToolStripItemCollection(System.Windows.Forms.Control,System.Windows.Forms.ToolStripItemCollection)"]
See Also
Reference
Localization Class
Rhino.UI Namespace