RhinoCommon API
ComponentIndex.IsUnset Method
 Return true is this component index is the same as the Unset component index
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsUnset()
Public Function IsUnset As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.ComponentIndex.IsUnset"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ComponentIndex Structure
Rhino.Geometry Namespace