RhinoCommon API
PersistentSettingsConverter.ToString Method (Double)
 Converts a double value to a string.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string ToString(
	double value
)
Public Shared Function ToString (
	value As Double
) As String
Parameters
value
Type: System.Double
double value
Return Value
Type: String
 Returns the double value as a settings file formatted string.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PersistentSettingsConverter Class
ToString Overload
Rhino Namespace