RhinoCommon API
Mesh.Knife Method
 Creates edges along a collection of meshes, and return a copy if something happened. Knife does not split meshes into parts.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Mesh Knife(
	IEnumerable<Mesh> meshes,
	double tolerance,
	bool splitAtCoplanar,
	TextLog textLog,
	CancellationToken cancel,
	IProgress<double> progress
)
Public Function Knife (
	meshes As IEnumerable(Of Mesh),
	tolerance As Double,
	splitAtCoplanar As Boolean,
	textLog As TextLog,
	cancel As CancellationToken,
	progress As IProgress(Of Double)
) As Mesh
Parameters
meshes
Type: System.Collections.Generic.IEnumerable<Mesh>
Meshes to split with.
tolerance
Type: System.Double
A value for intersection tolerance.
WARNING! Correct values are typically in the (10e-8 - 10e-4) range.
An option is to use the document tolerance diminished by a few orders or magnitude.
splitAtCoplanar
Type: System.Boolean
If false, coplanar areas will not be separated.
textLog
Type: Rhino.FileIO.TextLog
A text log to write onto.
cancel
Type: System.Threading.CancellationToken
A cancellation token.
progress
Type: System.IProgress<Double>
A progress reporter item. This can be null.
Return Value
Type: Mesh
An array of mesh parts representing the split result, or null: when no mesh intersected, or if a cancel stopped the computation.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace