RhinoCommon SDK
BinaryArchiveFile.Finalize Method
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
See Also
Reference
BinaryArchiveFile Class
Rhino.FileIO Namespace