RhinoCommon API
Utilities.ShowContentChooser Method (RhinoDoc, Guid, Guid, RenderContentKind, Utilities.ContentChooserFlags, String, IEnumerable<String>, IEnumerable<Guid>, Guid[])
 Shows the content chooser to allow the user to select a new or existing content, or multiple contents.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public static Utilities.ShowContentChooserResults ShowContentChooser(
	RhinoDoc doc,
	Guid defaultType,
	Guid defaultInstanceId,
	RenderContentKind kinds,
	Utilities.ContentChooserFlags flags,
	string presetCategory,
	IEnumerable<string> categories,
	IEnumerable<Guid> types,
	out Guid[] instanceIdsOut
)
Public Shared Function ShowContentChooser (
	doc As RhinoDoc,
	defaultType As Guid,
	defaultInstanceId As Guid,
	kinds As RenderContentKind,
	flags As Utilities.ContentChooserFlags,
	presetCategory As String,
	categories As IEnumerable(Of String),
	types As IEnumerable(Of Guid),
	<OutAttribute> ByRef instanceIdsOut As Guid()
) As Utilities.ShowContentChooserResults
Parameters
doc
Type: Rhino.RhinoDoc
A Rhino document.
defaultType
Type: System.Guid
The content type that will be initially selected in the 'New' tab.
defaultInstanceId
Type: System.Guid
The content instance that will be initially selected in the 'Existing' tab.
kinds
Type: Rhino.Render.RenderContentKind
Semicolon-delimited string specifying which content kinds will be displayed.
flags
Type: Rhino.Render.Utilities.ContentChooserFlags
Flags controlling the chooser (tabs to hide, type of selection).
presetCategory
Type: System.String
Specifies the category to preset in the drop-down list on the 'New' tab. If this string is empty, the preset category will be 'All'.
categories
Type: System.Collections.Generic.IEnumerable<String>
Specifies the categories to display. Render contents that do not belong to one of these categories will not be listed. If this array is empty, all render contents from all categories will be listed.
types
Type: System.Collections.Generic.IEnumerable<Guid>
Specifies content types to display. Contents that are not one of these types will not be listed. If this array is empty, all content types will be listed.
instanceIdsOut
Type: System.Guid[]
Array of UUID(s) of the chosen item(s). Depending on eRhRdkSccResult, this can accept type id(s) of content type(s) or instance id(s) of existing content(s).
Return Value
Type: Utilities.ShowContentChooserResults
The result of displaying the chooser.
See Also
Reference
Utilities Class
ShowContentChooser Overload
Rhino.Render Namespace