RhinoCommon API
Transform.CompareTo Method
 Compares this transform with another transform.
M33 has highest value, then M32, etc..
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int CompareTo(
	Transform other
)
Public Function CompareTo (
	other As Transform
) As Integer
Parameters
other
Type: Rhino.Geometry.Transform
Another transform.
Return Value
Type: Int32
-1 if this < other; 0 if both are equal; 1 otherwise.
Implements
IComparable<T>.CompareTo(T)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Transform Structure
Rhino.Geometry Namespace