RhinoCommon API
MeshVertexList.GetConnectedVertices Method
 Gets indices of all vertices that form "edges" with a given vertex index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] GetConnectedVertices(
	int vertexIndex
)
Public Function GetConnectedVertices (
	vertexIndex As Integer
) As Integer()
Parameters
vertexIndex
Type: System.Int32
The index of a vertex to query.
Return Value
Type: Int32[]
An array of vertex indices that are connected with the specified vertex.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace