RhinoCommon API
ToneMappingPostEffectPlugInArray.Append Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.ToneMappingPostEffectPlugInArray.Append(Rhino.Render.PostEffects.ToneMappingPostEffectPlugIn)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Append(
	ToneMappingPostEffectPlugIn plugin
)
Public Sub Append (
	plugin As ToneMappingPostEffectPlugIn
)
Parameters
plugin
Type: Rhino.Render.PostEffects.ToneMappingPostEffectPlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.PostEffects.ToneMappingPostEffectPlugInArray.Append(Rhino.Render.PostEffects.ToneMappingPostEffectPlugIn)"]
See Also
Reference
ToneMappingPostEffectPlugInArray Class
Rhino.Render.PostEffects Namespace