RhinoCommon API
Surface.IsIsoparametric Method (BoundingBox)
 Determines if a 2d bounding box is isoparametric in the parameter space of this surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IsoStatus IsIsoparametric(
	BoundingBox bbox
)
Public Function IsIsoparametric (
	bbox As BoundingBox
) As IsoStatus
Parameters
bbox
Type: Rhino.Geometry.BoundingBox
Bounding box to test.
Return Value
Type: IsoStatus
IsoStatus flag describing the iso-parametric relationship between the surface and the bounding box.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Surface Class
IsIsoparametric Overload
Rhino.Geometry Namespace