RhinoCommon SDK
ObjectTable.AddRLeader Method
 Adds a rich text object to the document.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid AddRLeader(
	RLeader rleader,
	ObjectAttributes attributes
)
Public Function AddRLeader (
	rleader As RLeader,
	attributes As ObjectAttributes
) As Guid
Parameters
rleader
Type: Rhino.Geometry.RLeader
[Missing <param name="rleader"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRLeader(Rhino.Geometry.RLeader,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRLeader(Rhino.Geometry.RLeader,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.ObjectTable.AddRLeader(Rhino.Geometry.RLeader,Rhino.DocObjects.ObjectAttributes)"]
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace