RhinoCommon API
PostEffects.GetToneMappingPostEffects Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffects.GetToneMappingPostEffects"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ToneMappingPostEffectPlugInArray GetToneMappingPostEffects()
Public Function GetToneMappingPostEffects As ToneMappingPostEffectPlugInArray
Return Value
Type: ToneMappingPostEffectPlugInArray
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffects.GetToneMappingPostEffects"]
See Also
Reference
PostEffects Class
Rhino.Render.PostEffects Namespace