RhinoCommon SDK
ViewportInfo.Finalize Method
Rhino 5 for Windows
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.30000.16 (5.0.20693.0)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace