RhinoCommon API
RhinoApp.Wait Method
 Pauses to keep Windows message pump alive so views will update and windows will repaint.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void Wait()
Public Shared Sub Wait
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoApp Class
Rhino Namespace