RhinoCommon API
PointCloud.Merge Method
 Copies the point values of another point cloud into this one.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Merge(
	PointCloud other
)
Public Sub Merge (
	other As PointCloud
)
Parameters
other
Type: Rhino.Geometry.PointCloud
PointCloud to merge with this one.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PointCloud Class
Rhino.Geometry Namespace