RhinoCommon API
Point2dField.ValueAsObject Method
[Missing <summary> documentation for "M:Rhino.Render.Fields.Point2dField.ValueAsObject"]
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override Object ValueAsObject()
Public Overrides Function ValueAsObject As Object
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.Render.Fields.Point2dField.ValueAsObject"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Point2dField Class
Rhino.Render.Fields Namespace