RhinoCommon API
RenderWindow.ChannelEx.GetMinMaxValues Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetMinMaxValues(System.Single@,System.Single@)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void GetMinMaxValues(
	ref float min,
	ref float max
)
Public Sub GetMinMaxValues (
	ByRef min As Single,
	ByRef max As Single
)
Parameters
min
Type: System.Single
[Missing <param name="min"/> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetMinMaxValues(System.Single@,System.Single@)"]
max
Type: System.Single
[Missing <param name="max"/> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetMinMaxValues(System.Single@,System.Single@)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderWindow.ChannelEx Class
Rhino.Render Namespace