RhinoCommon API
SimpleArrayBrepPointer.ConstPointer Method
 Gets the const (immutable) pointer of this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
The const pointer.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
SimpleArrayBrepPointer Class
Rhino.Runtime.InteropWrappers Namespace