RhinoCommon API
PlugIn.GetInstalledPlugInFolders Method
[Missing <summary> documentation for "M:Rhino.PlugIns.PlugIn.GetInstalledPlugInFolders"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string[] GetInstalledPlugInFolders()
Public Shared Function GetInstalledPlugInFolders As String()
Return Value
Type: String[]
[Missing <returns> documentation for "M:Rhino.PlugIns.PlugIn.GetInstalledPlugInFolders"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace