RhinoCommon API
NurbsSurface.CreateFromSphere Method
 Constructs a new NURBS surfaces from sphere data.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static NurbsSurface CreateFromSphere(
	Sphere sphere
)
Public Shared Function CreateFromSphere (
	sphere As Sphere
) As NurbsSurface
Parameters
sphere
Type: Rhino.Geometry.Sphere
A sphere value.
Return Value
Type: NurbsSurface
A new NURBS surface, or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace