RhinoCommon API
ObjectAttributes.DeleteAllUserStrings Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ObjectAttributes.DeleteAllUserStrings"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void DeleteAllUserStrings()
Public Sub DeleteAllUserStrings
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace