RhinoCommon API
RenderWindow.ChannelEx.Id Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.Id"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id()
Public Function Id As Guid
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.Id"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderWindow.ChannelEx Class
Rhino.Render Namespace