RhinoCommon API
MaterialRef.Finalize Method
[Missing <summary> documentation for "M:Rhino.DocObjects.MaterialRef.Finalize"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace