RhinoCommon API
DigitizerPlugIn Constructor
Initializes a new instance of the DigitizerPlugIn class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected DigitizerPlugIn()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DigitizerPlugIn Class
Rhino.PlugIns Namespace