RhinoCommon API
ColorCMYK.CreateFromHSL Method
 Constructs the nearest CMYK equivalent of an HSL color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ColorCMYK CreateFromHSL(
	ColorHSL hsl
)
Public Shared Function CreateFromHSL (
	hsl As ColorHSL
) As ColorCMYK
Parameters
hsl
Type: Rhino.Display.ColorHSL
Target color in HSL space.
Return Value
Type: ColorCMYK
The CMYK equivalent of the HSL color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace