RhinoCommon API
PostEffectThreadEngine.RunPostEffect Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffectPlugIn,System.Drawing.Rectangle,Rhino.Render.PostEffects.ChannelDataCollection,System.IntPtr)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RunPostEffect(
	PostEffectJob job,
	PostEffectPipeline pipeline,
	PostEffectPlugIn plugin,
	Rectangle rect,
	ChannelDataCollection channels,
	IntPtr pExtension
)
Public Function RunPostEffect (
	job As PostEffectJob,
	pipeline As PostEffectPipeline,
	plugin As PostEffectPlugIn,
	rect As Rectangle,
	channels As ChannelDataCollection,
	pExtension As IntPtr
) As Boolean
Parameters
job
Type: Rhino.Render.PostEffects.PostEffectJob
[Missing <param name="job"/> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffectPlugIn,System.Drawing.Rectangle,Rhino.Render.PostEffects.ChannelDataCollection,System.IntPtr)"]
pipeline
Type: Rhino.Render.PostEffects.PostEffectPipeline
[Missing <param name="pipeline"/> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffectPlugIn,System.Drawing.Rectangle,Rhino.Render.PostEffects.ChannelDataCollection,System.IntPtr)"]
plugin
Type: Rhino.Render.PostEffects.PostEffectPlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffectPlugIn,System.Drawing.Rectangle,Rhino.Render.PostEffects.ChannelDataCollection,System.IntPtr)"]
rect
Type: System.Drawing.Rectangle
[Missing <param name="rect"/> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffectPlugIn,System.Drawing.Rectangle,Rhino.Render.PostEffects.ChannelDataCollection,System.IntPtr)"]
channels
Type: Rhino.Render.PostEffects.ChannelDataCollection
[Missing <param name="channels"/> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffectPlugIn,System.Drawing.Rectangle,Rhino.Render.PostEffects.ChannelDataCollection,System.IntPtr)"]
pExtension
Type: System.IntPtr
[Missing <param name="pExtension"/> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffectPlugIn,System.Drawing.Rectangle,Rhino.Render.PostEffects.ChannelDataCollection,System.IntPtr)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffectPlugIn,System.Drawing.Rectangle,Rhino.Render.PostEffects.ChannelDataCollection,System.IntPtr)"]
See Also
Reference
PostEffectThreadEngine Class
Rhino.Render.PostEffects Namespace