RhinoCommon API
MeshTextureCoordinateList.NormalizeTextureCoordinates Method
 Scales the texture coordinates so the texture domains are [0,1] and eliminate any texture rotations.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool NormalizeTextureCoordinates()
Public Function NormalizeTextureCoordinates As Boolean
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshTextureCoordinateList Class
Rhino.Geometry.Collections Namespace