RhinoCommon API
SimpleArrayInt Constructor
 Initializes a new SimpleArrayInt class.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayInt()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
SimpleArrayInt Class
SimpleArrayInt Overload
Rhino.Runtime.InteropWrappers Namespace