RhinoCommon API
LatePostEffectPlugInArray Constructor (IntPtr)
Initializes a new instance of the LatePostEffectPlugInArray class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LatePostEffectPlugInArray(
	IntPtr pArray
)
Public Sub New (
	pArray As IntPtr
)
Parameters
pArray
Type: System.IntPtr
[Missing <param name="pArray"/> documentation for "M:Rhino.Render.PostEffects.LatePostEffectPlugInArray.#ctor(System.IntPtr)"]
See Also
Reference
LatePostEffectPlugInArray Class
LatePostEffectPlugInArray Overload
Rhino.Render.PostEffects Namespace