RhinoCommon API
Brep.CreatePlanarBreps Method (CurveList)
 Constructs a set of planar Breps as outlines by the loops.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Brep[] CreatePlanarBreps(
	CurveList inputLoops
)
Public Shared Function CreatePlanarBreps (
	inputLoops As CurveList
) As Brep()
Parameters
inputLoops
Type: Rhino.Collections.CurveList
Curve loops that delineate the planar boundaries.
Return Value
Type: Brep[]
An array of Planar Breps or null on error.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 7.0
See Also
Reference
Brep Class
CreatePlanarBreps Overload
Rhino.Geometry Namespace