RhinoCommon API
ReplayHistoryResult.UpdateToSphere Method
[Missing <summary> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UpdateToSphere(
	Sphere sphere,
	ObjectAttributes attributes
)
Public Function UpdateToSphere (
	sphere As Sphere,
	attributes As ObjectAttributes
) As Boolean
Parameters
sphere
Type: Rhino.Geometry.Sphere
[Missing <param name="sphere"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes)"]
attributes
Type: Rhino.DocObjects.ObjectAttributes
[Missing <param name="attributes"/> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.ReplayHistoryResult.UpdateToSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ReplayHistoryResult Class
Rhino.DocObjects Namespace