RhinoCommon API
Squisher Constructor
 constructs a squisher with default parameters
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Squisher()
Public Sub New
See Also
Reference
Squisher Class
Rhino.Geometry Namespace