RhinoCommon API
File3dm.SetPreviewImage Method
 Preview image used for file explorer
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetPreviewImage(
	Bitmap image
)
Public Sub SetPreviewImage (
	image As Bitmap
)
Parameters
image
Type: System.Drawing.Bitmap
[Missing <param name="image"/> documentation for "M:Rhino.FileIO.File3dm.SetPreviewImage(System.Drawing.Bitmap)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dm Class
Rhino.FileIO Namespace