RhinoCommon API
Surface.Offset Method
 Constructs a new surface which is offset from the current surface.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Surface Offset(
	double distance,
	double tolerance
)
Public Function Offset (
	distance As Double,
	tolerance As Double
) As Surface
Parameters
distance
Type: System.Double
Distance (along surface normal) to offset.
tolerance
Type: System.Double
Offset accuracy.
Return Value
Type: Surface
The offset surface or null on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Surface Class
Rhino.Geometry Namespace