RhinoCommon API
Surface.IsSphere Method
 Determines if the surface is a portion of a sphere within RhinoMath.ZeroTolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSphere()
Public Function IsSphere As Boolean
Return Value
Type: Boolean
true if the surface is a portion of a sphere.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Surface Class
IsSphere Overload
Rhino.Geometry Namespace