RhinoCommon SDK
ChangeQueue.GetQueueView Method
 Get view known to the queue at the time of the Flush
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoView GetQueueView(
	Guid viewportId
)
Public Function GetQueueView (
	viewportId As Guid
) As RhinoView
Parameters
viewportId
Type: System.Guid
[Missing <param name="viewportId"/> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.GetQueueView(System.Guid)"]
Return Value
Type: RhinoView
[Missing <returns> documentation for "M:Rhino.Render.ChangeQueue.ChangeQueue.GetQueueView(System.Guid)"]
See Also
Reference
ChangeQueue Class
Rhino.Render.ChangeQueue Namespace