RhinoCommon API
LatePostEffectPlugInArray.Append Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.LatePostEffectPlugInArray.Append(Rhino.Render.PostEffects.LatePostEffectPlugIn)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Append(
	LatePostEffectPlugIn plugin
)
Public Sub Append (
	plugin As LatePostEffectPlugIn
)
Parameters
plugin
Type: Rhino.Render.PostEffects.LatePostEffectPlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.PostEffects.LatePostEffectPlugInArray.Append(Rhino.Render.PostEffects.LatePostEffectPlugIn)"]
See Also
Reference
LatePostEffectPlugInArray Class
Rhino.Render.PostEffects Namespace