RhinoCommon API
Mesh.CreateFromSubDControlNet Method
 Create a mesh from a SubD control net
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Mesh CreateFromSubDControlNet(
	SubD subd
)
Public Shared Function CreateFromSubDControlNet (
	subd As SubD
) As Mesh
Parameters
subd
Type: Rhino.Geometry.SubD
[Missing <param name="subd"/> documentation for "M:Rhino.Geometry.Mesh.CreateFromSubDControlNet(Rhino.Geometry.SubD)"]
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.CreateFromSubDControlNet(Rhino.Geometry.SubD)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Mesh Class
Rhino.Geometry Namespace