RhinoCommon API
Line.MaximumDistanceTo Method (Line)
 Finds the largest distance between this line as a finite segment and another finite segment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MaximumDistanceTo(
	Line testLine
)
Public Function MaximumDistanceTo (
	testLine As Line
) As Double
Parameters
testLine
Type: Rhino.Geometry.Line
A line to test.
Return Value
Type: Double
The maximum distance.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Line Structure
MaximumDistanceTo Overload
Rhino.Geometry Namespace