RhinoCommon API
IHeaderButtonHandler.ButtonRect Method
[Missing <summary> documentation for "M:Rhino.UI.Controls.IHeaderButtonHandler.ButtonRect(System.Int32,System.Drawing.Rectangle)"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.4
Syntax
Rectangle ButtonRect(
	int index,
	Rectangle rectHeader
)
Function ButtonRect (
	index As Integer,
	rectHeader As Rectangle
) As Rectangle
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.UI.Controls.IHeaderButtonHandler.ButtonRect(System.Int32,System.Drawing.Rectangle)"]
rectHeader
Type: System.Drawing.Rectangle
[Missing <param name="rectHeader"/> documentation for "M:Rhino.UI.Controls.IHeaderButtonHandler.ButtonRect(System.Int32,System.Drawing.Rectangle)"]
Return Value
Type: Rectangle
[Missing <returns> documentation for "M:Rhino.UI.Controls.IHeaderButtonHandler.ButtonRect(System.Int32,System.Drawing.Rectangle)"]
See Also
Reference
IHeaderButtonHandler Interface
Rhino.UI.Controls Namespace