RhinoCommon SDK
Panels.OpenPanel Method (Guid, Guid)
[Missing <summary> documentation for "M:Rhino.UI.Panels.OpenPanel(System.Guid,System.Guid)"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid OpenPanel(
	Guid dockBarId,
	Guid panelId
)
Public Shared Function OpenPanel (
	dockBarId As Guid,
	panelId As Guid
) As Guid
Parameters
dockBarId
Type: System.Guid
[Missing <param name="dockBarId"/> documentation for "M:Rhino.UI.Panels.OpenPanel(System.Guid,System.Guid)"]
panelId
Type: System.Guid
[Missing <param name="panelId"/> documentation for "M:Rhino.UI.Panels.OpenPanel(System.Guid,System.Guid)"]
Return Value
Type: Guid
[Missing <returns> documentation for "M:Rhino.UI.Panels.OpenPanel(System.Guid,System.Guid)"]
See Also
Reference
Panels Class
OpenPanel Overload
Rhino.UI Namespace