RhinoCommon API
ListablePostEffectPlugIn.Shown Method
 return true if the PEP is shown in a list. Only PEPs that are shown will execute.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool Shown()
Public Overridable Function Shown As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.PostEffects.ListablePostEffectPlugIn.Shown"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ListablePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace