RhinoCommon API
Material.GetEnvironmentTexture Method
Note: This API is now obsolete.
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.GetEnvironmentTexture"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
[ObsoleteAttribute("Use GetTexture instead")]
public Texture GetEnvironmentTexture()
<ObsoleteAttribute("Use GetTexture instead")>
Public Function GetEnvironmentTexture As Texture
Return Value
Type: Texture
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.GetEnvironmentTexture"]
See Also
Reference
Material Class
Rhino.DocObjects Namespace