RhinoCommon API
SubDEdge.ToNurbsCurve Method
 Get a cubic, uniform, nonrational, NURBS curve that is on the edge's limit curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public NurbsCurve ToNurbsCurve(
	bool clampEnds
)
Public Function ToNurbsCurve (
	clampEnds As Boolean
) As NurbsCurve
Parameters
clampEnds
Type: System.Boolean
 If true, the end knots are clamped. Otherwise the end knots are(-2,-1,0,...., k1, k1+1, k1+2).
Return Value
Type: NurbsCurve
[Missing <returns> documentation for "M:Rhino.Geometry.SubDEdge.ToNurbsCurve(System.Boolean)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace