RhinoCommon API
File3dmWriteOptions Constructor
 Initializes properties to defaults.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmWriteOptions()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace