RhinoCommon API
MeshTextureCoordinateList.SetTextureCoordinates Method (Point2f[])
 Sets all texture coordinates in one go.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetTextureCoordinates(
	Point2f[] textureCoordinates
)
Public Function SetTextureCoordinates (
	textureCoordinates As Point2f()
) As Boolean
Parameters
textureCoordinates
Type: Rhino.Geometry.Point2f[]
Texture coordinates to assign to the mesh.
Return Value
Type: Boolean
true on success, false on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshTextureCoordinateList Class
SetTextureCoordinates Overload
Rhino.Geometry.Collections Namespace