RhinoCommon API
PreviewSceneServer Constructor
 Constructor for PreviewSceneServer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public PreviewSceneServer(
	IntPtr pPreviewSceneServer
)
Public Sub New (
	pPreviewSceneServer As IntPtr
)
Parameters
pPreviewSceneServer
Type: System.IntPtr
[Missing <param name="pPreviewSceneServer"/> documentation for "M:Rhino.Render.PreviewSceneServer.#ctor(System.IntPtr)"]
See Also
Reference
PreviewSceneServer Class
Rhino.Render Namespace