RhinoCommon API
MeshVertexList.Hide Method
 Hides the vertex at the given index.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Hide(
	int vertexIndex
)
Public Sub Hide (
	vertexIndex As Integer
)
Parameters
vertexIndex
Type: System.Int32
Index of vertex to hide.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshVertexList Class
Rhino.Geometry.Collections Namespace