RhinoCommon API
ArchivableDictionary.Set Method (String, IEnumerable<GeometryBase>)
[Missing <summary> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})"]
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Set(
	string key,
	IEnumerable<GeometryBase> val
)
Public Function Set (
	key As String,
	val As IEnumerable(Of GeometryBase)
) As Boolean
Parameters
key
Type: System.String
[Missing <param name="key"/> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})"]
val
Type: System.Collections.Generic.IEnumerable<GeometryBase>
[Missing <param name="val"/> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Collections.ArchivableDictionary.Set(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ArchivableDictionary Class
Set Overload
Rhino.Collections Namespace