RhinoCommon API
Curve.TryGetArc Method (Arc, Double)
 Try to convert this curve into an Arc using a custom tolerance.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetArc(
	out Arc arc,
	double tolerance
)
Public Function TryGetArc (
	<OutAttribute> ByRef arc As Arc,
	tolerance As Double
) As Boolean
Parameters
arc
Type: Rhino.Geometry.Arc
On success, the Arc will be filled in.
tolerance
Type: System.Double
Tolerance to use when checking.
Return Value
Type: Boolean
true if the curve could be converted into an arc.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Curve Class
TryGetArc Overload
Rhino.Geometry Namespace