RhinoCommon API
RenderMaterial.PhysicallyBased.ChildSlotNames.FromTextureType Method
[Missing <summary> documentation for "M:Rhino.Render.RenderMaterial.PhysicallyBased.ChildSlotNames.FromTextureType(Rhino.DocObjects.TextureType)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string FromTextureType(
	TextureType tt
)
Public Shared Function FromTextureType (
	tt As TextureType
) As String
Parameters
tt
Type: Rhino.DocObjects.TextureType
[Missing <param name="tt"/> documentation for "M:Rhino.Render.RenderMaterial.PhysicallyBased.ChildSlotNames.FromTextureType(Rhino.DocObjects.TextureType)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Render.RenderMaterial.PhysicallyBased.ChildSlotNames.FromTextureType(Rhino.DocObjects.TextureType)"]
See Also
Reference
RenderMaterial.PhysicallyBased.ChildSlotNames Class
Rhino.Render Namespace