RhinoCommon API
Vector3d.UnaryNegation Operator
 Computes the opposite vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3d operator -(
	Vector3d vector
)
Public Shared Operator - (
	vector As Vector3d
) As Vector3d
Parameters
vector
Type: Rhino.Geometry.Vector3d
A vector to negate.
Return Value
Type: Vector3d
A new vector where all components were multiplied by -1.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace