RhinoCommon API
EarlyPostEffectPlugInArray.Append Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.EarlyPostEffectPlugInArray.Append(Rhino.Render.PostEffects.EarlyPostEffectPlugIn)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Append(
	EarlyPostEffectPlugIn plugin
)
Public Sub Append (
	plugin As EarlyPostEffectPlugIn
)
Parameters
plugin
Type: Rhino.Render.PostEffects.EarlyPostEffectPlugIn
[Missing <param name="plugin"/> documentation for "M:Rhino.Render.PostEffects.EarlyPostEffectPlugInArray.Append(Rhino.Render.PostEffects.EarlyPostEffectPlugIn)"]
See Also
Reference
EarlyPostEffectPlugInArray Class
Rhino.Render.PostEffects Namespace