RhinoCommon API
Thumbnail.Finalize Method
 Destructor for Thumbnail
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected override void Finalize()
Protected Overrides Sub Finalize
Implements
Object.Finalize()
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Thumbnail Class
Rhino.UI.Controls.ThumbnailUI Namespace