RhinoCommon API
PostEffectFactory Constructor
 This class allows you to provide a factory for generating a custom post-effect plug-in (PEP).
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PostEffectFactory()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectFactory Class
Rhino.Render.PostEffects Namespace