RhinoCommon API
Polyline.GetSegments Method
 Constructs an array of line segments that make up the entire polyline.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line[] GetSegments()
Public Function GetSegments As Line()
Return Value
Type: Line[]
An array of line segments or null if the polyline contains fewer than 2 points.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Polyline Class
Rhino.Geometry Namespace