RhinoCommon API
Sphere.ToBrep Method
 Converts this sphere is it Brep representation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep ToBrep()
Public Function ToBrep As Brep
Return Value
Type: Brep
[Missing <returns> documentation for "M:Rhino.Geometry.Sphere.ToBrep"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace