RhinoCommon API
TextFields.Volume Method
[Missing <summary> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double Volume(
	string id
)
Public Shared Function Volume (
	id As String
) As Double
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String)"]
Return Value
Type: Double
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.Volume(System.String)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextFields Class
Rhino.Runtime Namespace