RhinoCommon API
CurveList.Insert Method (Int32, Ellipse)
 Inserts an ellipse at a given index of this list.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Insert(
	int index,
	Ellipse ellipse
)
Public Sub Insert (
	index As Integer,
	ellipse As Ellipse
)
Parameters
index
Type: System.Int32
A 0-based position in the list.
ellipse
Type: Rhino.Geometry.Ellipse
The ellipse value from which to construct the new curve.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CurveList Class
Insert Overload
Rhino.Collections Namespace