RhinoCommon SDK
MeshVertexHiddenList.Destroy Method
 Releases all memory allocated to store hidden vertices. The list capacity will be 0 after this call.
Vertices will be immediately considered visible.
Subsequent calls can add new items.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public void Destroy()
Public Sub Destroy
See Also
Reference
MeshVertexHiddenList Class
Rhino.Geometry.Collections Namespace