RhinoCommon SDK
Dialogs.ShowSemiModal Method
Rhino 5 for Windows
 Show a windows form that is modal in the sense that this function does not return until the form is closed, but also allows for interaction with other elements of the Rhino user interface.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.30000.17 (5.13.60913.21340)
Syntax
public static DialogResult ShowSemiModal(
	Form form
)
Public Shared Function ShowSemiModal (
	form As Form
) As DialogResult
Parameters
form
Type: System.Windows.Forms.Form
 The form must have buttons that are assigned to the "AcceptButton" and "CancelButton".
Return Value
Type: DialogResult
One of the System.Windows.Forms.DialogResult values.
See Also
Reference
Dialogs Class
Rhino.UI Namespace