RhinoCommon API
SnapShotsClient.RenderingCategory Method
 Predefined rendering category
 Namespace: Rhino.DocObjects.SnapShots
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string RenderingCategory()
Public Shared Function RenderingCategory As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.DocObjects.SnapShots.SnapShotsClient.RenderingCategory"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SnapShotsClient Class
Rhino.DocObjects.SnapShots Namespace