RhinoCommon API
SimpleArrayDouble.ToArray Method
 Returns the managed counterpart of the unmanaged array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double[] ToArray()
Public Function ToArray As Double()
Return Value
Type: Double[]
The managed array.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
SimpleArrayDouble Class
Rhino.Runtime.InteropWrappers Namespace