RhinoCommon SDK
Utilities.FindFile Method
 Finds a file and also handles network shares.
Remarks
This is a replacement for CRhinoFileUtilities::FindFile().
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static string FindFile(
	uint docSerialNumber,
	string fullPathToFile
)
Public Shared Function FindFile (
	docSerialNumber As UInteger,
	fullPathToFile As String
) As String
Parameters
docSerialNumber
Type: System.UInt32
Document to use for locating .3dm file's folder.
fullPathToFile
Type: System.String
The file to be found.
Return Value
Type: String
The found file.
See Also
Reference
Utilities Class
Rhino.Render Namespace