RhinoCommon API
DrawingUtilities.PixelsFromSvg Method
 Get array of bytes that represent RGBA values for an image of a given size created from SVG
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static byte[] PixelsFromSvg(
	string svg,
	int width,
	int height
)
Public Shared Function PixelsFromSvg (
	svg As String,
	width As Integer,
	height As Integer
) As Byte()
Parameters
svg
Type: System.String
[Missing <param name="svg"/> documentation for "M:Rhino.UI.DrawingUtilities.PixelsFromSvg(System.String,System.Int32,System.Int32)"]
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.UI.DrawingUtilities.PixelsFromSvg(System.String,System.Int32,System.Int32)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.UI.DrawingUtilities.PixelsFromSvg(System.String,System.Int32,System.Int32)"]
Return Value
Type: Byte[]
[Missing <returns> documentation for "M:Rhino.UI.DrawingUtilities.PixelsFromSvg(System.String,System.Int32,System.Int32)"]
See Also
Reference
DrawingUtilities Class
Rhino.UI Namespace