RhinoCommon API
PostEffectPlugIn.SupportsHDRData Method
 Return true if the PEP can operate on HDR data (meaning channels containing values greater than 1).
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool SupportsHDRData()
Public Overridable Function SupportsHDRData As Boolean
Return Value
Type: Boolean
Return true if the PEP can operate on HDR data
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace