RhinoCommon API
ChannelData Constructor
Initializes a new instance of the ChannelData class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ChannelData()
Public Sub New
See Also
Reference
ChannelData Class
ChannelData Overload
Rhino.Render.PostEffects Namespace