RhinoCommon API
DracoCompression.ToBase64String Method
 Convert byte array of draco compressed data into a base64 encoded string
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ToBase64String()
Public Function ToBase64String As String
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.FileIO.DracoCompression.ToBase64String"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace