RhinoCommon API
EarlyPostEffectPlugIn Constructor
Initializes a new instance of the EarlyPostEffectPlugIn class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public EarlyPostEffectPlugIn()
Public Sub New
See Also
Reference
EarlyPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace