RhinoCommon API
ObjectTable.Replace Method (ObjRef, Point3d)
Replaces one object with new point object.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Replace(
	ObjRef objref,
	Point3d point
)
Public Function Replace (
	objref As ObjRef,
	point As Point3d
) As Boolean
Parameters
objref
Type: Rhino.DocObjects.ObjRef
 Reference to old object to be replaced. The object objref.Object() will be deleted.
point
Type: Rhino.Geometry.Point3d
new point to be added. The point is copied.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectTable Class
Replace Overload
Rhino.DocObjects.Tables Namespace