RhinoCommon SDK
AnnotationArrowhead Constructor
 Constructotr
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public AnnotationArrowhead()
Public Sub New
See Also
Reference
AnnotationArrowhead Class
Rhino.Geometry Namespace