RhinoCommon API
ToneMappingPostEffectPlugIn.ReadState Method
 Read the state. If your PEP has no state, you must still return true for success.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool ReadState(
	PostEffectState state
)
Public MustOverride Function ReadState (
	state As PostEffectState
) As Boolean
Parameters
state
Type: Rhino.Render.PostEffects.PostEffectState
PostEffectState
Return Value
Type: Boolean
 Return true if successful, else false.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ToneMappingPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace