RhinoCommon API
DisplayModeDescription.DeleteDiplayMode Method
 Deletes an existing display mode.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool DeleteDiplayMode(
	Guid id
)
Public Shared Function DeleteDiplayMode (
	id As Guid
) As Boolean
Parameters
id
Type: System.Guid
The id of the existing display mode to delete.
Return Value
Type: Boolean
true if successful, false oteherwise.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 7.0
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace