RhinoCommon API
RenderWindow.ChannelEx.GetValueRect Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetValueRect(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Rhino.Render.PostEffects.ComponentOrder,System.Single[]@)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void GetValueRect(
	int x,
	int y,
	int width,
	int height,
	int stride,
	ComponentOrder order,
	ref float[] values
)
Public Sub GetValueRect (
	x As Integer,
	y As Integer,
	width As Integer,
	height As Integer,
	stride As Integer,
	order As ComponentOrder,
	ByRef values As Single()
)
Parameters
x
Type: System.Int32
[Missing <param name="x"/> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetValueRect(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Rhino.Render.PostEffects.ComponentOrder,System.Single[]@)"]
y
Type: System.Int32
[Missing <param name="y"/> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetValueRect(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Rhino.Render.PostEffects.ComponentOrder,System.Single[]@)"]
width
Type: System.Int32
[Missing <param name="width"/> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetValueRect(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Rhino.Render.PostEffects.ComponentOrder,System.Single[]@)"]
height
Type: System.Int32
[Missing <param name="height"/> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetValueRect(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Rhino.Render.PostEffects.ComponentOrder,System.Single[]@)"]
stride
Type: System.Int32
[Missing <param name="stride"/> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetValueRect(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Rhino.Render.PostEffects.ComponentOrder,System.Single[]@)"]
order
Type: Rhino.Render.PostEffects.ComponentOrder
[Missing <param name="order"/> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetValueRect(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Rhino.Render.PostEffects.ComponentOrder,System.Single[]@)"]
values
Type: System.Single[]
[Missing <param name="values"/> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.GetValueRect(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Rhino.Render.PostEffects.ComponentOrder,System.Single[]@)"]
See Also
Reference
RenderWindow.ChannelEx Class
Rhino.Render Namespace