RhinoCommon API
Squisher.GetMesh2dEdges Method
 Gets the edges of the mesh which correspond to the edges of the same indices resulting from GetMesh3dEdges
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line[] GetMesh2dEdges()
Public Function GetMesh2dEdges As Line()
Return Value
Type: Line[]
And array of lines representing the mesh edges
See Also
Reference
Squisher Class
Rhino.Geometry Namespace