RhinoCommon API
BinaryArchiveWriter.WriteCompressedBuffer Method
 Writes a list, an array, or any enumerable of Byte to the archive as a compressed buffer.
The return will always be an array.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void WriteCompressedBuffer(
	IEnumerable<byte> value
)
Public Sub WriteCompressedBuffer (
	value As IEnumerable(Of Byte)
)
Parameters
value
Type: System.Collections.Generic.IEnumerable<Byte>
A value to write.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BinaryArchiveWriter Class
Rhino.FileIO Namespace