RhinoCommon API
RenderPrimitive.Mesh Method
 Returns the mesh associated with the object, this will mesh primitives and always return a mesh.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh Mesh()
Public Function Mesh As Mesh
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Render.RenderPrimitive.Mesh"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace