RhinoCommon API
Line.Inequality Operator
 Determines whether two lines have different values.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator !=(
	Line a,
	Line b
)
Public Shared Operator <> (
	a As Line,
	b As Line
) As Boolean
Parameters
a
Type: Rhino.Geometry.Line
A line.
b
Type: Rhino.Geometry.Line
Another line.
Return Value
Type: Boolean
true if a has any coordinate that distinguishes it from b; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Line Structure
Rhino.Geometry Namespace