RhinoCommon API
TextFields.PageContents Method (String)
 Returns the Page Contents of the layout specified by the rhino view id string
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string PageContents(
	string id
)
Public Shared Function PageContents (
	id As String
) As String
Parameters
id
Type: System.String
[Missing <param name="id"/> documentation for "M:Rhino.Runtime.TextFields.PageContents(System.String)"]
Return Value
Type: String
[Missing <returns> documentation for "M:Rhino.Runtime.TextFields.PageContents(System.String)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextFields Class
PageContents Overload
Rhino.Runtime Namespace