RhinoCommon API
TextureEvaluator.FreeByteArray Method
[Missing <summary> documentation for "M:Rhino.Render.TextureEvaluator.FreeByteArray(System.IntPtr)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void FreeByteArray(
	IntPtr p
)
Public Shared Sub FreeByteArray (
	p As IntPtr
)
Parameters
p
Type: System.IntPtr
[Missing <param name="p"/> documentation for "M:Rhino.Render.TextureEvaluator.FreeByteArray(System.IntPtr)"]
Return Value
Type:
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace