RhinoCommon API
RdkSelectionNavigator.CanGoBackwards Method
 Check the backwards status of the navigator
 Namespace: Rhino.Render.DataSources
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CanGoBackwards()
Public Function CanGoBackwards As Boolean
Return Value
Type: Boolean
True if it is possible to navigate backwards, else false
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RdkSelectionNavigator Class
Rhino.Render.DataSources Namespace