RhinoCommon API
HermiteSurface.SetVTangentAt Method
 Set the "v" tangent direction (actually first derivative) to intepolate at the u,v parameter location.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetVTangentAt(
	int uIndex,
	int vIndex,
	Vector3d tangent
)
Public Sub SetVTangentAt (
	uIndex As Integer,
	vIndex As Integer,
	tangent As Vector3d
)
Parameters
uIndex
Type: System.Int32
The "u" index.
vIndex
Type: System.Int32
The "v" index.
tangent
Type: Rhino.Geometry.Vector3d
The tangent direction.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace