RhinoCommon API
Material.SetBitmapTexture Method (String)
[Missing <summary> documentation for "M:Rhino.DocObjects.Material.SetBitmapTexture(System.String)"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SetBitmapTexture(
	string filename
)
Public Function SetBitmapTexture (
	filename As String
) As Boolean
Parameters
filename
Type: System.String
[Missing <param name="filename"/> documentation for "M:Rhino.DocObjects.Material.SetBitmapTexture(System.String)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.DocObjects.Material.SetBitmapTexture(System.String)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 7.0
See Also
Reference
Material Class
SetBitmapTexture Overload
Rhino.DocObjects Namespace