RhinoCommon API
ArchivableDictionary Constructor
Initializes an instance of a dictionary for writing to a 3dm archive.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ArchivableDictionary()
Public Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ArchivableDictionary Class
ArchivableDictionary Overload
Rhino.Collections Namespace