RhinoCommon API
RhinoAccountsServerNotReachableException Constructor (Exception)
 Generates a new instance of the exception.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoAccountsServerNotReachableException(
	Exception innerException = null
)
Public Sub New (
	Optional innerException As Exception = Nothing
)
Parameters
innerException (Optional)
Type: System.Exception
The inner exception.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoAccountsServerNotReachableException Class
RhinoAccountsServerNotReachableException Overload
Rhino.Runtime.RhinoAccounts Namespace