RhinoCommon SDK
SubD.GetFacesEnumerable Method
[Missing <summary> documentation for "M:Rhino.Geometry.SubD.GetFacesEnumerable"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public SubDFacesIterator GetFacesEnumerable()
Public Function GetFacesEnumerable As SubDFacesIterator
Return Value
Type: SubDFacesIterator
[Missing <returns> documentation for "M:Rhino.Geometry.SubD.GetFacesEnumerable"]
See Also
Reference
SubD Class
Rhino.Geometry Namespace