RhinoCommon API
RenderWindow.ChannelGPU.TextureHandle Method
 Return the channel's texture handle.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public uint TextureHandle()
Public Function TextureHandle As UInteger
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.TextureHandle"]
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace