RhinoCommon API
Utilities.ShowContentChooser Method (Guid, Guid, RenderContentKind, Guid, RenderContent.ShowContentChooserFlags, RhinoDoc)
 Shows the content chooser to allow the user to select a new or existing content.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.25
Syntax
public static Utilities.ShowContentChooserResults ShowContentChooser(
	Guid defaultType,
	Guid defaultInstanceId,
	RenderContentKind kinds,
	ref Guid instanceIdOut,
	RenderContent.ShowContentChooserFlags flags,
	RhinoDoc doc
)
Public Shared Function ShowContentChooser (
	defaultType As Guid,
	defaultInstanceId As Guid,
	kinds As RenderContentKind,
	ByRef instanceIdOut As Guid,
	flags As RenderContent.ShowContentChooserFlags,
	doc As RhinoDoc
) As Utilities.ShowContentChooserResults
Parameters
defaultType
Type: System.Guid
The content type that will be initially selected in the 'New' tab.
defaultInstanceId
Type: System.Guid
The content instance that will be initially selected in the 'Existing' tab.
kinds
Type: Rhino.Render.RenderContentKind
Semicolon-delimited string specifying which content kinds will be displayed.
instanceIdOut
Type: System.Guid
The UUID of the chosen item. Depending on eRhRdkSccResult, this can be the type id of a content type or the instance id of an existing content.
flags
Type: Rhino.Render.RenderContent.ShowContentChooserFlags
Flags controlling the chooser. Multiple selection is not valid for this call.
doc
Type: Rhino.RhinoDoc
A Rhino document.
Return Value
Type: Utilities.ShowContentChooserResults
The result of displaying the chooser.
See Also
Reference
Utilities Class
ShowContentChooser Overload
Rhino.Render Namespace