RhinoCommon SDK
TextStyleTable.FindFont Method
 Returns the array index of the style with id == FontId or -1 if not found
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int FindFont(
	Guid fontId
)
Public Function FindFont (
	fontId As Guid
) As Integer
Parameters
fontId
Type: System.Guid
Style to find
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.TextStyleTable.FindFont(System.Guid)"]
See Also
Reference
TextStyleTable Class
Rhino.DocObjects.Tables Namespace