RhinoCommon API
RenderWindow.ChannelEx Constructor
Initializes a new instance of the RenderWindow.ChannelEx class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ChannelEx(
	IntPtr p
)
Public Sub New (
	p As IntPtr
)
Parameters
p
Type: System.IntPtr
[Missing <param name="p"/> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.#ctor(System.IntPtr)"]
See Also
Reference
RenderWindow.ChannelEx Class
Rhino.Render Namespace