RhinoCommon API
Channel.Dispose Method
Releases all resources used by the Channel
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
Channel Class
Rhino.Render.PostEffects Namespace