RhinoCommon API
RenderPipeline.SupportsPause Method
 Override and return true if the renderer supports pausing
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool SupportsPause()
Public Overridable Function SupportsPause As Boolean
Return Value
Type: Boolean
true if pausing is supported, false otherwise
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace