RhinoCommon API
Rectangle3d Constructor (Plane, Interval, Interval)
 Initializes a new rectangle from dimensions.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle3d(
	Plane plane,
	Interval width,
	Interval height
)
Public Sub New (
	plane As Plane,
	width As Interval,
	height As Interval
)
Parameters
plane
Type: Rhino.Geometry.Plane
Base plane for Rectangle.
width
Type: Rhino.Geometry.Interval
Dimension of rectangle along the base plane x-axis.
height
Type: Rhino.Geometry.Interval
Dimension of rectangle along the base plane y-axis.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rectangle3d Structure
Rectangle3d Overload
Rhino.Geometry Namespace