RhinoCommon API
IDialogService.WrapAsIWin32Window Method
[Missing <summary> documentation for "M:Rhino.UI.IDialogService.WrapAsIWin32Window(System.IntPtr)"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Object WrapAsIWin32Window(
	IntPtr handle
)
Function WrapAsIWin32Window (
	handle As IntPtr
) As Object
Parameters
handle
Type: System.IntPtr
[Missing <param name="handle"/> documentation for "M:Rhino.UI.IDialogService.WrapAsIWin32Window(System.IntPtr)"]
Return Value
Type: Object
[Missing <returns> documentation for "M:Rhino.UI.IDialogService.WrapAsIWin32Window(System.IntPtr)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
IDialogService Interface
Rhino.UI Namespace