RhinoCommon API
RhinoDoc.Load Method
 Loads a 3DM file into a new headless RhinoDoc. Load is different than New in that load sets the document path
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RhinoDoc Load(
	string file3dmPath
)
Public Shared Function Load (
	file3dmPath As String
) As RhinoDoc
Parameters
file3dmPath
Type: System.String
 Path of a Rhino model to load.
Return Value
Type: RhinoDoc
[Missing <returns> documentation for "M:Rhino.RhinoDoc.Load(System.String)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace