RhinoCommon API
LinetypeTable.Undelete Method
Restores a linetype that has been deleted.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Undelete(
	int index
)
Public Function Undelete (
	index As Integer
) As Boolean
Parameters
index
Type: System.Int32
A linetype index to be undeleted.
Return Value
Type: Boolean
true if successful.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace