RhinoCommon API
PlugIn.ObjectPropertiesPages Method (List<ObjectPropertiesPage>)
 Override this function is you want to extend the object properties dialog
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual void ObjectPropertiesPages(
	List<ObjectPropertiesPage> pages
)
Protected Overridable Sub ObjectPropertiesPages (
	pages As List(Of ObjectPropertiesPage)
)
Parameters
pages
Type: System.Collections.Generic.List<ObjectPropertiesPage>
[Missing <param name="pages"/> documentation for "M:Rhino.PlugIns.PlugIn.ObjectPropertiesPages(System.Collections.Generic.List{Rhino.UI.ObjectPropertiesPage})"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 7.0
See Also
Reference
PlugIn Class
ObjectPropertiesPages Overload
Rhino.PlugIns Namespace