RhinoCommon API
GetContextArgs.SetPoint Method
[Missing <summary> documentation for "M:Rhino.Input.Custom.GetContextArgs.SetPoint(Rhino.Geometry.Point3d)"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetPoint(
	Point3d point
)
Public Sub SetPoint (
	point As Point3d
)
Parameters
point
Type: Rhino.Geometry.Point3d
[Missing <param name="point"/> documentation for "M:Rhino.Input.Custom.GetContextArgs.SetPoint(Rhino.Geometry.Point3d)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetContextArgs Class
Rhino.Input.Custom Namespace