RhinoCommon API
BinaryArchiveReader.ReadVector3d Method
 Reads a Vector3d from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d ReadVector3d()
Public Function ReadVector3d As Vector3d
Return Value
Type: Vector3d
The element that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace