RhinoCommon API
ObjectTable.AddArc Method (Arc, ObjectAttributes)
Adds a curve object to the document representing an arc.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddArc(
	Arc arc,
	ObjectAttributes attributes
)
Public Function AddArc (
	arc As Arc,
	attributes As ObjectAttributes
) As Guid
Parameters
arc
Type: Rhino.Geometry.Arc
An arc value.
attributes
Type: Rhino.DocObjects.ObjectAttributes
Attributes to apply to arc.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectTable Class
AddArc Overload
Rhino.DocObjects.Tables Namespace