RhinoCommon API
GetContextCallback Constructor
Initializes a new instance of the GetContextCallback class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected GetContextCallback()
Protected Sub New
See Also
Reference
GetContextCallback Class
Rhino.Input.Custom Namespace