RhinoCommon API
Extrusion.GetMesh Method
 Obtains a reference to a specified type of mesh for this extrusion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Mesh GetMesh(
	MeshType meshType
)
Public Function GetMesh (
	meshType As MeshType
) As Mesh
Parameters
meshType
Type: Rhino.Geometry.MeshType
The mesh type.
Return Value
Type: Mesh
A mesh.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace