RhinoCommon API
GripsDrawEventArgs.GripStatus Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Custom.GripsDrawEventArgs.GripStatus(System.Int32)"]
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GripStatus GripStatus(
	int index
)
Public Function GripStatus (
	index As Integer
) As GripStatus
Parameters
index
Type: System.Int32
[Missing <param name="index"/> documentation for "M:Rhino.DocObjects.Custom.GripsDrawEventArgs.GripStatus(System.Int32)"]
Return Value
Type: GripStatus
[Missing <returns> documentation for "M:Rhino.DocObjects.Custom.GripsDrawEventArgs.GripStatus(System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GripsDrawEventArgs Class
Rhino.DocObjects.Custom Namespace