RhinoCommon API
PostEffectPlugIn.UUID Method
 Return The unique identifier of this PEP.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Guid UUID()
Public MustOverride Function UUID As Guid
Return Value
Type: Guid
PEP uuid
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace