RhinoCommon API
BinaryArchiveReader.ReadIntArray Method
 Reads an array of Int32 from the archive.
An array is returned even if the input was another enumerable type.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int[] ReadIntArray()
Public Function ReadIntArray As Integer()
Return Value
Type: Int32[]
The array that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace