RhinoCommon API
Color4f Constructor (Color)
Initializes a new instance of the Color4f class
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color4f(
	Color color
)
Public Sub New (
	color As Color
)
Parameters
color
Type: System.Drawing.Color
[Missing <param name="color"/> documentation for "M:Rhino.Display.Color4f.#ctor(System.Drawing.Color)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Color4f Structure
Color4f Overload
Rhino.Display Namespace