RhinoCommon API
RenderContent.GetUnderlyingInstances Method
[Missing <summary> documentation for "M:Rhino.Render.RenderContent.GetUnderlyingInstances(Rhino.Render.RenderContentCollection@)"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetUnderlyingInstances(
	ref RenderContentCollection collection
)
Public Function GetUnderlyingInstances (
	ByRef collection As RenderContentCollection
) As Boolean
Parameters
collection
Type: Rhino.Render.RenderContentCollection
[Missing <param name="collection"/> documentation for "M:Rhino.Render.RenderContent.GetUnderlyingInstances(Rhino.Render.RenderContentCollection@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.RenderContent.GetUnderlyingInstances(Rhino.Render.RenderContentCollection@)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderContent Class
Rhino.Render Namespace