RhinoCommon SDK
Dialogs.ShowMessageBox Method (String, String, ShowMessageBoxButton, ShowMessageBoxIcon)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static ShowMessageBoxResult ShowMessageBox(
	string message,
	string title,
	ShowMessageBoxButton buttons,
	ShowMessageBoxIcon icon
)
Public Shared Function ShowMessageBox (
	message As String,
	title As String,
	buttons As ShowMessageBoxButton,
	icon As ShowMessageBoxIcon
) As ShowMessageBoxResult
Parameters
message
Type: System.String
Message box text content.
title
Type: System.String
Message box title text.
buttons
Type: Rhino.UI.ShowMessageBoxButton
Which buttons to display in the message box.
icon
Type: Rhino.UI.ShowMessageBoxIcon
Which icon to display in the message box.
Return Value
Type: ShowMessageBoxResult
One of the ShowMessageBoxResult values.
See Also
Reference
Dialogs Class
ShowMessageBox Overload
Rhino.UI Namespace