RhinoCommon SDK
LinearDimensionObject.DisplayHelper Method
[Missing <summary> documentation for "M:Rhino.DocObjects.LinearDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Point2d[]@,Rhino.Geometry.Vector2d[]@)"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Line[] DisplayHelper(
	ViewportInfo viewport,
	Transform modelTransform,
	out Point2d[] arrowHeadTips,
	out Vector2d[] arrowheadDirections
)
Public Function DisplayHelper (
	viewport As ViewportInfo,
	modelTransform As Transform,
	<OutAttribute> ByRef arrowHeadTips As Point2d(),
	<OutAttribute> ByRef arrowheadDirections As Vector2d()
) As Line()
Parameters
viewport
Type: Rhino.DocObjects.ViewportInfo
modelTransform
Type: Rhino.Geometry.Transform
arrowHeadTips
Type: Rhino.Geometry.Point2d[]
arrowheadDirections
Type: Rhino.Geometry.Vector2d[]
Return Value
Type: Line[]
[Missing <returns> documentation for "M:Rhino.DocObjects.LinearDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Point2d[]@,Rhino.Geometry.Vector2d[]@)"]
See Also
Reference
LinearDimensionObject Class
Rhino.DocObjects Namespace