RhinoCommon API
CurveList Constructor (Int32)
 Initializes a new empty list of curves with a predefined capacity.
This is the amount of items the list will accept before resizing.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public CurveList(
	int initialCapacity
)
Public Sub New (
	initialCapacity As Integer
)
Parameters
initialCapacity
Type: System.Int32
[Missing <param name="initialCapacity"/> documentation for "M:Rhino.Collections.CurveList.#ctor(System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CurveList Class
CurveList Overload
Rhino.Collections Namespace