RhinoCommon API
RdkUndoRecord.SetDescription Method
 Set description for RdkUndoRecord
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetDescription(
	string description
)
Public Sub SetDescription (
	description As String
)
Parameters
description
Type: System.String
[Missing <param name="description"/> documentation for "M:Rhino.Render.RdkUndoRecord.SetDescription(System.String)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RdkUndoRecord Class
Rhino.Render Namespace