RhinoCommon API
DracoCompression.Compress Method (Mesh)
 Compress a mesh using default compression options.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static DracoCompression Compress(
	Mesh mesh
)
Public Shared Function Compress (
	mesh As Mesh
) As DracoCompression
Parameters
mesh
Type: Rhino.Geometry.Mesh
mesh to compress
Return Value
Type: DracoCompression
instance of class representing the compressed data
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DracoCompression Class
Compress Overload
Rhino.FileIO Namespace