RhinoCommon API
ChannelDataCollection.Append Method
[Missing <summary> documentation for "M:Rhino.Render.PostEffects.ChannelDataCollection.Append(Rhino.Render.PostEffects.ChannelData)"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Append(
	ChannelData channel_data
)
Public Sub Append (
	channel_data As ChannelData
)
Parameters
channel_data
Type: Rhino.Render.PostEffects.ChannelData
[Missing <param name="channel_data"/> documentation for "M:Rhino.Render.PostEffects.ChannelDataCollection.Append(Rhino.Render.PostEffects.ChannelData)"]
See Also
Reference
ChannelDataCollection Class
Rhino.Render.PostEffects Namespace