RhinoCommon API
EarlyPostEffectPlugIn.DisplayHelp Method
 Displays the PEP's help page, if any.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool DisplayHelp()
Public MustOverride Function DisplayHelp As Boolean
Return Value
Type: Boolean
 Return true if successful, else false.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
EarlyPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace