RhinoCommon API
Mesh.CreateFromFilteredFaceList Method
 Constructs a sub-mesh, that contains a filtered list of faces.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static Mesh CreateFromFilteredFaceList(
	Mesh original,
	IEnumerable<bool> inclusion
)
Public Shared Function CreateFromFilteredFaceList (
	original As Mesh,
	inclusion As IEnumerable(Of Boolean)
) As Mesh
Parameters
original
Type: Rhino.Geometry.Mesh
The mesh to copy. This item can be null, and in this case an empty mesh is returned.
inclusion
Type: System.Collections.Generic.IEnumerable<Boolean>
A series of true and false values, that determine if each face is used in the new mesh.
If the amount does not match the length of the face list, the pattern is repeated. If it exceeds the amount of faces in the mesh face list, the pattern is truncated. This items can be null or empty, and the mesh will simply be duplicated.
Return Value
Type: Mesh
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.CreateFromFilteredFaceList(Rhino.Geometry.Mesh,System.Collections.Generic.IEnumerable{System.Boolean})"]
See Also
Reference
Mesh Class
Rhino.Geometry Namespace