RhinoCommon API
ArchivableDictionary Constructor (Int32)
Initializes an instance of a dictionary for writing to a 3dm archive.
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ArchivableDictionary(
	int version
)
Public Sub New (
	version As Integer
)
Parameters
version
Type: System.Int32
 Custom version used to help the plug-in developer determine which version of a dictionary is being written. One good way to write version information is to use a date style integer (YYYYMMDD)
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ArchivableDictionary Class
ArchivableDictionary Overload
Rhino.Collections Namespace