RhinoCommon API
Circle.Transform Method
 Transforms this circle using an xform matrix.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Transform(
	Transform xform
)
Public Function Transform (
	xform As Transform
) As Boolean
Parameters
xform
Type: Rhino.Geometry.Transform
Transformation to apply.
Return Value
Type: Boolean
true on success, false on failure.
Remarks
 Circles may not be transformed accurately if the xform defines a non-euclidian transformation.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Circle Structure
Rhino.Geometry Namespace