RhinoCommon API
SupportOptions.UseQuickInitialPreview Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.UseQuickInitialPreview"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool UseQuickInitialPreview()
Public Shared Function UseQuickInitialPreview As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.UseQuickInitialPreview"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SupportOptions Class
Rhino.Render Namespace