RhinoCommon API
ModelComponent.ClearIndex Method
 Resets the HasIndex property of the model component to false, if possible.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void ClearIndex()
Public Sub ClearIndex
Exceptions
Exception | Condition
InvalidOperationException | If the index is locked.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace