RhinoCommon SDK
DisplayConduit Constructor
Initializes a new instance of the DisplayConduit class
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected DisplayConduit()
Protected Sub New
See Also
Reference
DisplayConduit Class
Rhino.Display Namespace