RhinoCommon API
StringWrapper.SetString Method
 Set contents of this string.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetString(
	string s
)
Public Sub SetString (
	s As String
)
Parameters
s
Type: System.String
The new string.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
StringWrapper Class
Rhino.Runtime.InteropWrappers Namespace