RhinoCommon API
RealtimeDisplayMode.HudMaximumPasses Method
 Override to communicate the maximum passes count currently in use for the render session. Can be shown in the HUD
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual int HudMaximumPasses()
Public Overridable Function HudMaximumPasses As Integer
Return Value
Type: Int32
Maximum passes
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace