RhinoCommon API
ViewSettings.GetCurrentState Method
 Gets the current settings.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ViewSettingsState GetCurrentState()
Public Shared Function GetCurrentState As ViewSettingsState
Return Value
Type: ViewSettingsState
A new view state with current settings.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace