RhinoCommon API
PostEffectState.Dispose Method
Releases all resources used by the PostEffectState
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectState Class
Rhino.Render.PostEffects Namespace