RhinoCommon API
ObjectTable.AddExtrusion Method (Extrusion)
Adds an extrusion object to Rhino.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddExtrusion(
	Extrusion extrusion
)
Public Function AddExtrusion (
	extrusion As Extrusion
) As Guid
Parameters
extrusion
Type: Rhino.Geometry.Extrusion
A duplicate of this extrusion is added to Rhino.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectTable Class
AddExtrusion Overload
Rhino.DocObjects.Tables Namespace