RhinoCommon API
RenderWindow.GetAdjust Method
Note: This API is now obsolete.
 Get an ImageAdjust instance containing current image adjusting settings for this RenderWindow
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
[ObsoleteAttribute("The Render Window UI uses post effects for gamma, tone mapping etc. now.")]
public RenderWindow.ImageAdjust GetAdjust()
<ObsoleteAttribute("The Render Window UI uses post effects for gamma, tone mapping etc. now.")>
Public Function GetAdjust As RenderWindow.ImageAdjust
Return Value
Type: RenderWindow.ImageAdjust
ImageAdjust
See Also
Reference
RenderWindow Class
Rhino.Render Namespace