RhinoCommon API
LatePostEffectPlugIn Constructor
Initializes a new instance of the LatePostEffectPlugIn class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LatePostEffectPlugIn()
Public Sub New
See Also
Reference
LatePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace