RhinoCommon API
RhinoObject.GetHighlightedSubObjects Method
 Gets a list of all highlighted sub-objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ComponentIndex[] GetHighlightedSubObjects()
Public Function GetHighlightedSubObjects As ComponentIndex()
Return Value
Type: ComponentIndex[]
An array of all highlighted sub-objects; or null is there are none.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace