RhinoCommon API
SimpleArrayMeshPointer.ConstPointer Method
 Gets the constant (immutable) pointer of this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
The constant pointer.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
SimpleArrayMeshPointer Class
Rhino.Runtime.InteropWrappers Namespace