RhinoCommon API
HermiteSurface.ConstPointer Method
 Gets the const (immutable) pointer of this class.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr ConstPointer()
Public Function ConstPointer As IntPtr
Return Value
Type: IntPtr
The const pointer.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace