RhinoCommon API
LatePostEffectPlugInArray.Dispose Method
Releases all resources used by the LatePostEffectPlugInArray
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
LatePostEffectPlugInArray Class
Rhino.Render.PostEffects Namespace