RhinoCommon API
RenderWindow.ChannelEx.Width Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.Width"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Width()
Public Function Width As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelEx.Width"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderWindow.ChannelEx Class
Rhino.Render Namespace