RhinoCommon API
File3dmObjectTable.AddSphere Method (Sphere)
 Adds a surface object to the document representing a sphere.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid AddSphere(
	Sphere sphere
)
Public Function AddSphere (
	sphere As Sphere
) As Guid
Parameters
sphere
Type: Rhino.Geometry.Sphere
A sphere to add.
Return Value
Type: Guid
A unique identifier for the object.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmObjectTable Class
AddSphere Overload
Rhino.FileIO Namespace