RhinoCommon API
RhinoPageView.GetDetailViews Method
 Gets a list of the detail view objects associated with this layout.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DetailViewObject[] GetDetailViews()
Public Function GetDetailViews As DetailViewObject()
Return Value
Type: DetailViewObject[]
A detail view object array. This can be null, but not empty.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace