RhinoCommon API
SimpleArrayGeometryPointer.Dispose Method
 Actively reclaims unmanaged resources that this instance uses.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
SimpleArrayGeometryPointer Class
Dispose Overload
Rhino.Runtime.InteropWrappers Namespace