RhinoCommon API
SupportOptions.ShowDocuments Method
[Missing <summary> documentation for "M:Rhino.Render.SupportOptions.ShowDocuments"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static bool ShowDocuments()
Public Shared Function ShowDocuments As Boolean
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Render.SupportOptions.ShowDocuments"]
See Also
Reference
SupportOptions Class
Rhino.Render Namespace