RhinoCommon API
Interval.Reverse Method
 Changes interval to [-T1, -T0].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Reverse()
Public Sub Reverse
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Interval Structure
Rhino.Geometry Namespace