RhinoCommon API
ObjRef.Trim Method
 If the referenced geometry is an edge of a surface, this returns the associated brep trim.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepTrim Trim()
Public Function Trim As BrepTrim
Return Value
Type: BrepTrim
A boundary representation trim; or null on error
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace