RhinoCommon API
GroupTable.GroupObjectCount Method
[Missing <summary> documentation for "M:Rhino.DocObjects.Tables.GroupTable.GroupObjectCount(System.Int32)"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int GroupObjectCount(
	int groupIndex
)
Public Function GroupObjectCount (
	groupIndex As Integer
) As Integer
Parameters
groupIndex
Type: System.Int32
[Missing <param name="groupIndex"/> documentation for "M:Rhino.DocObjects.Tables.GroupTable.GroupObjectCount(System.Int32)"]
Return Value
Type: Int32
[Missing <returns> documentation for "M:Rhino.DocObjects.Tables.GroupTable.GroupObjectCount(System.Int32)"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace