RhinoCommon API
PostEffectPipeline.PostEffects Method
 Returns a list of the post effects to be executed by this pipeline in order.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SimpleArrayGuid PostEffects()
Public Function PostEffects As SimpleArrayGuid
Return Value
Type: SimpleArrayGuid
A list of the post effects to be executed by this pipeline in order
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace