RhinoCommon API
PostEffectPlugIn Constructor
Initializes a new instance of the PostEffectPlugIn class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PostEffectPlugIn()
Public Sub New
See Also
Reference
PostEffectPlugIn Class
PostEffectPlugIn Overload
Rhino.Render.PostEffects Namespace