RhinoCommon API
Mesh.GetSelfIntersections Method
 Gets the self intersections of this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool GetSelfIntersections(
	double tolerance,
	out Polyline[] intersections,
	bool overlapsPolylines,
	out Polyline[] overlapsPolylinesResult,
	bool overlapsMesh,
	out Mesh overlapsMeshResult,
	TextLog textLog,
	CancellationToken cancel,
	IProgress<double> progress
)
Public Function GetSelfIntersections (
	tolerance As Double,
	<OutAttribute> ByRef intersections As Polyline(),
	overlapsPolylines As Boolean,
	<OutAttribute> ByRef overlapsPolylinesResult As Polyline(),
	overlapsMesh As Boolean,
	<OutAttribute> ByRef overlapsMeshResult As Mesh,
	textLog As TextLog,
	cancel As CancellationToken,
	progress As IProgress(Of Double)
) As Boolean
Parameters
tolerance
Type: System.Double
[Missing <param name="tolerance"/> documentation for "M:Rhino.Geometry.Mesh.GetSelfIntersections(System.Double,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Mesh@,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})"]
intersections
Type: Rhino.Geometry.Polyline[]
[Missing <param name="intersections"/> documentation for "M:Rhino.Geometry.Mesh.GetSelfIntersections(System.Double,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Mesh@,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})"]
overlapsPolylines
Type: System.Boolean
[Missing <param name="overlapsPolylines"/> documentation for "M:Rhino.Geometry.Mesh.GetSelfIntersections(System.Double,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Mesh@,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})"]
overlapsPolylinesResult
Type: Rhino.Geometry.Polyline[]
[Missing <param name="overlapsPolylinesResult"/> documentation for "M:Rhino.Geometry.Mesh.GetSelfIntersections(System.Double,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Mesh@,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})"]
overlapsMesh
Type: System.Boolean
[Missing <param name="overlapsMesh"/> documentation for "M:Rhino.Geometry.Mesh.GetSelfIntersections(System.Double,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Mesh@,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})"]
overlapsMeshResult
Type: Rhino.Geometry.Mesh
[Missing <param name="overlapsMeshResult"/> documentation for "M:Rhino.Geometry.Mesh.GetSelfIntersections(System.Double,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Mesh@,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})"]
textLog
Type: Rhino.FileIO.TextLog
[Missing <param name="textLog"/> documentation for "M:Rhino.Geometry.Mesh.GetSelfIntersections(System.Double,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Mesh@,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})"]
cancel
Type: System.Threading.CancellationToken
[Missing <param name="cancel"/> documentation for "M:Rhino.Geometry.Mesh.GetSelfIntersections(System.Double,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Mesh@,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})"]
progress
Type: System.IProgress<Double>
[Missing <param name="progress"/> documentation for "M:Rhino.Geometry.Mesh.GetSelfIntersections(System.Double,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Mesh@,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Geometry.Mesh.GetSelfIntersections(System.Double,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Mesh@,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Mesh Class
Rhino.Geometry Namespace