RhinoCommon API
LatePostEffectPlugIn.CanDisplayHelp Method
 Return true if the PEP can display a help page, else false.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool CanDisplayHelp()
Public MustOverride Function CanDisplayHelp As Boolean
Return Value
Type: Boolean
Return true if the PEP can display a help page, else false.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LatePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace