RhinoCommon API
LatePostEffectPlugIn.UsageFlags Method
 See PostEfectsPlugIn variables: uf_ProductionRendering uf_RealtimeRendering uf_ViewportDisplay
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract uint UsageFlags()
Public MustOverride Function UsageFlags As UInteger
Return Value
Type: UInt32
returns the usageflags
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LatePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace