RhinoCommon API
ToneMappingPostEffectPlugIn.SetParam Method
 Set a parameter.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract bool SetParam(
	string param,
	Object var
)
Public MustOverride Function SetParam (
	param As String,
	var As Object
) As Boolean
Parameters
param
Type: System.String
is the name of the parameter to set.
var
Type: System.Object
specifies the type and value to set.
Return Value
Type: Boolean
Return true if successful or false if the parameter could not be set.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ToneMappingPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace