RhinoCommon API
RhinoDoc.New Method
 Create a new headless RhinoDoc from a template file
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RhinoDoc New(
	string file3dmTemplatePath
)
Public Shared Function New (
	file3dmTemplatePath As String
) As RhinoDoc
Parameters
file3dmTemplatePath
Type: System.String
 Name of a Rhino model to use as a template to initialize the document. If null, an empty document is created
Return Value
Type: RhinoDoc
 New RhinoDoc on success. Note that this is a "headless" RhinoDoc and it's lifetime is under your control.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace