RhinoCommon API
EarlyPostEffectPlugInArray.Dispose Method
Releases all resources used by the EarlyPostEffectPlugInArray
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
EarlyPostEffectPlugInArray Class
Rhino.Render.PostEffects Namespace