RhinoCommon API
EarlyPostEffectPlugInArray Constructor (IntPtr)
Initializes a new instance of the EarlyPostEffectPlugInArray class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public EarlyPostEffectPlugInArray(
	IntPtr pArray
)
Public Sub New (
	pArray As IntPtr
)
Parameters
pArray
Type: System.IntPtr
[Missing <param name="pArray"/> documentation for "M:Rhino.Render.PostEffects.EarlyPostEffectPlugInArray.#ctor(System.IntPtr)"]
See Also
Reference
EarlyPostEffectPlugInArray Class
EarlyPostEffectPlugInArray Overload
Rhino.Render.PostEffects Namespace