RhinoCommon API
Transform.Equality Operator
 Determines if two transformations are equal in value.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool operator ==(
	Transform a,
	Transform b
)
Public Shared Operator = (
	a As Transform,
	b As Transform
) As Boolean
Parameters
a
Type: Rhino.Geometry.Transform
A tranform.
b
Type: Rhino.Geometry.Transform
Another tranform.
Return Value
Type: Boolean
true if transforms are equal; otherwise false.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Transform Structure
Rhino.Geometry Namespace