RhinoCommon API
ColorCMYK Implicit Conversion (ColorCMYK to Color)
 Implicitly converts a CMYK color into a .Net library color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static implicit operator Color (
	ColorCMYK cmyk
)
Public Shared Widening Operator CType (
	cmyk As ColorCMYK
) As Color
Parameters
cmyk
Type: Rhino.Display.ColorCMYK
A CMYK color.
Return Value
Type: Color
A ARGB .Net library color.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ColorCMYK Structure
Rhino.Display Namespace