RhinoCommon API
RhinoDoc.Export Method
 Export the entire document to a file. All file formats that Rhino can export to are supported by this function.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Export(
	string filePath
)
Public Function Export (
	filePath As String
) As Boolean
Parameters
filePath
Type: System.String
[Missing <param name="filePath"/> documentation for "M:Rhino.RhinoDoc.Export(System.String)"]
Return Value
Type: Boolean
true on success
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace