RhinoCommon API
Rectangle3d.ClosestPoint Method (Point3d)
 Gets the point on the rectangle that is closest to a test-point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d ClosestPoint(
	Point3d point
)
Public Function ClosestPoint (
	point As Point3d
) As Point3d
Parameters
point
Type: Rhino.Geometry.Point3d
Point to project.
Return Value
Type: Point3d
The point on or in the rectangle closest to the test point or Point3d.Unset on failure.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rectangle3d Structure
ClosestPoint Overload
Rhino.Geometry Namespace