RhinoCommon API
RenderWindow.ChannelGPU.ApiType Method
[Missing <summary> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.ApiType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderWindow.ChannelGPU.ApiTypes ApiType()
Public Function ApiType As RenderWindow.ChannelGPU.ApiTypes
Return Value
Type: RenderWindow.ChannelGPU.ApiTypes
[Missing <returns> documentation for "M:Rhino.Render.RenderWindow.ChannelGPU.ApiType"]
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace