RhinoCommon API
MeshFaceNormalList.AddFaceNormal Method (Vector3d)
 Appends a face normal to the list of mesh face normals.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int AddFaceNormal(
	Vector3d normal
)
Public Function AddFaceNormal (
	normal As Vector3d
) As Integer
Parameters
normal
Type: Rhino.Geometry.Vector3d
New face normal.
Return Value
Type: Int32
The index of the newly added face normal.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshFaceNormalList Class
AddFaceNormal Overload
Rhino.Geometry.Collections Namespace