RhinoCommon SDK
TwistSpaceMorph Constructor
 Constructs a twist space morph.
Namespace: Rhino.Geometry.Morphs
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TwistSpaceMorph()
Public Sub New
See Also
Reference
TwistSpaceMorph Class
Rhino.Geometry.Morphs Namespace