RhinoCommon API
Decal.TextureRenderCRC Method (TextureRenderHashFlags, LinearWorkflow)
 Get the texture render CRC for the referenced texture using the TextureRenderHashFlags given along with the LinearWorkflow
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public uint TextureRenderCRC(
	TextureRenderHashFlags rh,
	LinearWorkflow lw
)
Public Function TextureRenderCRC (
	rh As TextureRenderHashFlags,
	lw As LinearWorkflow
) As UInteger
Parameters
rh
Type: Rhino.Render.TextureRenderHashFlags
[Missing <param name="rh"/> documentation for "M:Rhino.Render.Decal.TextureRenderCRC(Rhino.Render.TextureRenderHashFlags,Rhino.Render.LinearWorkflow)"]
lw
Type: Rhino.Render.LinearWorkflow
[Missing <param name="lw"/> documentation for "M:Rhino.Render.Decal.TextureRenderCRC(Rhino.Render.TextureRenderHashFlags,Rhino.Render.LinearWorkflow)"]
Return Value
Type: UInt32
[Missing <returns> documentation for "M:Rhino.Render.Decal.TextureRenderCRC(Rhino.Render.TextureRenderHashFlags,Rhino.Render.LinearWorkflow)"]
See Also
Reference
Decal Class
TextureRenderCRC Overload
Rhino.Render Namespace