RhinoCommon SDK
MouseCallback.OnBeginMouseUp Method
 Called at the beginning of handling of a mouse up event in Rhino. If you don't want the default Rhino functionality to be run, then set Cancel to true on the passed in event args Base class implementation of this function does nothing
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
protected virtual void OnBeginMouseUp(
	MouseCallbackEventArgs e
)
Protected Overridable Sub OnBeginMouseUp (
	e As MouseCallbackEventArgs
)
Parameters
e
Type: Rhino.UI.MouseCallbackEventArgs
[Missing <param name="e"/> documentation for "M:Rhino.UI.MouseCallback.OnBeginMouseUp(Rhino.UI.MouseCallbackEventArgs)"]
See Also
Reference
MouseCallback Class
Rhino.UI Namespace