RhinoCommon API
FileExportPlugIn Constructor
Initializes a new instance of the FileExportPlugIn class
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected FileExportPlugIn()
Protected Sub New
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileExportPlugIn Class
Rhino.PlugIns Namespace