RhinoCommon SDK
Mesh.ComputeAutoCreaseInformation Method
 Do not use this method. Length: top.Mesh.Vertices.Count
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public byte[] ComputeAutoCreaseInformation()
Public Function ComputeAutoCreaseInformation As Byte()
Return Value
Type: Byte[]
An array that is bound to change.
See Also
Reference
Mesh Class
Rhino.Geometry Namespace