RhinoCommon API
PostEffectPlugIn.WriteToDocumentDefaults Method
 Write the state to document defaults. This is implemented by RDK to call WriteState() so usually a PEP only has to implement WriteState(). However, a PEP can override this method to take complete control of how the document defaults are written.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool WriteToDocumentDefaults(
	RhinoDoc doc
)
Public Overridable Function WriteToDocumentDefaults (
	doc As RhinoDoc
) As Boolean
Parameters
doc
Type: Rhino.RhinoDoc
Rhino document
Return Value
Type: Boolean
Return true if write was succesful
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace