RhinoCommon API
NamedParametersEventArgs.TryGetHatchObjects Method
[Missing <summary> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetHatchObjects(System.String,System.Collections.Generic.List{Rhino.DocObjects.HatchObject}@)"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TryGetHatchObjects(
	string name,
	out List<HatchObject> value
)
Public Function TryGetHatchObjects (
	name As String,
	<OutAttribute> ByRef value As List(Of HatchObject)
) As Boolean
Parameters
name
Type: System.String
[Missing <param name="name"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetHatchObjects(System.String,System.Collections.Generic.List{Rhino.DocObjects.HatchObject}@)"]
value
Type: System.Collections.Generic.List<HatchObject>
[Missing <param name="value"/> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetHatchObjects(System.String,System.Collections.Generic.List{Rhino.DocObjects.HatchObject}@)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Rhino.Runtime.NamedParametersEventArgs.TryGetHatchObjects(System.String,System.Collections.Generic.List{Rhino.DocObjects.HatchObject}@)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace