RhinoCommon API
BinaryArchiveReader.ReadUInt Method
 Reads a UInt32 from the archive.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint ReadUInt()
Public Function ReadUInt As UInteger
Return Value
Type: UInt32
The value that was read.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BinaryArchiveReader Class
Rhino.FileIO Namespace