RhinoCommon API
PlugIn.LoadComputeExtensionPlugins Method
 Used by compute's startup code to load plugins that have registered custom endpoints
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static void LoadComputeExtensionPlugins()
Public Shared Sub LoadComputeExtensionPlugins
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace