RhinoCommon API
PostEffectPipeline.NewChannel Method
 Create a new channel for writing. A PEP will use this to get channel(s) to write the output of its processing to.Input will usually come from existing channels, although a PEP is free to read its own output channels if needed. \see GetChannel() You are allowed to create one new channel with the same identifier as an existing channel, in which case Commit() will replace the existing channel with the new one in the pipeline.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Channel NewChannel(
	Guid uuid,
	PostEffectPipeline.Init init,
	uint flags
)
Public Function NewChannel (
	uuid As Guid,
	init As PostEffectPipeline.Init,
	flags As UInteger
) As Channel
Parameters
uuid
Type: System.Guid
uuidChannel is the channel identifier.
init
Type: Rhino.Render.PostEffects.PostEffectPipeline.Init
init specifies how the new channel should be initialized.
flags
Type: System.UInt32
flags from the ncf_None ncf_File ncf_GPU specify options for the new channel.
Return Value
Type: Channel
 A pointer to the new channel or null if the channel could not be created.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace