RhinoCommon API
Pixels.Dispose Method
Releases all resources used by the Pixels
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void Dispose()
Public Sub Dispose
Implements
IDisposable.Dispose()
See Also
Reference
Pixels Class
Rhino.Render.PostEffects Namespace