RhinoCommon API
RhinoDoc.OpenHeadless Method
 Opens a 3DM file into a new headless RhinoDoc.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static RhinoDoc OpenHeadless(
	string file3dmPath
)
Public Shared Function OpenHeadless (
	file3dmPath As String
) As RhinoDoc
Parameters
file3dmPath
Type: System.String
 Path of a Rhino model to load.
Return Value
Type: RhinoDoc
[Missing <returns> documentation for "M:Rhino.RhinoDoc.OpenHeadless(System.String)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace