RhinoCommon API
GetPoint Constructor (String, Object)
Initializes a new instance of the GetPoint class
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public GetPoint(
	string contextName,
	Object contextObject
)
Public Sub New (
	contextName As String,
	contextObject As Object
)
Parameters
contextName
Type: System.String
[Missing <param name="contextName"/> documentation for "M:Rhino.Input.Custom.GetPoint.#ctor(System.String,System.Object)"]
contextObject
Type: System.Object
[Missing <param name="contextObject"/> documentation for "M:Rhino.Input.Custom.GetPoint.#ctor(System.String,System.Object)"]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetPoint Class
GetPoint Overload
Rhino.Input.Custom Namespace