RhinoCommon API
ObjectAttributes.SetClipParticipationForAll Method
 The object will participate in all clipping planes
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public void SetClipParticipationForAll()
Public Sub SetClipParticipationForAll
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace