RhinoCommon API
ChannelData Constructor (Guid, ComponentOrder)
Initializes a new instance of the ChannelData class
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ChannelData(
	Guid uuid,
	ComponentOrder co
)
Public Sub New (
	uuid As Guid,
	co As ComponentOrder
)
Parameters
uuid
Type: System.Guid
[Missing <param name="uuid"/> documentation for "M:Rhino.Render.PostEffects.ChannelData.#ctor(System.Guid,Rhino.Render.PostEffects.ComponentOrder)"]
co
Type: Rhino.Render.PostEffects.ComponentOrder
[Missing <param name="co"/> documentation for "M:Rhino.Render.PostEffects.ChannelData.#ctor(System.Guid,Rhino.Render.PostEffects.ComponentOrder)"]
See Also
Reference
ChannelData Class
ChannelData Overload
Rhino.Render.PostEffects Namespace