RhinoCommon API
RenderMaterial.BasicMaterialParameterNames Constructor
Initializes a new instance of the RenderMaterial.BasicMaterialParameterNames class
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BasicMaterialParameterNames()
Public Sub New
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderMaterial.BasicMaterialParameterNames Class
Rhino.Render Namespace