RhinoCommon API
PostEffectPlugIn.RequiredChannels Method
 The RDK calls this method to determine which channels a PEP requires. If a required channel is not available, the RDK will hide the PEP's UI and display explanatory text instead. Note: As a convenience, the default implementation adds IRhRdkRenderWindow::chanRGBA to the output array. Most PEPs should be able to use this default with no need to override the method.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual void RequiredChannels(
	SimpleArrayGuid channels
)
Public Overridable Sub RequiredChannels (
	channels As SimpleArrayGuid
)
Parameters
channels
Type: Rhino.Runtime.InteropWrappers.SimpleArrayGuid
aChan Accepts the channels.The PEP should add all channels used by its implementation to this array.
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace