RhinoCommon API
Rectangle3d Constructor (Plane, Point3d, Point3d)
 Initializes a new rectangle from a base plane and two corner points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Rectangle3d(
	Plane plane,
	Point3d cornerA,
	Point3d cornerB
)
Public Sub New (
	plane As Plane,
	cornerA As Point3d,
	cornerB As Point3d
)
Parameters
plane
Type: Rhino.Geometry.Plane
Base plane for Rectangle.
cornerA
Type: Rhino.Geometry.Point3d
First corner of Rectangle (will be projected onto plane).
cornerB
Type: Rhino.Geometry.Point3d
Second corner of Rectangle (will be projected onto plane).
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rectangle3d Structure
Rectangle3d Overload
Rhino.Geometry Namespace