RhinoCommon API
ToneMappingPostEffectPlugIn.LocalName Method
 Return The localized name of this PEP.
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract string LocalName()
Public MustOverride Function LocalName As String
Return Value
Type: String
PEP localized name
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ToneMappingPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace