RhinoCommon SDK
ObjRef.RichText Method
 Gets the text entity if the referenced geometry is one.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RichText RichText()
Public Function RichText As RichText
Return Value
Type: RichText
An RichText object or null if the referenced object is not RichText, or on error.
See Also
Reference
ObjRef Class
Rhino.DocObjects Namespace