RhinoCommon API
BrepLoop.To2dCurve Method
 Create a 2d curve that traces the entire loop
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve To2dCurve()
Public Function To2dCurve As Curve
Return Value
Type: Curve
[Missing <returns> documentation for "M:Rhino.Geometry.BrepLoop.To2dCurve"]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BrepLoop Class
Rhino.Geometry Namespace