RhinoCommon API
ViewportInfo Constructor (RhinoViewport)
 Copies all of the ViewportInfo data from an existing RhinoViewport.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewportInfo(
	RhinoViewport rhinoViewport
)
Public Sub New (
	rhinoViewport As RhinoViewport
)
Parameters
rhinoViewport
Type: Rhino.Display.RhinoViewport
A viewport to copy.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewportInfo Class
ViewportInfo Overload
Rhino.DocObjects Namespace