RhinoCommon API
Layer.GetChildren Method (Boolean)
 Gets immediate children of this layer. Note that child layers may have their own children.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 8.0
Syntax
public Layer[] GetChildren(
	bool sortAndCull
)
Public Function GetChildren (
	sortAndCull As Boolean
) As Layer()
Parameters
sortAndCull
Type: System.Boolean
 Set true to return results user-interface sorted order and culled of any filtered layers.
Return Value
Type: Layer[]
 Array of child layers, or null if this layer does not have any children.
See Also
Reference
Layer Class
GetChildren Overload
Rhino.DocObjects Namespace