RhinoCommon API
InstanceDefinitionGeometry.GetObjectIds Method
 list of object ids in the instance geometry table
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.6
Syntax
public Guid[] GetObjectIds()
Public Function GetObjectIds As Guid()
Return Value
Type: Guid[]
[Missing <returns> documentation for "M:Rhino.Geometry.InstanceDefinitionGeometry.GetObjectIds"]
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace