RhinoCommon API
EarlyPostEffectPlugIn Methods
The EarlyPostEffectPlugIn type exposes the following members.
Methods
Name | Description
AddUISections
 Create each of your UI sections using 'new' and then call ui.AddSection() on them. RDK takes ownership of the sections.If your post effect does not need a UI, then your implementation of this method can be a no-op.
CanDisplayHelp
 Return true if the PEP can display a help page, else false.
DisplayHelp
 Displays the PEP's help page, if any.
Dispose
Execute
 Execute the post effect.
ExecuteWhileRenderingOptions
 As rendering proceeds, in order for progress to be seen on the screen, small areas of the frame buffer that have been rendered are post-processed and written to an area of the dib which is then shown on the screen.Some PEPs will not be able to support this as they need the whole frame buffer in order to operate. This method allows a PEP to report whether or not it is able to support execution during rendering, and if so, when it should be done. See enum ExecuteWhileRenderingOptions.
GetParam
 Get a parameter.
LocalName
 Return The localized name of this PEP.
ReadState
 Read the state. If your PEP has no state, you must still return true for success.
ResetToFactoryDefaults
 Reset the state to factory defaults.
SetParam
 Set a parameter.
UsageFlags
 See PostEfectsPlugIn variables: uf_ProductionRendering uf_RealtimeRendering uf_ViewportDisplay
UUID
 Return The unique identifier of this PEP.
WriteState
 Write the state. If your PEP has no state, you must still return true for success.
Top
See Also
Reference
EarlyPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace