RhinoCommon API
SubDVertex Methods
The SubDVertex type exposes the following members.
Methods
Name | Description
EdgeAt
 Retrieve a SubDEdge from this vertex
FaceAt
 Retrieve a SubDFace from this vertex
SurfacePoint
 The SubD surface point
Top
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace