RhinoCommon API
ChannelEx Methods
The RenderWindow.ChannelEx type exposes the following members.
Methods
Name | Description
Clone
Finalize |  (Overrides Object.Finalize().)
GetMinMaxValues
GetValueEx
GetValueRect
Height
Id
Width
Top
See Also
Reference
RenderWindow.ChannelEx Class
Rhino.Render Namespace