RhinoCommon API
ComponentIndex Methods
The ComponentIndex type exposes the following members.
Methods
Name | Description
IsUnset
 Return true is this component index is the same as the Unset component index
Top
See Also
Reference
ComponentIndex Structure
Rhino.Geometry Namespace