RhinoCommon API
PostEffects Methods
The PostEffects type exposes the following members.
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
GetEarlyPostEffects
GetLatePostEffects
GetToneMappingPostEffects
PostEffectFromId
Top
See Also
Reference
PostEffects Class
Rhino.Render.PostEffects Namespace