RhinoCommon SDK
IntersectionEvent Methods
The IntersectionEvent type exposes the following members.
Methods
Name | Description
SurfaceOverlapParameter
 If this instance records a Curve|Surface intersection event, and the intersection type if overlap, then use this function to get the U and V domains on the surface where the overlap occurs.
SurfacePointParameter
 If this instance records a Curve|Surface intersection event, and the intersection type is point, then use this function to get the U and V parameters on the surface where the intersection occurs.
Top
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace