RhinoCommon SDK
Sun Methods
The Sun type exposes the following members.
Methods
Name | Description
Dispose
Finalize |  (Overrides Object.Finalize().)
GetDateTime
SetPosition(Double, Double)
 Sets position of the Sun based on azimuth and altitude values.
SetPosition(DateTime, Double, Double)
 Sets position of the sun based on physical location and time.
ShowDialog
Show the tabbed sun dialog.
SunDirection
Top
See Also
Reference
Sun Class
Rhino.Render Namespace