RhinoCommon API
Worksession Methods
The Worksession type exposes the following members.
Methods
Name | Description
FileNameFromRuntimeSerialNumber
 Returns the path to the open worksession, or .rws, file. If there is no worksession file open, or the active worksession has not yet been saved, then null is returned.
ModelPathFromSerialNumber
 Returns the path to a model, used by the worksession, given a reference model serial number
Top
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace