RhinoCommon SDK
TextStyleTable Methods
The TextStyleTable type exposes the following members.
Methods
Name | Description
FindFont
 Returns the array index of the style with id == FontId or -1 if not found
GetEnumerator
 for IEnumerable(TextStyle)
Top
See Also
Reference
TextStyleTable Class
Rhino.DocObjects.Tables Namespace