RhinoCommon API
FileStp Methods
The FileStp type exposes the following members.
Methods
Name | Description
Write
Write a STP file based on the contents of a RhinoDoc
Top
See Also
Reference
FileStp Class
Rhino.FileIO Namespace