RhinoCommon API
ChannelDataCollection Methods
The ChannelDataCollection type exposes the following members.
Methods
Name | Description
Append
At
Count
Dispose
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
ChannelDataCollection Class
Rhino.Render.PostEffects Namespace