RhinoCommon API
PostEffectFactory Methods
The PostEffectFactory type exposes the following members.
Methods
Name | Description
NewPostEffect
 Create the new PEP instance.
PlugInId
 Plugin id
Top
See Also
Reference
PostEffectFactory Class
Rhino.Render.PostEffects Namespace