RhinoCommon SDK
RLeader Methods
The RLeader type exposes the following members.
Methods
Name | Description
Create
 Creates a RLeader geometry object
Top
See Also
Reference
RLeader Class
Rhino.Geometry Namespace