RhinoCommon API
ParametersNames Methods
The PhysicallyBasedMaterial.ParametersNames type exposes the following members.
Methods
Name | Description
FromTextureType
Top
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace