RhinoCommon SDK
RichTextObject Methods
The RichTextObject type exposes the following members.
Methods
Name | Description
DuplicateTextGeometry
 Constructs a deep (full) copy of the RichText geometry.
Top
See Also
Reference
RichTextObject Class
Rhino.DocObjects Namespace