RhinoCommon SDK
SubDFacesIterator Methods
The SubDFacesIterator type exposes the following members.
Methods
Name | Description
GetEnumerator
Top
See Also
Reference
SubDFacesIterator Class
Rhino.Geometry Namespace