RhinoCommon API
ToneMappingPostEffectPlugInArray Methods
The ToneMappingPostEffectPlugInArray type exposes the following members.
Methods
Name | Description
Append
At
Count
Dispose
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
ToneMappingPostEffectPlugInArray Class
Rhino.Render.PostEffects Namespace