RhinoCommon SDK
MeshNgon Methods
The MeshNgon type exposes the following members.
Methods
Name | Description
BoundaryVertexIndexList
 Get the ngon's outer boundary mesh vertex list.
CompareTo
 Compares this MeshNgon with otherNgon and returns a value of 1, 0, or -1.
Priority is for vertex count, then face count, then vertex index list values, then face index list values.
Dispose
 Actively reclaims unmanaged resources that this instance uses.
Equals(Object)
 Determines if otherObj is a MeshNgon and is identical to this ngon.
 (Overrides Object.Equals(Object).)
Equals(MeshNgon)
 Determines if this ngon and otherNgon are identical.
FaceIndexList
 Get the ngon's mesh face index list.
Finalize
 Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
 (Overrides Object.Finalize().)
GetHashCode
 Returns a runtime-stable hashcode for the current mesh ngon. You are not allowed to rely on persistance of this hashcode in serialization, but for each instance of the application, this hashcode will be the same for ngons with identical vertex and face lists.
 (Overrides Object.GetHashCode().)
Set
 Set the ngon vertex and face index lists.
ToString
 Returns a string representation for this MeshNgon. This is to provide a meaningful visualization of this structure and is subject to change in newer releases.
 (Overrides Object.ToString().)
Top
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace