RhinoCommon SDK
CurveBlend Methods
The CurveBlend type exposes the following members.
Methods
Name | Description
CalcBlend
 Calculate the shape of the blend and make a curve to represent it
DrawBlend
 Draw the blend
HandlePoint
 Returns the location of a handle point of the blend
SetHandlePoint
 Set the location of a handle point on the blend
Top
See Also
Reference
CurveBlend Class
Rhino.Geometry Namespace