RhinoCommon API
PostEffectPlugIn Methods
The PostEffectPlugIn type exposes the following members.
Methods
Name | Description
AddUISections
 Create each of your UI sections using 'new' and then call ui.AddSection() on them. RDK takes ownership of the sections.If your post effect does not need a UI, then your implementation of this method can be a no-op.
CanDisplayHelp
 Return true if the PEP can display a help page, else false.
CanExecute
 Return true if the PEP can execute, else false. The default implementation checks if the PEP is 'On' and 'Shown'. PEP authors can override this to include other criteria but please be sure to call the base class.
CRC
 A CRC of the state of this PEP.
DisplayHelp
 Displays the PEP's help page, if any.
Execute
 Execute the post effect.
ExecuteWhileRenderingDelayMS
 If GetExecuteWhileRenderingOption() returns UseDelay then this method returns the delay in milliseconds before the PEP should execute for the first time.After the first time, the PEP will execute every time the dib is updated during rendering. see enum ExecuteWhileRenderingOptions.
GetExecuteWhileRenderingOptions
 As rendering proceeds, in order for progress to be seen on the screen, small areas of the frame buffer that have been rendered are post-processed and written to an area of the dib which is then shown on the screen.Some PEPs will not be able to support this as they need the whole frame buffer in order to operate. This method allows a PEP to report whether or not it is able to support execution during rendering, and if so, when it should be done. See enum ExecuteWhileRenderingOptions.
GetParam
 Get a parameter.
LocalName
 Return The localized name of this PEP.
ReadFromDocumentDefaults
 Read the state from document defaults. This is implemented by RDK to call ReadState() so usually a PEP only has to implement ReadState(). However, a PEP can override this method to take complete control of how the document defaults are read.
ReadState
 Read the state. If your PEP has no state, you must still return true for success.
RequiredChannels
 The RDK calls this method to determine which channels a PEP requires. If a required channel is not available, the RDK will hide the PEP's UI and display explanatory text instead. Note: As a convenience, the default implementation adds IRhRdkRenderWindow::chanRGBA to the output array. Most PEPs should be able to use this default with no need to override the method.
ResetToFactoryDefaults
 Reset the state to factory defaults.
SetParam
 Set a parameter.
SupportsHDRData
 Return true if the PEP can operate on HDR data (meaning channels containing values greater than 1).
UsageFlags
 See PostEfectsPlugIn variables: uf_ProductionRendering uf_RealtimeRendering uf_ViewportDisplay
UUID
 Return The unique identifier of this PEP.
WriteState
 Write the state. If your PEP has no state, you must still return true for success.
WriteToDocumentDefaults
 Write the state to document defaults. This is implemented by RDK to call WriteState() so usually a PEP only has to implement WriteState(). However, a PEP can override this method to take complete control of how the document defaults are written.
Top
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace