RhinoCommon API
ChannelData Methods
The ChannelData type exposes the following members.
Methods
Name | Description
CO
Dispose
Finalize |  (Overrides Object.Finalize().)
Id
Top
See Also
Reference
ChannelData Class
Rhino.Render.PostEffects Namespace