RhinoCommon API
SumSurface Methods
The SumSurface type exposes the following members.
Methods
Name | Description
Create
 Constructs a new sum surface by extruding a curve A along a path B.
Top
See Also
Reference
SumSurface Class
Rhino.Geometry Namespace