RhinoCommon API
SubD Methods
The SubD type exposes the following members.
Methods
Name | Description
ClearEvaluationCache
 Clear cached information that depends on the location of vertex control points
CreateFromMesh(Mesh)
 Create a new SubD from a mesh
CreateFromMesh(Mesh, SubDCreationOptions)
 Create a new SubD from a mesh
Dispose(Boolean)
 Deletes the underlying native pointer during a Dispose call or GC collection
 (Overrides GeometryBase.Dispose(Boolean).)
NonConstOperation
 Destroy cache handle
 (Overrides GeometryBase.NonConstOperation().)
OnSwitchToNonConst
 Called when this object switches from being considered "owned by the document" to being an independent instance.
 (Overrides GeometryBase.OnSwitchToNonConst().)
Subdivide
 Apply the Catmull-Clark subdivision algorithm and save the results in this SubD
ToBrep
 Create a Brep based on this SubD geometry
UpdateAllTagsAndSectorCoefficients
 Updates vertex tag, edge tag, and edge coefficient values on the active level. After completing custom editing operations that modify the topology of the SubD control net or changing values of vertex or edge tags, the tag and sector coefficients information on nearby components in the edited areas need to be updated.
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace