RhinoCommon SDK
GroupTable Methods
The GroupTable type exposes the following members.
Methods
Name | Description
Add()
Adds a new empty group to the group table.
Add(IEnumerable<Guid>)
 Adds a new group to the group table with a set of objects.
Add(String)
Adds a new empty group to the group table.
Add(String, IEnumerable<Guid>)
 Adds a new group to the group table with a set of objects.
AddToGroup(Int32, IEnumerable<Guid>)
 Adds a list of objects to an existing group.
AddToGroup(Int32, Guid)
 Adds an object to an existing group.
ChangeGroupName
Delete
 Deletes a group from this table.
Deleted groups are kept in the runtime group table so that undo will work with groups. Call IsDeleted() to determine if a group is deleted.
Find
Finds a group with a given name.
GroupMembers
 Gets an array of all of the objects in a group.
GroupName
GroupNames
GroupObjectCount
Hide
IsDeleted
Lock
Show
Undelete
Unlock
Top
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace