RhinoCommon API
GetContextArgs Methods
The GetContextArgs type exposes the following members.
Methods
Name | Description
SetGetResult
SetPoint
Top
See Also
Reference
GetContextArgs Class
Rhino.Input.Custom Namespace