RhinoCommon API
HatchObject Methods
The HatchObject type exposes the following members.
Methods
Name | Description
SetHatchGeometry
 Replaces a hatch object's underlying hatch geometry. This only works for non-document hatch objects.
Top
See Also
Reference
HatchObject Class
Rhino.DocObjects Namespace