RhinoCommon API
SweepTwoRail Methods
The SweepTwoRail type exposes the following members.
Methods
Name | Description
PerformSweep(Curve, Curve, Curve)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweep(Curve, Curve, IEnumerable<Curve>)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweep(Curve, Curve, Curve, Double, Double)
PerformSweep(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>)
PerformSweepRebuild(Curve, Curve, Curve, Int32)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRebuild(Curve, Curve, IEnumerable<Curve>, Int32)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRebuild(Curve, Curve, Curve, Double, Double, Int32)
PerformSweepRebuild(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>, Int32)
PerformSweepRefit(Curve, Curve, Curve, Double)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRefit(Curve, Curve, IEnumerable<Curve>, Double)
 Sweep2 function that fits a surface through profile curves that define the surface cross-sections and two curves that defines a surface edge.
PerformSweepRefit(Curve, Curve, Curve, Double, Double, Double)
PerformSweepRefit(Curve, Curve, IEnumerable<Curve>, IEnumerable<Double>, IEnumerable<Double>, Double)
Top
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace