RhinoCommon SDK
RenderEnvironment Methods
The RenderEnvironment type exposes the following members.
Methods
Name | Description
NewBasicEnvironment
 Constructs a new RenderEnvironment from a SimulatedEnvironment.
SimulateEnvironment(Boolean)
SimulateEnvironment(SimulatedEnvironment, Boolean)
Top
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace