RhinoCommon API
ChildSlotNames Methods
The RenderMaterial.PhysicallyBased.ChildSlotNames type exposes the following members.
Methods
Name | Description
FromTextureType
Top
See Also
Reference
RenderMaterial.PhysicallyBased.ChildSlotNames Class
Rhino.Render Namespace