RhinoCommon API
SubDEdge Methods
The SubDEdge type exposes the following members.
Methods
Name | Description
FaceAt
 Retrieve a SubDFace from this edge
ToNurbsCurve
 Get a cubic, uniform, non-rational, NURBS curve that is on the edge's limit curve.
Top
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace