RhinoCommon API
PostEffectPipeline Methods
The PostEffectPipeline type exposes the following members.
Methods
Name | Description
AllowGPU
 PEP authors should check that GPU use is allowed before using the GPU in a PEP.
Commit
 Commit changes to a new channel so that those changes can be used by subsequent PEPs in the chain. If the channel has the same id as an existing channel, the existing channel will be replaced by the new one.If the existing channel was created by a previous PEP in the chain, it will be deleted. Changes to channels that are not commited simply get ignored. This call merely sets a flag.The process is deferred until after the PEP has finished executing.
DateTimeStringEnd
 Formats the end time with the date and time using the user's control panel preferences.
DateTimeStringStart
 Formats the start time with the date and time using the user's control panel preferences.
Dimensions
 Get the dimensions of the frame buffer. All channels in the frame buffer have the same dimensions.
Dispose
ElapsedTimeString
 Formats the elapsed time (start to end) as days, hours, minutes and seconds.
Execute
 Execute the pipeline. This executes all the PEPs in order. Only this rectangle need be modified by the PEPs.
Finalize |  (Overrides Object.Finalize().)
FindPostEffect
 Return a pointer to the specified post effect or null if not found.
GetChannel
 Get a channel for reading. A PEP will use this to get channel data as input to its process.Output will be written to new channel(s). \see NewChannel()
GetEndTimeInMilliseconds
 Get the end time of the rendering expressed in milliseconds since some unspecified epoch. Do not make assumptions about what the epoch is; it might be different on different platforms.
GetMaxLuminance
 Get the max luminance in the rendering.
GetStartTimeInMilliseconds
 Get the start time of the rendering expressed in milliseconds since some unspecified epoch. Do not make assumptions about what the epoch is; it might be different on different platforms.
GetWatermarkText
 Get the watermark text set by the renderer (if any).
IsRendering
 IsRendering
NewChannel
 Create a new channel for writing. A PEP will use this to get channel(s) to write the output of its processing to.Input will usually come from existing channels, although a PEP is free to read its own output channels if needed. \see GetChannel() You are allowed to create one new channel with the same identifier as an existing channel, in which case Commit() will replace the existing channel with the new one in the pipeline.
PostEffects
 Returns a list of the post effects to be executed by this pipeline in order.
RenderingId
 Return a UUID that uniquely identifies the rendering being processed.
ReportProgress
 PEPs should call this during execution to report progress. A good strategy is to call this once per pixel row (or several rows). If the function returns \e false, your PEP should exit its pixel loop as the user has requested that the operation be canceled.
SetStartTimeInMilliseconds
 Set the start time of the rendering in milliseconds since some unspecified epoch.
ThreadEngine
Top
See Also
Reference
PostEffectPipeline Class
Rhino.Render.PostEffects Namespace