RhinoCommon API
DisplayPipelineAttributes Methods
The DisplayPipelineAttributes type exposes the following members.
Methods
Name | Description
Dispose()
Dispose(Boolean)
Finalize |  (Overrides Object.Finalize().)
GetFill
 Get fill colors used for clearing the frame buffer
GetObjectData
SetFill(Color)
 Set fill mode to solid color and set the fill color
SetFill(Color, Color)
 Set fill mode to two color and set the colors
SetFill(Color, Color, Color, Color)
 Set the fill mode to four color gradient and set the colors
Top
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace