RhinoCommon API
ChannelGPU Methods
The RenderWindow.ChannelGPU type exposes the following members.
Methods
Name | Description
ApiType
Clone
Close
CopyTo
Dispose
Finalize |  (Overrides Object.Finalize().)
Height
Id
PixelSize
TextureHandle
Width
Top
See Also
Reference
RenderWindow.ChannelGPU Class
Rhino.Render Namespace