RhinoCommon SDK
Texture Methods
The Texture type exposes the following members.
Methods
Name | Description
GetAlphaBlendValues
 If the TextureCombineMode is Blend, then the blending function for alpha is determined by
 new alpha = constant + a0*(current alpha) + a1*(texture alpha) + a2*min(current alpha,texture alpha) + a3*max(current alpha,texture alpha)
SetAlphaBlendValues
 If the TextureCombineMode is Blend, then the blending function for alpha is determined by
 new alpha = constant + a0*(current alpha) + a1*(texture alpha) + a2*min(current alpha,texture alpha) + a3*max(current alpha,texture alpha)
Top
See Also
Reference
Texture Class
Rhino.DocObjects Namespace