RhinoCommon API
Channel Methods
The Channel type exposes the following members.
Methods
Name | Description
Clone
Commit
CPU
CPU_Const
Dispose
Finalize |  (Overrides Object.Finalize().)
GPU
GPU_Const
Id
PixelSize
SetIsCommitable
WasCommit
Top
See Also
Reference
Channel Class
Rhino.Render.PostEffects Namespace