RhinoCommon API
SubDFaceList Methods
The SubDFaceList type exposes the following members.
Methods
Name | Description
Find(Int32)
 Find a face in this SubD with a given id
Find(UInt32)
 Find a face in this SubD with a given id
GetEnumerator
 Implementation of IEnumerable
Top
See Also
Reference
SubDFaceList Class
Rhino.Geometry.Collections Namespace