RhinoCommon API
RhinoCore Methods
The RhinoCore type exposes the following members.
Methods
Name | Description
Dispose
 IDisposable implementation
DoEvents
 If a Rhino owned window is active processes all Windows messages currently in the message queue.
DoIdle
 Processes all Rhino Idle tasks.
Finalize
 IDisposable implementation
 (Overrides Object.Finalize().)
OnIdle |  Obsolete.
 Dispatches Rhino Idle tasks
RaiseIdle
 Raises the Idle event.
Run
 Runs RhinoApp Message loop
Top
See Also
Reference
RhinoCore Class
Rhino.Runtime.InProcess Namespace