RhinoCommon API
BrepFace Methods
The BrepFace type exposes the following members.
Methods
Name | Description
AdjacentEdges
 Gets the indices of all the BrepEdges that delineate this Face.
AdjacentFaces
 Gets the indices of all the BrepFaces that surround (are adjacent to) this face.
ChangeSurface
 Expert user tool that replaces the 3d surface geometry use by the face.
CreateExtrusion
 Extrude a face in a Brep.
In Rhino for Windows, this member is overridden by Dispose(Boolean).
DraftAnglePoint
 Returns the surface draft angle and point at a parameter.
DuplicateFace
 Duplicate a face from the brep to create new single face brep.
DuplicateSurface
 Gets a copy to the untrimmed surface that this face is based on.
GetMesh
 Obtains a reference to a specified type of mesh for this brep face.
IsPointOnFace
 Tests if a parameter space point is on the interior of a trimmed face.
In Rhino for Windows, this member is overridden by NonConstOperation().
PullPointsToFace
 Pulls one or more points to a brep face.
RebuildEdges
 Rebuild the edges used by a face so they lie on the surface.
RemoveHoles
 Remove all inner loops, or holes, from a Brep face.
SetDomain
 Sets the surface domain of this face.
 (Overrides Surface.SetDomain(Int32, Interval).)
SetMesh
 Sets a reference to a specified type of mesh for this brep face.
ShrinkFace
 Shrinks the underlying untrimmed surface of this Brep face close to trimming boundaries. Shrinking a surface is like extending smoothly, only backwards. knot of full multiplicity are added where you want the surface to be cut off. Then the remaining control points are thrown away.
ShrinkSurfaceToEdge
 Shrinks the underlying untrimmed surface of this Brep face right to the trimming boundaries. Note, shrinking the trimmed surface can sometimes cause problems later since having the edges so close to the trimming boundaries can cause commands that use the surface edges as input to fail.
Split(IEnumerable<Curve>, Double)
 Split this face using 3D trimming curves.
TrimAwareIsoCurve
 Similar to IsoCurve function, except this function pays attention to trims on faces and may return multiple curves.
TrimAwareIsoIntervals
 Gets intervals where the iso curve exists on a BrepFace (trimmed surface)
UnderlyingSurface
 Gets the untrimmed surface that is the base of this face.
Top
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace