RhinoCommon API
GetContextCallback Methods
The GetContextCallback type exposes the following members.
Methods
Name | Description
BeforeGetPoint
 Called before a GetPoint() operation. Setting the point or result on the input arguments will cause the default GetPoint operation to be skipped and results will immediately be returned to the caller of the initial GetPoint.
DisableForAllContexts
DisableForContext
EnableForContext
Top
See Also
Reference
GetContextCallback Class
Rhino.Input.Custom Namespace