RhinoCommon API
SubDFace Methods
The SubDFace type exposes the following members.
Methods
Name | Description
EdgeAt
 Get an edge at a given index
EdgeDirectionMatchesFaceOrientation
 Check if a given edge in this face has the same direction as the face orientation
VertexAt
 Get a vertex that this face uses by index
Top
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace