RhinoCommon SDK
RLeaderObject Methods
The RLeaderObject type exposes the following members.
Methods
Name | Description
DuplicateLeaderGeometry
 Constructs a deep (full) copy of the RLeader geometry.
Top
See Also
Reference
RLeaderObject Class
Rhino.DocObjects Namespace