RhinoCommon API
DisplayPen Methods
The DisplayPen type exposes the following members.
Methods
Name | Description
PatternAsArray
 Get the pattern for this pen as an array of dash,gap,dash,gap... values
SetPattern
 Set pattern to apply for a stroke.
Top
See Also
Reference
DisplayPen Class
Rhino.Display Namespace