RhinoCommon API
Hatch Methods
The Hatch type exposes the following members.
Methods
Name | Description
Create(Curve, Int32, Double, Double)
 Constructs an array of hatches from one curve.
Create(IEnumerable<Curve>, Int32, Double, Double)
 Constructs an array of hatches from a set of curves.
Create(Curve, Int32, Double, Double, Double)
 Constructs an array of hatches from one curve.
Create(IEnumerable<Curve>, Int32, Double, Double, Double)
 Constructs an array of hatches from a set of curves.
CreateDisplayGeometry
 Generate geometry that would be used to draw the hatch with a given hatch pattern
In Rhino for Windows, this member is overridden by Dispose(Boolean).
Explode
 Decomposes the hatch pattern into an array of geometry.
Get3dCurves
 Gets 3d curves that define the boundaries of the hatch
GetGradientFill
 Get gradient fill information for this hatch. If the "GradientType" for the fill is None, then this hatch doesn't have any gradient fill.
In Rhino for Windows, this member is overridden by NonConstOperation().
ScalePattern
 Scale the hatch's pattern
SetGradientFill
Top
See Also
Reference
Hatch Class
Rhino.Geometry Namespace