RhinoCommon API
SubDVertexList Methods
The SubDVertexList type exposes the following members.
Methods
Name | Description
Add
 Add a new vertex to the end of the Vertex list.
Find(Int32)
 Find a vertex in this SubD with a given id
Find(UInt32)
 Find a vertex in this SubD with a given id
Top
See Also
Reference
SubDVertexList Class
Rhino.Geometry.Collections Namespace