RhinoCommon API
SubDEdgeList Methods
The SubDEdgeList type exposes the following members.
Methods
Name | Description
Add
 Add a new edge to the list.
Find(Int32)
 Find an edge in this SubD with a given id
Find(UInt32)
 Find an edge in this SubD with a given id
GetEnumerator
 Implementation of IEnumerable
Top
See Also
Reference
SubDEdgeList Class
Rhino.Geometry.Collections Namespace