RhinoCommon API
RhinoPageView Methods
The RhinoPageView type exposes the following members.
Methods
Name | Description
AddDetailView
 Creates a detail view object that is displayed on this page and adds it to the doc.
Duplicate
 Copy a page view
GetDetailViews
 Gets a list of the detail view objects associated with this layout.
GetPreviewImage
 Creates a preview image of the page.
SetActiveDetail(Guid)
SetActiveDetail(String, Boolean)
SetPageAsActive
Top
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace