RhinoCommon API
RhinoDoc Methods
The RhinoDoc type exposes the following members.
Methods
Name | Description
AddCustomUndoEvent(String, EventHandler<CustomUndoEventArgs>)
AddCustomUndoEvent(String, EventHandler<CustomUndoEventArgs>, Object)
 Add a custom undo event so you can undo private plug-in data when the user performs an undo or redo
AdjustModelUnitSystem
AdjustPageUnitSystem
BeginUndoRecord
 Instructs Rhino to begin recording undo information when the document is changed outside of a command. We use this, e.g., to save changes caused by the modeless layer or object properties dialogs when commands are not running.
ClearRedoRecords
ClearUndoRecords(Boolean)
ClearUndoRecords(UInt32, Boolean)
Create
 Creates a new RhinoDoc
CreateDefaultAttributes
 Gets the default object attributes for this document. The attributes will be linked to the currently active layer and they will inherit the Document WireDensity setting.
CreateHeadless
 Create a new headless RhinoDoc from a template file
Dispose
EndUndoRecord
 Ends the undo record.
Equals(Object) |  (Overrides Object.Equals(Object).)
Export
 Export the entire document to a file. All file formats that Rhino can export to are supported by this function.
ExportSelected
 Export selected geometry to a file. All file formats that Rhino can export to are supported by this function.
ExtractPreviewImage
Extracts the bitmap preview image from the specified model (3DM).
Finalize |  (Overrides Object.Finalize().)
FindFile
 Search for a file using Rhino's search path. Rhino will look in the following places: 1. Current model folder 2. Path specified in options dialog/File tab 3. Rhino system folders 4. Rhino executable folder
FromFilePath
 Search the open document list for a document with a Path equal to the specified file path.
FromId |  Obsolete.
FromRuntimeSerialNumber
GetAnalysisMeshingParameters
 Get analysis meshing parameters currently used by the document
GetCurrentMeshingParameters
 Get the custom meshing parameters that this document will use.
GetEmbeddedFilesList
GetGumballPlane
 Returns the active plane of Rhino's auto-gumball widget. Note, when calling from a Rhino command, make sure the command class has the Rhino.Commands.Style.Transparent command style attribute.
GetHashCode() |  (Overrides Object.GetHashCode().)
GetMeshingParameters
 Get MeshingParameters currently used by the document
GetRenderPrimitiveList
 Build custom render mesh(es) for this document (ie - GH meshes).
GetRenderPrimitives(Boolean, Boolean)
 Get a enumerable list of custom mesh primitives
GetRenderPrimitives(ViewportInfo, Boolean, Boolean)
 Get a enumerable list of custom mesh primitives
GetRenderPrimitives(Guid, ViewportInfo, Boolean, Boolean)
 Get a enumerable list of custom mesh primitives
GetUnitSystemName
Import
 Import geometry into a RhinoDoc from a file. This can be any file format that Rhino can import
Open
 Opens a 3dm file and makes it the active document. If called on windows the active document will be saved and closed and the new document will be opened and become the active document. If called on the Mac the file will be opened in a new document window.
OpenDocuments
 Returns a list of currently open Rhino documents
OpenFile |  Obsolete.
OpenHeadless
 Opens a 3DM file into a new headless RhinoDoc.
ReadFile
ReadFileVersion
 Returns the file version of the current document. Use this function to determine which version of Rhino last saved the document.
Redo
 Redo the last action that was "undone"
Save
 Save doc to disk using the document's Path
SaveAs(String)
 Save doc as a 3dm to a specified path using the current Rhino file version
SaveAs(String, Int32)
 Save doc as a 3dm to a specified path
SaveAsTemplate(String)
 Save this document as a template
SaveAsTemplate(String, Int32)
 Save this document as a template to a specific Rhino file version
SetCustomMeshingParameters
 Set the custom meshing parameters that this document will use. You must also modify the MeshingParameterStyle property on the document to Custom if you want these meshing parameters to be used
SupportsRenderPrimitiveList
 Determines if custom render meshes will be built for this document (ie - GH meshes).
TryGetRenderPrimitiveBoundingBox
 Get the bounding box for the custom render meshes associated with this document (ie - GH meshes).
Undo
 Undo the last action
Write3dmFile
 Write information in this document to a .3dm file. Note, the active document's name will not be changed.
WriteFile
 Write information in this document to a file. Note, the active document's name will be changed to that of the path provided.
Top
See Also
Reference
RhinoDoc Class
Rhino Namespace