RhinoCommon API
FilePly Methods
The FilePly type exposes the following members.
Methods
Name | Description
Write
Write a ply file based on the contents of a RhinoDoc
Top
See Also
Reference
FilePly Class
Rhino.FileIO Namespace