RhinoCommon API
ViewCapture Methods
The ViewCapture type exposes the following members.
Methods
Name | Description
CaptureToBitmap(RhinoView)
CaptureToBitmap(ViewCaptureSettings)
CaptureToSvg
Top
See Also
Reference
ViewCapture Class
Rhino.Display Namespace