RhinoCommon API
ListablePostEffectPlugIn Methods
The ListablePostEffectPlugIn type exposes the following members.
Methods
Name | Description
Fixed
 Return true if the PEP is fixed, else false. Fixed plug-ins cannot be un-shown by the user, although they can be turned off.
On
 Return true if the PEP is turned on. Only PEPs that are on will execute.
SetOn
 Turn the PEP on or off.
SetShown
 Show or hide the PEP.
Shown
 return true if the PEP is shown in a list. Only PEPs that are shown will execute.
Top
See Also
Reference
ListablePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace