RhinoCommon API
Pixels Methods
The Pixels type exposes the following members.
Methods
Name | Description
Dispose
Finalize |  (Overrides Object.Finalize().)
Get
Top
See Also
Reference
Pixels Class
Rhino.Render.PostEffects Namespace