RhinoCommon SDK
MeshNgonList Methods
The MeshNgonList type exposes the following members.
Methods
Name | Description
AddNgon
 Appends a new ngon to the end of the mesh ngon list.
AddNgons
 Appends a list of ngons to the end of the mesh ngon list.
AddPlanarNgons(Double)
 Add an ngon for each group of connected coplanar faces.
AddPlanarNgons(Double, Int32, Int32)
 Add an ngon for each group of connected coplanar faces.
Clear
 Clears the Ngon list on the mesh.
GetEnumerator
 Gets an enumerator that yields all ngons in this collection.
GetNgon
 Returns the mesh ngon at the given index.
GetNgonBoundary
 Get a list of vertices that form the boundary of a face set. This is often use to get n-gon boundaries.
GetNgonBoundingBox(Int32)
 Gets the bounding box of an ngon.
GetNgonBoundingBox(MeshNgon)
 Gets the bounding box of an ngon.
GetNgonCenter(Int32)
 Gets the center point of an ngon.
This the avarage of the corner points.
GetNgonCenter(MeshNgon)
 Gets the center point of an ngon.
This the avarage of the corner points.
Insert
 Inserts a mesh ngon at a defined index in this list.
NgonBoundaryVertexList
 Get an ngon's boundary points.
NgonIndexFromFaceIndex
 Returns the index of a mesh ngon the face belongs to.
RemoveAt
 Removes an ngon from the mesh.
RemoveNgons
 Remove one or more ngons from the mesh.
SetNgon
 Set an ngon in this list.
Top
See Also
Reference
MeshNgonList Class
Rhino.Geometry.Collections Namespace