RhinoCommon API
BrepVertex Methods
The BrepVertex type exposes the following members.
Methods
Name | Description
In Rhino for Windows, this member is overridden by Dispose(Boolean).
EdgeIndices
 Gets the indices of all edges associated with this vertex.
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
See Also
Reference
BrepVertex Class
Rhino.Geometry Namespace