RhinoCommon API
IHeaderButtonHandler Methods
The IHeaderButtonHandler type exposes the following members.
Methods
Name | Description
ButtonDetails
ButtonRect
DeleteThis
OnButtonClicked
Top
See Also
Reference
IHeaderButtonHandler Interface
Rhino.UI.Controls Namespace