RhinoCommon SDK
RichText Methods
The RichText type exposes the following members.
Methods
Name | Description
Create
 Create RichText geometry or null if input is invalid
SetTextString
Top
See Also
Reference
RichText Class
Rhino.Geometry Namespace