RhinoCommon API
DracoCompression.Compress Method
Overload List
Name | Description
Compress(Mesh)
 Compress a mesh using default compression options.
Compress(Mesh, DracoCompressionOptions)
 Compress a mesh
Top
See Also
Reference
DracoCompression Class
Rhino.FileIO Namespace