RhinoCommon API
ToneMappingPostEffectPlugInArray Constructor
Overload List
Name | Description
ToneMappingPostEffectPlugInArray()
Initializes a new instance of the ToneMappingPostEffectPlugInArray class
ToneMappingPostEffectPlugInArray(IntPtr)
Initializes a new instance of the ToneMappingPostEffectPlugInArray class
Top
See Also
Reference
ToneMappingPostEffectPlugInArray Class
Rhino.Render.PostEffects Namespace