RhinoCommon API
Decal.TextureRenderCRC Method
Overload List
Name | Description
TextureRenderCRC(TextureRenderHashFlags)
 Get the texture render CRC for the referenced texture using the TextureRenderHashFlags given
TextureRenderCRC(TextureRenderHashFlags, LinearWorkflow)
 Get the texture render CRC for the referenced texture using the TextureRenderHashFlags given along with the LinearWorkflow
Top
See Also
Reference
Decal Class
Rhino.Render Namespace