RhinoCommon SDK
CustomMeshObject.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the CustomMeshObject
Dispose(Boolean)
Releases the unmanaged resources used by the CustomMeshObject and optionally releases the managed resources
Top
See Also
Reference
CustomMeshObject Class
Rhino.DocObjects.Custom Namespace