RhinoCommon API
PostEffectPlugIn Constructor
Overload List
Name | Description
PostEffectPlugIn()
Initializes a new instance of the PostEffectPlugIn class
PostEffectPlugIn(IntPtr)
Initializes a new instance of the PostEffectPlugIn class
Top
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace