RhinoCommon SDK
Sun.SetPosition Method
Overload List
Name | Description
SetPosition(Double, Double)
 Sets position of the Sun based on azimuth and altitude values.
SetPosition(DateTime, Double, Double)
 Sets position of the sun based on physical location and time.
Top
See Also
Reference
Sun Class
Rhino.Render Namespace