RhinoCommon API
HostUtils.GetPlatformService Method
Overload List
Name | Description
GetPlatformService<T>()
For internal use only
GetPlatformService<T>(String, String)
For internal use only. Loads an assembly for dependency injection via IPlatformServiceLocator.
Top
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace