RhinoCommon SDK
ObjectTable.AddRichText Method
Overload List
Name | Description
AddRichText(RichText)
 Adds a rich text object to the document.
AddRichText(RichText, ObjectAttributes)
 Adds a rich text object to the document.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace