RhinoCommon API
GetPoint Constructor
Overload List
Name | Description
GetPoint()
Create a new GetPoint.
GetPoint(String, Object)
Initializes a new instance of the GetPoint class
Top
See Also
Reference
GetPoint Class
Rhino.Input.Custom Namespace