RhinoCommon API
ColorRGBA.Equals Method
Overload List
Name | Description
Equals(Object) |  (Overrides ValueType.Equals(Object).)
Equals(ColorRGBA)
 Determines whether the specified ColorRGBA has the same values as the present color.
Top
See Also
Reference
ColorRGBA Structure
Rhino.Display Namespace