RhinoCommon SDK
RhinoObject.MeshObjects Method
Overload List
Name | Description
MeshObjects(IEnumerable<RhinoObject>, MeshingParameters, Mesh[], ObjectAttributes[])
Mesh Rhino Objects
MeshObjects(IEnumerable<RhinoObject>, MeshingParameters, Boolean, Mesh[], ObjectAttributes[])
Mesh Rhino Objects
MeshObjects(IEnumerable<RhinoObject>, MeshingParameters, Int32, Transform, Mesh[], ObjectAttributes[])
Mesh Rhino Objects
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace