RhinoCommon API
EarlyPostEffectPlugInArray Constructor
Overload List
Name | Description
EarlyPostEffectPlugInArray()
Initializes a new instance of the EarlyPostEffectPlugInArray class
EarlyPostEffectPlugInArray(IntPtr)
Initializes a new instance of the EarlyPostEffectPlugInArray class
Top
See Also
Reference
EarlyPostEffectPlugInArray Class
Rhino.Render.PostEffects Namespace