RhinoCommon API
Mesh.QuadRemesh Method
Overload List
Name | Description
QuadRemesh(QuadRemeshParameters)
 Quad remesh this mesh.
QuadRemesh(QuadRemeshParameters, IEnumerable<Curve>)
 Quad remesh this mesh.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace