RhinoCommon API
Intersection.MeshMesh Method
Overload List
Name | Description
MeshMesh(IEnumerable<Mesh>, Double, Boolean, SetsCombinations, Polyline[], Mesh, TextLog, CancellationToken, IProgress<Double>)
 Intersects meshes. Overlaps and perforations are provided in the output list.
MeshMesh(IEnumerable<Mesh>, Double, Boolean, SetsCombinations, Polyline[], Boolean, Polyline[], TextLog, CancellationToken, IProgress<Double>)
 Intersects meshes. Overlaps and perforations are provided in the output list.
Top
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace