RhinoCommon API
MeshUnwrapper Constructor
Overload List
Name | Description
MeshUnwrapper(Mesh)
 Creates a mesh unwrapper for a single mesh
MeshUnwrapper(IEnumerable<Mesh>)
 Creates a mesh unwrapper for a set of meshes
Top
See Also
Reference
MeshUnwrapper Class
Rhino.Geometry Namespace