RhinoCommon API
TextFields.PageContents Method
Overload List
Name | Description
PageContents()
 Returns the Page Contents string from the current layout
PageContents(String)
 Returns the Page Contents of the layout specified by the rhino view id string
Top
See Also
Reference
TextFields Class
Rhino.Runtime Namespace