RhinoCommon SDK
AngularDimension Constructor
Overload List
Name | Description
AngularDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
AngularDimension(Arc, Double)
 Create an angular dimension from a give arc
Top
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace