RhinoCommon API
PersistentSettings Constructor
Overload List
Name | Description
PersistentSettings(PersistentSettings)
Initializes a new instance of the PersistentSettings class
PersistentSettings(SerializationInfo, StreamingContext)
Initializes a new instance of the PersistentSettings class
Top
See Also
Reference
PersistentSettings Class
Rhino Namespace