RhinoCommon API
Mesh.SetTextureCoordinates Method
Overload List
Name | Description
SetTextureCoordinates(TextureMapping, Transform, Boolean)
 Set texture coordinates using given mapping and applying given transform. Set lazy to false to generate texture coordinates right away.
SetTextureCoordinates(TextureMapping, Transform, Boolean, Boolean)
 Set texture coordinates using given mapping and applying given transform. Set lazy to false to generate texture coordinates right away.
Top
See Also
Reference
Mesh Class
Rhino.Geometry Namespace