RhinoCommon SDK
RenderPipeline.SaveImage Method
Rhino 5 for Windows
Overload List
Name | Description
SaveImage(String)
 Saves the rendered image to a file.
SaveImage(String, Boolean)
 Saves the rendered image to a file.
Top
See Also
Reference
RenderPipeline Class
Rhino.Render Namespace