RhinoCommon SDK
NurbsCurvePointList.SetPoint Method
Overload List
Name | Description
SetPoint(Int32, Point3d)
 Sets a specific control-point.
SetPoint(Int32, Point4d)
 Sets a specific weighted control-point.
SetPoint(Int32, Double, Double, Double, Double)
 Sets a specific control-point.
Top
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace