RhinoCommon API
ChannelData Constructor
Overload List
Name | Description
ChannelData()
Initializes a new instance of the ChannelData class
ChannelData(IntPtr)
Initializes a new instance of the ChannelData class
ChannelData(ChannelData)
Initializes a new instance of the ChannelData class
ChannelData(Guid, ComponentOrder)
Initializes a new instance of the ChannelData class
Top
See Also
Reference
ChannelData Class
Rhino.Render.PostEffects Namespace