RhinoCommon SDK
Dialogs.ShowMessageBox Method
Overload List
Name | Description
ShowMessageBox(String, String)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessageBox(String, String, ShowMessageBoxButton, ShowMessageBoxIcon)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
ShowMessageBox(Object, String, String, ShowMessageBoxButton, ShowMessageBoxIcon, ShowMessageBoxDefaultButton, ShowMessageBoxOptions, ShowMessageBoxMode)
 Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
Top
See Also
Reference
Dialogs Class
Rhino.UI Namespace