RhinoCommon API
LatePostEffectPlugInArray Constructor
Overload List
Name | Description
LatePostEffectPlugInArray()
Initializes a new instance of the LatePostEffectPlugInArray class
LatePostEffectPlugInArray(IntPtr)
Initializes a new instance of the LatePostEffectPlugInArray class
Top
See Also
Reference
LatePostEffectPlugInArray Class
Rhino.Render.PostEffects Namespace