RhinoCommon API
RenderMaterial.SimulatedMaterial Method
Overload List
Name | Description
SimulatedMaterial(Boolean) |  Obsolete.
SimulatedMaterial(RenderTexture.TextureGeneration)
Top
See Also
Reference
RenderMaterial Class
Rhino.Render Namespace