RhinoCommon API
NamedParametersEventArgs.Set Method
Overload List
Name | Description
Set(String, GeometryBase)
 Set geometry for a given key name
Set(String, Point3d)
 Set a Point3d value for a given key name
Set(String, Vector3d)
 Set a Vector3d value for a given key name
Set(String, Boolean)
 Set a bool value for a given key name
Set(String, IEnumerable<GeometryBase>)
 Set a list of geometry for a given key name
Set(String, IEnumerable<String>)
 Set a list of strings as a value for a given key name
Set(String, Double)
 Set a double value for a given key name
Set(String, Color)
 Set a Color value for a given key name
Set(String, Int32)
 Set an int value for a given key name
Set(String, String)
 Set a string value for a given key name
Set(String, UInt32)
 Set an unsigned int for a given key name
Top
See Also
Reference
NamedParametersEventArgs Class
Rhino.Runtime Namespace