RhinoCommon API
Material.SetTransparencyTexture Method
Overload List
Name | Description
SetTransparencyTexture(String) |  Obsolete.
SetTransparencyTexture(Texture) |  Obsolete.
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace