RhinoCommon SDK
TextureEvaluator.Dispose Method
Overload List
Name | Description
Dispose()
Releases all resources used by the TextureEvaluator
Dispose(Boolean)
Releases the unmanaged resources used by the TextureEvaluator and optionally releases the managed resources
Top
See Also
Reference
TextureEvaluator Class
Rhino.Render Namespace