RhinoCommon API
RadialDimension Constructor
Overload List
Name | Description
RadialDimension()
Initializes a new instance of the RadialDimension class
RadialDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace