RhinoCommon API
Utilities.ShowContentChooser Method
Overload List
Name | Description
ShowContentChooser(Guid, Guid, RenderContentKind, Guid, RenderContent.ShowContentChooserFlags, RhinoDoc)
 Shows the content chooser to allow the user to select a new or existing content.
ShowContentChooser(RhinoDoc, Guid, Guid, RenderContentKind, RenderContent.ShowContentChooserFlags, String, IEnumerable<String>, IEnumerable<Guid>, Guid[])
 Shows the content chooser to allow the user to select a new or existing content, or multiple contents.
Top
See Also
Reference
Utilities Class
Rhino.Render Namespace