RhinoCommon API
Layer.GetChildren Method
Overload List
Name | Description
GetChildren()
 Gets immediate children of this layer. Note that child layers may have their own children.
GetChildren(Boolean)
 Gets immediate children of this layer. Note that child layers may have their own children.
Top
See Also
Reference
Layer Class
Rhino.DocObjects Namespace