RhinoCommon API
RenderContentCollection.ContentNeedsPreviewThumbnail Method
Overload List
Name | Description
ContentNeedsPreviewThumbnail(RenderContent) |  Obsolete.
ContentNeedsPreviewThumbnail(RenderContent, Boolean)
Top
See Also
Reference
RenderContentCollection Class
Rhino.Render Namespace