RhinoCommon SDK
Sun.Dispose Method
Rhino 5 for Windows
Overload List
Name | Description
Dispose()
Releases all resources used by the Sun
Dispose(Boolean)
Releases the unmanaged resources used by the Sun and optionally releases the managed resources
Top
See Also
Reference
Sun Class
Rhino.Render Namespace