RhinoCommon API
TextFields.Volume Method
Overload List
Name | Description
Volume(String)
 Returns the volume for the selected object id
Volume(String, String)
 Returns volume for selected object id in the specified unit system
Top
See Also
Reference
TextFields Class
Rhino.Runtime Namespace