RhinoCommon API
Material.SetBitmapTexture Method
Overload List
Name | Description
SetBitmapTexture(String) |  Obsolete.
SetBitmapTexture(Texture) |  Obsolete.
Top
See Also
Reference
Material Class
Rhino.DocObjects Namespace