RhinoCommon SDK
ObjectTable.AddRhinoObject Method
Overload List
Name | Description
AddRhinoObject(CustomBrepObject)
AddRhinoObject(CustomMeshObject)
AddRhinoObject(CustomPointObject)
AddRhinoObject(BrepObject, Brep)
AddRhinoObject(CurveObject, Curve)
AddRhinoObject(MeshObject, Mesh)
AddRhinoObject(PointObject, Point)
AddRhinoObject(RichTextObject, RichText)
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace