RhinoCommon API
AngularDimension.Create Method
Overload List
Name | Description
Create(Guid, Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
Create(DimensionStyle, Plane, Vector3d, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
Top
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace