RhinoCommon SDK
MeshNgon Constructor
Overload List
Name | Description
MeshNgon()
 Constructs an empty ngon.
MeshNgon(Int32[], Int32[])
 Constructs an ngon from lists of mesh vertex and face indexes.
Top
See Also
Reference
MeshNgon Class
Rhino.Geometry Namespace