RhinoCommon API
RhinoDoc.PageAbsoluteTolerance Property
Page space absolute tolerance.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PageAbsoluteTolerance { get; set; }
Public Property PageAbsoluteTolerance As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace