RhinoCommon SDK
InstanceDefinitionTable.Count Property
Number of items in the instance definitions table.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
InstanceDefinitionTable Class
Rhino.DocObjects.Tables Namespace