RhinoCommon API
RenderMaterial.PhysicallyBased.ChildSlotNames.SpecularTint Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PhysicallyBased.ChildSlotNames.SpecularTint"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string SpecularTint { get; }
Public Shared ReadOnly Property SpecularTint As String
	Get
Property Value
Type: String
See Also
Reference
RenderMaterial.PhysicallyBased.ChildSlotNames Class
Rhino.Render Namespace