RhinoCommon API
LicenseStatus.LicenseTitle Property
The title of the license. (e.g. "Rhinoceros 6.0 Commercial")
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string LicenseTitle { get; set; }
Public Property LicenseTitle As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace