RhinoCommon API
RenderMaterial.PhysicallyBased.ChildSlotNames.SheenTint Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PhysicallyBased.ChildSlotNames.SheenTint"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string SheenTint { get; }
Public Shared ReadOnly Property SheenTint As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderMaterial.PhysicallyBased.ChildSlotNames Class
Rhino.Render Namespace