RhinoCommon API
ViewCaptureSettings.RasterMode Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.RasterMode"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RasterMode { get; set; }
Public Property RasterMode As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace