RhinoCommon API
GetContextArgs.ContextObject Property
 Optional object that may be associated with this get operation
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Object ContextObject { get; }
Public ReadOnly Property ContextObject As Object
	Get
Property Value
Type: Object
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetContextArgs Class
Rhino.Input.Custom Namespace