RhinoCommon API
Brep.Curves2D Property
 Parameter space trimming curves (used by trims)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepCurveList Curves2D { get; }
Public ReadOnly Property Curves2D As BrepCurveList
	Get
Property Value
Type: BrepCurveList
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Brep Class
Rhino.Geometry Namespace