RhinoCommon API
ModelAidSettings.AutoGumballEnabled Property
 When AutoGumball is on, a gumball automatically appears when objects are prepicked.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool AutoGumballEnabled { get; set; }
Public Shared Property AutoGumballEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace