RhinoCommon API
ContentCollectionIterator.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.ContentCollectionIterator.CppPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ContentCollectionIterator Class
Rhino.Render Namespace