RhinoCommon API
Dimension.ToleranceHeightScale Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ToleranceHeightScale"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ToleranceHeightScale { get; set; }
Public Property ToleranceHeightScale As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Dimension Class
Rhino.Geometry Namespace