RhinoCommon API
AppearanceSettings.TrackingColor Property
 Gets or sets the tracking color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color TrackingColor { get; set; }
Public Shared Property TrackingColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace