RhinoCommon API
Light.AttenuationVector Property
 Gets or Sets the attenuation vector.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d AttenuationVector { get; set; }
Public Property AttenuationVector As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Light Class
Rhino.Geometry Namespace