RhinoCommon API
MeshCheckParameters.CheckForDuplicateFaces Property
 If true, then look for faces that have vertexes (not necessarily vertex indexes) that are identical.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CheckForDuplicateFaces { get; set; }
Public Property CheckForDuplicateFaces As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace