RhinoCommon API
HatchPattern.FillType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.HatchPattern.FillType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public HatchPatternFillType FillType { get; set; }
Public Property FillType As HatchPatternFillType
	Get
	Set
Property Value
Type: HatchPatternFillType
See Also
Reference
HatchPattern Class
Rhino.DocObjects Namespace