RhinoCommon API
ShutLiningCurveInfo.IsBump Property
 True if profile constitutes a bump. See Rhino's Help for more information.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsBump { get; }
Public ReadOnly Property IsBump As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace