RhinoCommon API
Mesh.SingleMapping Property
 Get texture mapping info as single mapping
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MappingChannel SingleMapping { get; }
Public ReadOnly Property SingleMapping As MappingChannel
	Get
Property Value
Type: MappingChannel
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Mesh Class
Rhino.Render.ChangeQueue Namespace