RhinoCommon API
PhysicallyBasedMaterial.Roughness Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.Roughness"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Roughness { get; set; }
Public Property Roughness As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace