RhinoCommon API
SubD.Vertices Property
 All vertices in this SubD
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SubDVertexList Vertices { get; }
Public ReadOnly Property Vertices As SubDVertexList
	Get
Property Value
Type: SubDVertexList
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SubD Class
Rhino.Geometry Namespace