RhinoCommon API
DetailViewObject.IsActive Property
 Gets or sets the active state of the detail view.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsActive { get; set; }
Public Property IsActive As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace