RhinoCommon API
Intersection.MeshIntersectionsTolerancesCoefficient Property
Offers a requested adjustment coefficient for mesh-mesh intersections tolerances. The value can be used to multiply the document absolute tolerance.
This is only a UI value; it is up to developer to honor (or not) this request, depending on application needs.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static double MeshIntersectionsTolerancesCoefficient { get; set; }
Public Shared Property MeshIntersectionsTolerancesCoefficient As Double
	Get
	Set
Property Value
Type: Double
Setting the value to 1.0 results in the setting doing nothing.
Setting the value to 0.0 results in the default value being reset.
Setting negative values results in an exception.
Exceptions
Exception | Condition
ArgumentOutOfRangeException | When the value is negative.
Remarks
Generally, document tolerances are around 0.001 for objects sized about 100 units. However, good mesh triangles for these objects are often a few orders of magnitude smaller than these values. This coefficient is provided to translate absolute document tolerances to values more suitable for good mesh intersections.
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace