RhinoCommon API
InstanceObject.InstanceXform Property
 transformation applied to an instance definition for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform InstanceXform { get; }
Public ReadOnly Property InstanceXform As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
InstanceObject Class
Rhino.DocObjects Namespace