RhinoCommon API
LicenseStateChangedEventArgs.CallingRhinoCommonAllowed Property
 true if RhinoCommon calls will never raise Rhino.Runtime.NotLicensedException. false otherwise
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CallingRhinoCommonAllowed { get; }
Public ReadOnly Property CallingRhinoCommonAllowed As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LicenseStateChangedEventArgs Class
Rhino.Runtime Namespace