RhinoCommon API
NamedColor.Color Property
 Gets the color for this entry.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color Color { get; }
Public ReadOnly Property Color As Color
	Get
Property Value
Type: Color
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
NamedColor Class
Rhino.UI Namespace