RhinoCommon API
PhysicallyBasedMaterial.ClearcoatRoughness Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ClearcoatRoughness"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ClearcoatRoughness { get; set; }
Public Property ClearcoatRoughness As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace