RhinoCommon API
MeshThicknessMeasurement.VertexIndex Property
 Gets the index of the vertex associated with this thickness measurement.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int VertexIndex { get; }
Public ReadOnly Property VertexIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshThicknessMeasurement Structure
Rhino.Geometry Namespace