RhinoCommon API
MeshExtruder.PreviewLines Property
 Gets Line objects to preview extruded mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line[] PreviewLines { get; }
Public ReadOnly Property PreviewLines As Line()
	Get
Property Value
Type: Line[]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshExtruder Class
Rhino.Geometry Namespace