RhinoCommon API
Sun.TimeZone Property
 Measured in hours += UTC
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TimeZone { get; set; }
Public Property TimeZone As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Sun Class
Rhino.Render Namespace