RhinoCommon API
FilePlyWriteOptions.ExportColors Property
 Determines whether to export vertex colors.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExportColors { get; set; }
Public Property ExportColors As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace