RhinoCommon API
Extrusion.MiterPlaneNormalAtEnd Property
 Gets or sets the normal of the miter plane at the end in profile coordinates. In profile coordinates, 0,0,1 always maps to the extrusion axis
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d MiterPlaneNormalAtEnd { get; set; }
Public Property MiterPlaneNormalAtEnd As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace