RhinoCommon SDK
RenderContentSerializer.LocalDescription Property
 Localized plug-in description
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual string LocalDescription { get; }
Public Overridable ReadOnly Property LocalDescription As String
	Get
Property Value
Type: String
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace