RhinoCommon API
TextFields.InstanceAttributeField.DefaultValue Property
 Default value used when inserting a block
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string DefaultValue { get; }
Public ReadOnly Property DefaultValue As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextFields.InstanceAttributeField Class
Rhino.Runtime Namespace