RhinoCommon API
Material.FresnelIndexOfRefraction Property
 Gets or sets the Fresnel index of refraction of the material, default is 1.56
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FresnelIndexOfRefraction { get; set; }
Public Property FresnelIndexOfRefraction As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Material Class
Rhino.DocObjects Namespace