RhinoCommon API
IOpenIDConnectToken.EmailVerified Property
 true if all the emails in the account have been verified; false otherwise.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Nullable<bool> EmailVerified { get; }
ReadOnly Property EmailVerified As Nullable(Of Boolean)
	Get
Property Value
Type: Nullable<Boolean>
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace