RhinoCommon SDK
TextStyle.Id Property
 TextStyle Id
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
TextStyle Class
Rhino.DocObjects Namespace