RhinoCommon API
RenderTexture.PixelSize2 Property
 Override to provide details on the actual pixel sizes of this texture in UVW directions return null if the texture should not be treated as a bitmap.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual Nullable<()> PixelSize2 { get; }
Public Overridable ReadOnly Property PixelSize2 As Nullable(Of ())
	Get
Property Value
Type: Nullable<ValueTuple<T1, T2, T3>>
See Also
Reference
RenderTexture Class
Rhino.Render Namespace