RhinoCommon API
FileWriteOptions.IncludeRenderMeshes Property
 The file written should include the render meshes if your File Writing Plug-in supports it.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncludeRenderMeshes { get; set; }
Public Property IncludeRenderMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace