RhinoCommon API
CurveSegment.Reversed Property
 True if this piece of the curve should be reversed.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Reversed { get; }
Public ReadOnly Property Reversed As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
CurveSegment Structure
Rhino.Runtime.InteropWrappers Namespace