RhinoCommon SDK
ObjectPropertiesPage.Icon Property
 Icon to display in the object properties tab control
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract Icon Icon { get; }
Public MustOverride ReadOnly Property Icon As Icon
	Get
Property Value
Type: Icon
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace