RhinoCommon SDK
Cone.Unset Property
 Gets an invalid Cone.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Cone Unset { get; }
Public Shared ReadOnly Property Unset As Cone
	Get
Property Value
Type: Cone
See Also
Reference
Cone Structure
Rhino.Geometry Namespace