RhinoCommon API
Layer.SectionHatchRotationRadians Property
 Rotation angle in radians applied to hatch pattern for a section.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SectionHatchRotationRadians { get; set; }
Public Property SectionHatchRotationRadians As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Layer Class
Rhino.DocObjects Namespace