RhinoCommon API
Sun.ManualControl Property
Set angles directly or use place/date/time
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public bool ManualControl { get; set; }
Public Property ManualControl As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Sun Class
Rhino.Render Namespace