RhinoCommon API
TransformObjectList.GripOwnerCount Property
 Number of elements in grip owner list
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int GripOwnerCount { get; }
Public ReadOnly Property GripOwnerCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace