RhinoCommon API
ViewCaptureSettings.OutputColor Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.OutputColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ViewCaptureSettings.ColorMode OutputColor { get; set; }
Public Property OutputColor As ViewCaptureSettings.ColorMode
	Get
	Set
Property Value
Type: ViewCaptureSettings.ColorMode
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace