RhinoCommon SDK
AngularDimension.DimensionStyleIndex Property
 Index of DimensionStyle in document DimStyle table used by the dimension.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int DimensionStyleIndex { get; set; }
Public Property DimensionStyleIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
AngularDimension Class
Rhino.Geometry Namespace