RhinoCommon API
DetailViewObject.DetailGeometry Property
 Returns the detail view geometry.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DetailView DetailGeometry { get; }
Public ReadOnly Property DetailGeometry As DetailView
	Get
Property Value
Type: DetailView
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DetailViewObject Class
Rhino.DocObjects Namespace