RhinoCommon API
DecalCreateParams.VectorAcross Property
[Missing <summary> documentation for "P:Rhino.Render.DecalCreateParams.VectorAcross"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d VectorAcross { get; set; }
Public Property VectorAcross As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DecalCreateParams Class
Rhino.Render Namespace