RhinoCommon API
AppearanceSettings.CommandPromptHypertextColor Property
 Gets or sets the color of the command prompt hypertext.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color CommandPromptHypertextColor { get; set; }
Public Shared Property CommandPromptHypertextColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace