RhinoCommon SDK
RichText.HorizontalAlignment Property
 Text horizontal alignment
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextHorizontalAlignment HorizontalAlignment { get; set; }
Public Property HorizontalAlignment As TextHorizontalAlignment
	Get
	Set
Property Value
Type: TextHorizontalAlignment
See Also
Reference
RichText Class
Rhino.Geometry Namespace