RhinoCommon API
SubDCreationOptions.MaximumConvexCornerEdgeCount Property
 If ConvexCornerTest is at_mesh_corner, then an input mesh boundary vertex becomes a sub-D corner when the number of edges that end at the vertex is <= MaximumConvexCornerEdgeCount edges and the corner angle is <= MaximumConvexCornerAngleRadians.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint MaximumConvexCornerEdgeCount { get; set; }
Public Property MaximumConvexCornerEdgeCount As UInteger
	Get
	Set
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace