RhinoCommon SDK
ObjectPropertiesPage.PageType Property
 Override this and return the page you want to replace a specific object properties page.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public virtual ObjectPropertiesPage.ProertyPageType PageType { get; }
Public Overridable ReadOnly Property PageType As ObjectPropertiesPage.ProertyPageType
	Get
Property Value
Type: ObjectPropertiesPage.ProertyPageType
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace