RhinoCommon API
RenderSettings.DepthCue Property
 Gets or sets a value indicating whether to render using depth cues.
These are clues to help the perception of position and orientation of objects in the image.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DepthCue { get; set; }
Public Property DepthCue As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderSettings Class
Rhino.Render Namespace