RhinoCommon API
HistorySettings.ObjectLockingEnabled Property
 When history object locking is enabled, objects with history on them act as if they were locked and the only way to modify these objects is to edit their inputs.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ObjectLockingEnabled { get; set; }
Public Shared Property ObjectLockingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
HistorySettings Class
Rhino.ApplicationSettings Namespace