RhinoCommon SDK
RichTextObject.TextGeometry Property
 Get the RichText geometry for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RichText TextGeometry { get; set; }
Public Property TextGeometry As RichText
	Get
	Set
Property Value
Type: RichText
See Also
Reference
RichTextObject Class
Rhino.DocObjects Namespace