RhinoCommon API
PhysicallyBasedMaterial.Sheen Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.Sheen"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Sheen { get; set; }
Public Property Sheen As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace