RhinoCommon API
DisplayMaterial.BackShine Property
 Gets or sets the shine factor of the back side of the material (0.0 to 1.0)
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double BackShine { get; set; }
Public Property BackShine As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace