RhinoCommon API
FileSettingsState.AutoSaveMeshes Property
Saves render and display meshes in autosave file.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AutoSaveMeshes { get; set; }
Public Property AutoSaveMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileSettingsState Class
Rhino.ApplicationSettings Namespace