RhinoCommon API
RhinoApp.BuildDate Property
 Gets the build date.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static DateTime BuildDate { get; }
Public Shared ReadOnly Property BuildDate As DateTime
	Get
Property Value
Type: DateTime
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoApp Class
Rhino Namespace