RhinoCommon API
SmartTrackSettingsState.UseDottedLines Property
Gets or sets a value indicating if lines are drawn dotted.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseDottedLines { get; set; }
Public Property UseDottedLines As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
SmartTrackSettingsState Class
Rhino.ApplicationSettings Namespace