RhinoCommon API
NotificationButtonClickedArgs.ButtonClicked Property
 The button that was clicked.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ButtonType ButtonClicked { get; }
Public ReadOnly Property ButtonClicked As ButtonType
	Get
Property Value
Type: ButtonType
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
NotificationButtonClickedArgs Class
Rhino.Runtime.Notifications Namespace