RhinoCommon API
DimensionStyle.IsChild Property
 Tests if this DimensionStyle is a child of any other DimensionStyle
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsChild { get; }
Public ReadOnly Property IsChild As Boolean
	Get
Return Value
Type: Boolean
 True if this is a child DimensionStyle, False otherwise.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace