RhinoCommon API
Material.ReflectionGlossiness Property
 Gets or sets the reflection glossiness.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ReflectionGlossiness { get; set; }
Public Property ReflectionGlossiness As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Material Class
Rhino.DocObjects Namespace