RhinoCommon API
LicenseLease.Expiration Property
 The date when this lease will expire
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DateTime Expiration { get; }
Public ReadOnly Property Expiration As DateTime
	Get
Property Value
Type: DateTime
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace