RhinoCommon API
MouseCallback.Enabled Property
[Missing <summary> documentation for "P:Rhino.UI.MouseCallback.Enabled"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MouseCallback Class
Rhino.UI Namespace