RhinoCommon API
RenderMaterial.PhysicallyBased.ParametersNames.OpacityIor Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PhysicallyBased.ParametersNames.OpacityIor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string OpacityIor { get; }
Public Shared ReadOnly Property OpacityIor As String
	Get
Property Value
Type: String
See Also
Reference
RenderMaterial.PhysicallyBased.ParametersNames Class
Rhino.Render Namespace