RhinoCommon API
Arc.IsCircle Property
 Gets a value indicating whether or not this arc is a complete circle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsCircle { get; }
Public ReadOnly Property IsCircle As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Arc Structure
Rhino.Geometry Namespace