RhinoCommon API
MeshInterference.IndexA Property
 The index of the first clashing, or interfering object.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int IndexA { get; set; }
Public Property IndexA As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshInterference Structure
Rhino.Geometry.Intersect Namespace