RhinoCommon API
CurveBooleanRegions.RegionCount Property
 Returns the number of curve regions. A curve region is a collection of curves that bound a single connected region of the plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int RegionCount { get; }
Public ReadOnly Property RegionCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
CurveBooleanRegions Class
Rhino.Geometry Namespace