RhinoCommon API
ObjectAttributes.SectionHatchScale Property
 Scale applied to the hatch pattern for a section
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SectionHatchScale { get; set; }
Public Property SectionHatchScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace