RhinoCommon API
RenderMaterial.PhysicallyBased.ChildSlotNames.Roughness Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PhysicallyBased.ChildSlotNames.Roughness"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Roughness { get; }
Public Shared ReadOnly Property Roughness As String
	Get
Property Value
Type: String
See Also
Reference
RenderMaterial.PhysicallyBased.ChildSlotNames Class
Rhino.Render Namespace