RhinoCommon API
Light.AttenuationType Property
 Get the type of attenuation for this light.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Light.Attenuation AttenuationType { get; set; }
Public Property AttenuationType As Light.Attenuation
	Get
	Set
Property Value
Type: Light.Attenuation
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Light Class
Rhino.Geometry Namespace