RhinoCommon API
IHelp.HelpUrl Property
 Help topic URL which gets passed to RhinoHelp.Show
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
string HelpUrl { get; }
ReadOnly Property HelpUrl As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
IHelp Interface
Rhino.UI Namespace