RhinoCommon API
FileSettings.AutoSaveFile Property
the file name used by Rhino's automatic file saving mechanism.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string AutoSaveFile { get; set; }
Public Shared Property AutoSaveFile As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace