RhinoCommon API
PhysicallyBasedMaterial.Supported Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.Supported"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Supported { get; }
Public ReadOnly Property Supported As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace