RhinoCommon API
InstanceDefinitionGeometry.Id Property
 unique id for this instance definition
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
InstanceDefinitionGeometry Class
Rhino.Geometry Namespace