RhinoCommon API
Plane.WorldXY Property
 plane coincident with the World XY plane.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Plane WorldXY { get; }
Public Shared ReadOnly Property WorldXY As Plane
	Get
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Plane Structure
Rhino.Geometry Namespace