RhinoCommon SDK
RLeader.ArrowSize Property
 Size of leader arrow
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double ArrowSize { get; set; }
Public Property ArrowSize As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RLeader Class
Rhino.Geometry Namespace