RhinoCommon API
HermiteSurface.UCount Property
 Gets the number of parameters in the "u" direction.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int UCount { get; }
Public ReadOnly Property UCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
HermiteSurface Class
Rhino.Geometry Namespace