RhinoCommon API
Rectangle3d.Height Property
 Gets the signed height of the rectangle. If the Y dimension is decreasing, the height will be negative.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Height { get; }
Public ReadOnly Property Height As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace