RhinoCommon API
DisplayPipelineAttributes.ShowPointClouds Property
Show point clouds.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowPointClouds { get; set; }
Public Property ShowPointClouds As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace