RhinoCommon API
ViewportInfo.PerspectiveMinNearOverFar Property
 Expert user function to control the minimum ratio of near/far when perspective projections are begin used.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PerspectiveMinNearOverFar { get; set; }
Public Property PerspectiveMinNearOverFar As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace