RhinoCommon API
AppearanceSettingsState.CommandPromptHypertextColor Property
Gets or sets the comand prompt hypertext color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color CommandPromptHypertextColor { get; set; }
Public Property CommandPromptHypertextColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace