RhinoCommon API
ViewSettings.ZoomExtentsParallelViewBorder Property
 Border amount to apply to parallel viewport during zoom extents
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static double ZoomExtentsParallelViewBorder { get; set; }
Public Shared Property ZoomExtentsParallelViewBorder As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewSettings Class
Rhino.ApplicationSettings Namespace