RhinoCommon SDK
PanelIds.Layers Property
[Missing <summary> documentation for "P:Rhino.UI.PanelIds.Layers"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Guid Layers { get; }
Public Shared ReadOnly Property Layers As Guid
	Get
Property Value
Type: Guid
See Also
Reference
PanelIds Class
Rhino.UI Namespace