RhinoCommon API
RhinoDoc.Objects Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.Objects"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectTable Objects { get; }
Public ReadOnly Property Objects As ObjectTable
	Get
Property Value
Type: ObjectTable
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace