RhinoCommon API
ObjectPropertiesPageCollection.DocumentRuntimeSerailNumber Property
 Document associated with the Rhino properties panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public uint DocumentRuntimeSerailNumber { get; }
Public ReadOnly Property DocumentRuntimeSerailNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
ObjectPropertiesPageCollection Class
Rhino.UI Namespace