RhinoCommon API
CustomPostEffectAttribute.SupportsHDR Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.CustomPostEffectAttribute.SupportsHDR"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool SupportsHDR { get; set; }
Public Property SupportsHDR As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
CustomPostEffectAttribute Class
Rhino.Render.PostEffects Namespace