RhinoCommon SDK
Vector3d.X Property
 Gets or sets the X (first) component of the vector.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double X { get; set; }
Public Property X As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Vector3d Structure
Rhino.Geometry Namespace