RhinoCommon SDK
RenderContentDeleteEventArgs.Reason Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentDeleteEventArgs.Reason"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderContentDeleteReason Reason { get; }
Public ReadOnly Property Reason As RenderContentDeleteReason
	Get
Property Value
Type: RenderContentDeleteReason
See Also
Reference
RenderContentDeleteEventArgs Class
Rhino.Render Namespace