RhinoCommon API
DimensionStyle.Roundoff Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.Roundoff"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Roundoff { get; set; }
Public Property Roundoff As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace