RhinoCommon API
BrepFace.SurfaceIndex Property
 Surface index of the 3d surface geometry used by this face or -1
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SurfaceIndex { get; }
Public ReadOnly Property SurfaceIndex As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BrepFace Class
Rhino.Geometry Namespace