RhinoCommon API
RenderMaterial.PhysicallyBased.ChildSlotNames.OpacityRoughness Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PhysicallyBased.ChildSlotNames.OpacityRoughness"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string OpacityRoughness { get; }
Public Shared ReadOnly Property OpacityRoughness As String
	Get
Property Value
Type: String
See Also
Reference
RenderMaterial.PhysicallyBased.ChildSlotNames Class
Rhino.Render Namespace