RhinoCommon API
BrepObject.BrepGeometry Property
 Gets the brep geometry linked with this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Brep BrepGeometry { get; }
Public ReadOnly Property BrepGeometry As Brep
	Get
Property Value
Type: Brep
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BrepObject Class
Rhino.DocObjects Namespace