RhinoCommon API
TimeZone.Longitude Property
 Returns the Longitude of a major city nearby
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Longitude { get; }
Public ReadOnly Property Longitude As Double
	Get
Return Value
Type: Double
Longitude
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TimeZone Class
Rhino.Render Namespace