RhinoCommon SDK
RLeader.ArrowType Property
 Type of arrow used by the leader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public AnnotationArrowheadType ArrowType { get; set; }
Public Property ArrowType As AnnotationArrowheadType
	Get
	Set
Property Value
Type: AnnotationArrowheadType
See Also
Reference
RLeader Class
Rhino.Geometry Namespace