RhinoCommon API
StringParserSettings.ParseSettingsIntegerNumber Property
 - The integer settings parse and optional unary + or unary - and then parses one or more digits.Parsing stops after the last digit.
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static StringParserSettings ParseSettingsIntegerNumber { get; }
Public Shared ReadOnly Property ParseSettingsIntegerNumber As StringParserSettings
	Get
Property Value
Type: StringParserSettings
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace