RhinoCommon SDK
Sun.Altitude Property
[Missing <summary> documentation for "P:Rhino.Render.Sun.Altitude"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Altitude { get; }
Public ReadOnly Property Altitude As Double
	Get
Property Value
Type: Double
See Also
Reference
Sun Class
Rhino.Render Namespace