RhinoCommon API
CachedTextureCoordinates.Dim Property
 Coordinate dimension: 2 = UV, 3 = UVW
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Dim { get; }
Public ReadOnly Property Dim As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CachedTextureCoordinates Class
Rhino.Render Namespace