RhinoCommon SDK
TextureMapping.Id Property
 The unique Id for this texture mapping object.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
See Also
Reference
TextureMapping Class
Rhino.Render Namespace