RhinoCommon API
MeshDisplacementInfo.RefineStepCount Property
 Specifies the number of refinement passes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int RefineStepCount { get; set; }
Public Property RefineStepCount As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace