RhinoCommon API
ThumbData.Parent Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ThumbnailUI.ThumbData.Parent"]
 Namespace: Rhino.UI.Controls.ThumbnailUI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ThumbData Parent { get; set; }
Public Property Parent As ThumbData
	Get
	Set
Property Value
Type: ThumbData
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ThumbData Class
Rhino.UI.Controls.ThumbnailUI Namespace