RhinoCommon API
RenderSettings.AmbientLight Property
 Gets or sets the ambient light color used in rendering.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color AmbientLight { get; set; }
Public Property AmbientLight As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderSettings Class
Rhino.Render Namespace