RhinoCommon API
Skylight.CustomEnvironmentOn Property
[Missing <summary> documentation for "P:Rhino.Render.Skylight.CustomEnvironmentOn"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool CustomEnvironmentOn { get; set; }
Public Property CustomEnvironmentOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Skylight Class
Rhino.Render Namespace