RhinoCommon API
UserDictionary.Dictionary Property
 Gets the dictionary that is associated with this class.
This dictionary is unique.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ArchivableDictionary Dictionary { get; }
Public ReadOnly Property Dictionary As ArchivableDictionary
	Get
Property Value
Type: ArchivableDictionary
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace