RhinoCommon API
Color4f.A Property
[Missing <summary> documentation for "P:Rhino.Display.Color4f.A"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float A { get; }
Public ReadOnly Property A As Single
	Get
Property Value
Type: Single
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Color4f Structure
Rhino.Display Namespace