RhinoCommon SDK
Mesh.HiddenVertices Property
 Gets access to the vertex hidden/visibility collection in this mesh. This is a runtime property and it is not saved in the 3dm file.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public MeshVertexHiddenList HiddenVertices { get; }
Public ReadOnly Property HiddenVertices As MeshVertexHiddenList
	Get
Property Value
Type: MeshVertexHiddenList
See Also
Reference
Mesh Class
Rhino.Geometry Namespace