RhinoCommon API
ViewportInfo.FrustumTopPlane Property
 Gets the frustum top plane that separates visibile from off-screen.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane FrustumTopPlane { get; }
Public ReadOnly Property FrustumTopPlane As Plane
	Get
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace