RhinoCommon API
RenderMaterial.PhysicallyBased.ParametersNames.OpacityRoughness Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PhysicallyBased.ParametersNames.OpacityRoughness"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string OpacityRoughness { get; }
Public Shared ReadOnly Property OpacityRoughness As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderMaterial.PhysicallyBased.ParametersNames Class
Rhino.Render Namespace