RhinoCommon API
GumballDisplayConduit.Enabled Property
[Missing <summary> documentation for "P:Rhino.UI.Gumball.GumballDisplayConduit.Enabled"]
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GumballDisplayConduit Class
Rhino.UI.Gumball Namespace