RhinoCommon API
ObjectEnumeratorSettings.ObjectTypeFilter Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.ObjectTypeFilter"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public ObjectType ObjectTypeFilter { get; set; }
Public Property ObjectTypeFilter As ObjectType
	Get
	Set
Property Value
Type: ObjectType
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace