RhinoCommon API
RuntimeDocumentDataTable.Document Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.RuntimeDocumentDataTable.Document"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RuntimeDocumentDataTable Class
Rhino.DocObjects.Tables Namespace