RhinoCommon API
PhysicallyBasedMaterial.Clearcoat Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.Clearcoat"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double Clearcoat { get; set; }
Public Property Clearcoat As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace