RhinoCommon API
MouseCallbackEventArgs.ShiftKeyDown Property
[Missing <summary> documentation for "P:Rhino.UI.MouseCallbackEventArgs.ShiftKeyDown"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShiftKeyDown { get; }
Public ReadOnly Property ShiftKeyDown As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace