RhinoCommon API
ModelAidSettings.OsnapModes Property
 Returns or sets Rhino's current object snap mode. The mode is a bitwise value based on the OsnapModes enumeration.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static OsnapModes OsnapModes { get; set; }
Public Shared Property OsnapModes As OsnapModes
	Get
	Set
Property Value
Type: OsnapModes
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace