RhinoCommon API
RhinoApp.InvokeRequired Property
 Returns true if we are currently not running on the main user interface thread
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool InvokeRequired { get; }
Public Shared ReadOnly Property InvokeRequired As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoApp Class
Rhino Namespace