RhinoCommon API
GetTruncatedCone.SecondRadius Property
 Radius of second circle.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SecondRadius { get; set; }
Public Property SecondRadius As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetTruncatedCone Class
Rhino.Input.Custom Namespace