RhinoCommon API
BoundingBox.Max Property
 Gets or sets the point in the maximal corner.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Max { get; set; }
Public Property Max As Point3d
	Get
	Set
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace