RhinoCommon SDK
TextStyle.LinefeedRatio Property
 Ratio of Height / distance from one line to the next lower line (default 1.6)
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double LinefeedRatio { get; set; }
Public Property LinefeedRatio As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
TextStyle Class
Rhino.DocObjects Namespace