RhinoCommon API
FileObjReadOptions.Split32BitTextures Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileObjReadOptions.Split32BitTextures"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Split32BitTextures { get; set; }
Public Property Split32BitTextures As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileObjReadOptions Class
Rhino.FileIO Namespace