RhinoCommon API
RhinoDoc.RenderSettings Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderSettings"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderSettings RenderSettings { get; set; }
Public Property RenderSettings As RenderSettings
	Get
	Set
Property Value
Type: RenderSettings
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace