RhinoCommon API
Dithering.On Property
[Missing <summary> documentation for "P:Rhino.Render.Dithering.On"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool On { get; set; }
Public Property On As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Dithering Class
Rhino.Render Namespace