RhinoCommon API
RenderPrimitiveList.UseObjectsMappingChannels Property
 Returns true if the texture mapping will be taken from the Rhino object otherwise; the texture mapping will use the texture coordinates on the mesh only.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseObjectsMappingChannels { get; set; }
Public Property UseObjectsMappingChannels As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderPrimitiveList Class
Rhino.Render Namespace