RhinoCommon API
MeshInstance.Decals Property
 Access to the decals for this MeshInstance if any. Null if no decal iterator exists for this mesh instance
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Decals Decals { get; }
Public ReadOnly Property Decals As Decals
	Get
Property Value
Type: Decals
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace