RhinoCommon API
DimStyleTableEventArgs.EventType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTableEventArgs.EventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimStyleTableEventType EventType { get; }
Public ReadOnly Property EventType As DimStyleTableEventType
	Get
Property Value
Type: DimStyleTableEventType
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimStyleTableEventArgs Class
Rhino.DocObjects.Tables Namespace