RhinoCommon API
QuadRemeshParameters.AdaptiveQuadCount Property
 Respect the original Target Quad Count value as much as possible. True returns more quads than TargetQuadCount depending on amount of high-curvature areas.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AdaptiveQuadCount { get; set; }
Public Property AdaptiveQuadCount As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
QuadRemeshParameters Class
Rhino.Geometry Namespace