RhinoCommon API
RhinoView.IsPageView Property
 Return true if this view is a RhinoPageView.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public bool IsPageView { get; }
Public ReadOnly Property IsPageView As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RhinoView Class
Rhino.Display Namespace