RhinoCommon API
CommandEventArgs.CommandEnglishName Property
 Gets the English name of the command that raised this event.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string CommandEnglishName { get; }
Public ReadOnly Property CommandEnglishName As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace