RhinoCommon API
LinetypeTable.ActiveCount Property
 Returns number of linetypes in the linetypes table, excluding deleted linetypes.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ActiveCount { get; }
Public ReadOnly Property ActiveCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
LinetypeTable Class
Rhino.DocObjects.Tables Namespace