RhinoCommon SDK
TextStyle.Underline Property
 From the font used by this style
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Underline { get; set; }
Public Property Underline As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TextStyle Class
Rhino.DocObjects Namespace