RhinoCommon API
RenderPrimitive.BoundingBox Property
 The bounding box for this primitive.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace