RhinoCommon API
LinearDimension.DimensionLinePoint Property
 Point on annotation plane where dimension line starts
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point2d DimensionLinePoint { get; set; }
Public Property DimensionLinePoint As Point2d
	Get
	Set
Property Value
Type: Point2d
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LinearDimension Class
Rhino.Geometry Namespace