RhinoCommon API
AnimationProperties.Longitude Property
 Gets or sets the longitude for sun animations in the range of -180 to +180.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Longitude { get; set; }
Public Property Longitude As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
AnimationProperties Class
Rhino.DocObjects Namespace