RhinoCommon API
ICollapsibleSectionHolder.SectionCount Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.ICollapsibleSectionHolder.SectionCount"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
int SectionCount { get; }
ReadOnly Property SectionCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ICollapsibleSectionHolder Interface
Rhino.UI.Controls Namespace