RhinoCommon API
VisualAnalysisMode.RhinoEdgeContinuityAlalysisModeId Property
 Id for Rhino's built-in edge continuity analysis mode.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid RhinoEdgeContinuityAlalysisModeId { get; }
Public Shared ReadOnly Property RhinoEdgeContinuityAlalysisModeId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
VisualAnalysisMode Class
Rhino.Display Namespace