RhinoCommon API
Symbols.DiameterSymbol Property
 Diameter symbol
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static char DiameterSymbol { get; }
Public Shared ReadOnly Property DiameterSymbol As Char
	Get
Property Value
Type: Char
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Symbols Class
Rhino Namespace