RhinoCommon SDK
RichText.FormatWidth Property
 Text format width
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FormatWidth { get; set; }
Public Property FormatWidth As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RichText Class
Rhino.Geometry Namespace