RhinoCommon API
RhinoApp.CommandPrompt Property
Rhino command prompt.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string CommandPrompt { get; set; }
Public Shared Property CommandPrompt As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoApp Class
Rhino Namespace