RhinoCommon API
PointCloudObject.PointCloudGeometry Property
[Missing <summary> documentation for "P:Rhino.DocObjects.PointCloudObject.PointCloudGeometry"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PointCloud PointCloudGeometry { get; }
Public ReadOnly Property PointCloudGeometry As PointCloud
	Get
Property Value
Type: PointCloud
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PointCloudObject Class
Rhino.DocObjects Namespace