RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.SubsurfaceScatteringRadius Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.SubsurfaceScatteringRadius"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute]
public static string SubsurfaceScatteringRadius { get; }
<ObsoleteAttribute>
Public Shared ReadOnly Property SubsurfaceScatteringRadius As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Obsolete (compiler warning) in 7.0
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace