RhinoCommon API
BrepRegionFaceSide.Region Property
 The region this side belongs to.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public BrepRegion Region { get; }
Public ReadOnly Property Region As BrepRegion
	Get
Property Value
Type: BrepRegion
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BrepRegionFaceSide Class
Rhino.Geometry Namespace