RhinoCommon SDK
RenderContentSerializer.CanWrite Property
 If true then the file type can be exported and will be included in the file save box when exporting the specified render content type.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool CanWrite { get; }
Public ReadOnly Property CanWrite As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderContentSerializer Class
Rhino.Render Namespace