RhinoCommon SDK
InstanceDefinition.Name Property
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.Name"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
Property Value
Type: String
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace