RhinoCommon SDK
RichText.VerticalAlignment Property
 Text vertical alignment
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextVerticalAlignment VerticalAlignment { get; set; }
Public Property VerticalAlignment As TextVerticalAlignment
	Get
	Set
Property Value
Type: TextVerticalAlignment
See Also
Reference
RichText Class
Rhino.Geometry Namespace