RhinoCommon API
FilePlyWriteOptions.ExportNormals Property
 Determines whether to export vertex normals.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExportNormals { get; set; }
Public Property ExportNormals As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace