RhinoCommon API
SweepOneRail.IsFreeform Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.IsFreeform"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsFreeform { get; }
Public ReadOnly Property IsFreeform As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace