RhinoCommon API
RhinoApp.CommandWindowCaptureEnabled Property
 Enable or disable capturing of the strings sent to the CommandWindow through Write and WriteLine calls
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool CommandWindowCaptureEnabled { get; set; }
Public Shared Property CommandWindowCaptureEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoApp Class
Rhino Namespace