RhinoCommon API
UserDictionary.ShouldWrite Property
 Writes this entity if the count is larger than 0.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override bool ShouldWrite { get; }
Public Overrides ReadOnly Property ShouldWrite As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
UserDictionary Class
Rhino.DocObjects.Custom Namespace