RhinoCommon API
GetContextArgs.ContextName Property
 Name of the context that this get operation is happening under
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ContextName { get; }
Public ReadOnly Property ContextName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetContextArgs Class
Rhino.Input.Custom Namespace