RhinoCommon API
SafeFrame.ActionFrameXScale Property
 Action Frame Scale X
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ActionFrameXScale { get; set; }
Public Property ActionFrameXScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SafeFrame Class
Rhino.Render Namespace