RhinoCommon SDK
RLeader.Text Property
 Gets the text used by this leader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RichText Text { get; set; }
Public Property Text As RichText
	Get
	Set
Property Value
Type: RichText
See Also
Reference
RLeader Class
Rhino.Geometry Namespace