RhinoCommon SDK
RLeader.TextString Property
 Return text string from RichText used by this leader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string TextString { get; }
Public ReadOnly Property TextString As String
	Get
Property Value
Type: String
See Also
Reference
RLeader Class
Rhino.Geometry Namespace