RhinoCommon SDK
RenderEnvironment.CurrentEnvironmentForReflectionAndRefraction Property
[Missing <summary> documentation for "P:Rhino.Render.RenderEnvironment.CurrentEnvironmentForReflectionAndRefraction"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static RenderEnvironment CurrentEnvironmentForReflectionAndRefraction { get; set; }
Public Shared Property CurrentEnvironmentForReflectionAndRefraction As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace