RhinoCommon API
PhysicallyBasedMaterial.Emission Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.Emission"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Color4f Emission { get; set; }
Public Property Emission As Color4f
	Get
	Set
Property Value
Type: Color4f
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace