RhinoCommon API
Transform.M22 Property
Gets or sets this[2,2].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double M22 { get; set; }
Public Property M22 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Transform Structure
Rhino.Geometry Namespace