RhinoCommon SDK
BrepTrim.Face Property
 Brep face this trim belongs to
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BrepFace Face { get; }
Public ReadOnly Property Face As BrepFace
	Get
Property Value
Type: BrepFace
See Also
Reference
BrepTrim Class
Rhino.Geometry Namespace