RhinoCommon SDK
DisplayMaterial.Ambient Property
Note: This API is now obsolete.
 Gets or sets the Ambient color of the Material. The alpha component of the color will be ignored.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("This property is obsolete. Use Emission instead.")]
public Color Ambient { get; set; }
<ObsoleteAttribute("This property is obsolete. Use Emission instead.")>
Public Property Ambient As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace