RhinoCommon SDK
TwoColorRenderTexture.Texture1On Property
[Missing <summary> documentation for "P:Rhino.Render.TwoColorRenderTexture.Texture1On"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Texture1On { get; set; }
Public Property Texture1On As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TwoColorRenderTexture Class
Rhino.Render Namespace