RhinoCommon API
PreviewSceneServer.CppPointer Property
 The CppPointer of PreviewSceneServer
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PreviewSceneServer Class
Rhino.Render Namespace