RhinoCommon API
RhinoDoc.IsHeadless Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.IsHeadless"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsHeadless { get; }
Public ReadOnly Property IsHeadless As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace