RhinoCommon API
ComponentStatus.Clear Property
 This is the default value and equal to undefined.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ComponentStatus Clear { get; }
Public Shared ReadOnly Property Clear As ComponentStatus
	Get
Property Value
Type: ComponentStatus
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace