RhinoCommon API
PersistentSettings.RhinoAppSettings Property
[Missing <summary> documentation for "P:Rhino.PersistentSettings.RhinoAppSettings"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static PersistentSettings RhinoAppSettings { get; }
Public Shared ReadOnly Property RhinoAppSettings As PersistentSettings
	Get
Property Value
Type: PersistentSettings
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PersistentSettings Class
Rhino Namespace