RhinoCommon API
SubDCreationOptions.MinimumCreaseAngleRadians Property
 When the interior crease option is AtMeshCreases the value of MinimumCreaseAngleRadians determines which coincident input mesh edges generate sub-D creases. If the input mesh has vertex normals, and the angle between vertex normals is > MinimumCreaseAngleRadians at an end of a coincident input mesh edge, the corresponding sub-D edge will be a crease.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MinimumCreaseAngleRadians { get; set; }
Public Property MinimumCreaseAngleRadians As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace