RhinoCommon API
SafeFrame.Enabled Property
 Determines whether the safeframe is enabled.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SafeFrame Class
Rhino.Render Namespace