RhinoCommon API
GetCone.Cap Property
 Gets or sets whether or not the output should be capped.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Cap { get; set; }
Public Property Cap As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetCone Class
Rhino.Input.Custom Namespace