RhinoCommon SDK
LinearWorkflow.GammaReciprocal Property
 Get gamma reciprocal
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public float GammaReciprocal { get; }
Public ReadOnly Property GammaReciprocal As Single
	Get
Property Value
Type: Single
See Also
Reference
LinearWorkflow Class
Rhino.Render.ChangeQueue Namespace