RhinoCommon API
Material.ReflectionColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.ReflectionColor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color ReflectionColor { get; set; }
Public Property ReflectionColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Material Class
Rhino.DocObjects Namespace