RhinoCommon API
DisplayModeDescription.ArtisticId Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayModeDescription.ArtisticId"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid ArtisticId { get; }
Public Shared ReadOnly Property ArtisticId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayModeDescription Class
Rhino.Display Namespace