RhinoCommon API
GeneralSettings.NewObjectIsoparmCount Property
 Gets or sets the number of isoparm curves to show on new objects.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int NewObjectIsoparmCount { get; set; }
Public Shared Property NewObjectIsoparmCount As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace