RhinoCommon SDK
RLeader.HasLanding Property
 Determines if the leader has a landing segment or not Landing is a small segment between last leader point and content
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool HasLanding { get; set; }
Public Property HasLanding As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RLeader Class
Rhino.Geometry Namespace