RhinoCommon API
Line.UnitTangent Property
 Gets the tangent of the line segment. Note that tangent vectors are always unit vectors.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d UnitTangent { get; }
Public ReadOnly Property UnitTangent As Vector3d
	Get
Property Value
Type: Vector3d
Sets only the direction of the line, the length is maintained.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Line Structure
Rhino.Geometry Namespace