RhinoCommon API
CommandEventArgs.CommandLocalName Property
 Gets the name of the command that raised this event in the local language.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string CommandLocalName { get; }
Public ReadOnly Property CommandLocalName As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CommandEventArgs Class
Rhino.Commands Namespace