RhinoCommon API
StringParserSettings.ParseMathFunctions Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseMathFunctions"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseMathFunctions { get; set; }
Public Property ParseMathFunctions As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace