RhinoCommon API
RhinoDoc.Worksession Property
 Provides access to the document's worksession.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Worksession Worksession { get; }
Public ReadOnly Property Worksession As Worksession
	Get
Property Value
Type: Worksession
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace