RhinoCommon API
ColorStop.Color Property
[Missing <summary> documentation for "P:Rhino.Display.ColorStop.Color"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color Color { get; set; }
Public Property Color As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ColorStop Structure
Rhino.Display Namespace