RhinoCommon API
DisplayPointAttributes.SecondarySize Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPointAttributes.SecondarySize"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float SecondarySize { get; set; }
Public Property SecondarySize As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPointAttributes Class
Rhino.Display Namespace