RhinoCommon API
Mesh.HasPrincipalCurvatures Property
 HasPrincipalCurvatures
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasPrincipalCurvatures { get; }
Public ReadOnly Property HasPrincipalCurvatures As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Mesh Class
Rhino.Geometry Namespace