RhinoCommon API
LatePostEffectPlugIn.SerialNumber Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.LatePostEffectPlugIn.SerialNumber"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SerialNumber { get; set; }
Public Property SerialNumber As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
LatePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace