RhinoCommon API
ClippingPlane.IsEnabled Property
 True if clipping plane is enabled
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsEnabled { get; }
Public ReadOnly Property IsEnabled As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ClippingPlane Class
Rhino.Render.ChangeQueue Namespace