RhinoCommon API
RhinoReplaceObjectEventArgs.ObjectId Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoReplaceObjectEventArgs.ObjectId"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ObjectId { get; }
Public ReadOnly Property ObjectId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoReplaceObjectEventArgs Class
Rhino.DocObjects Namespace