RhinoCommon API
MaterialRefs.Values Property
 Gets an ICollection containing the MaterialRef objects in this dictionary.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ICollection<MaterialRef> Values { get; }
Public ReadOnly Property Values As ICollection(Of MaterialRef)
	Get
Property Value
Type: ICollection<MaterialRef>
Implements
IDictionary<TKey, TValue>.Values
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MaterialRefs Class
Rhino.DocObjects Namespace