RhinoCommon API
AnnotationBase.DrawTextFrame Property
 Gets or sets whether to draw a frame around a text mask
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawTextFrame { get; set; }
Public Property DrawTextFrame As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace