RhinoCommon API
MeshInterference.HitPoints Property
 Array of hit points where the objects of IndexA and IndexB interfere.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d[] HitPoints { get; set; }
Public Property HitPoints As Point3d()
	Get
	Set
Property Value
Type: Point3d[]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshInterference Structure
Rhino.Geometry.Intersect Namespace