RhinoCommon API
DisplayPointAttributes.FillColor Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPointAttributes.FillColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color FillColor { get; set; }
Public Property FillColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayPointAttributes Class
Rhino.Display Namespace