RhinoCommon API
PhysicallyBasedMaterial.SheenTint Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.SheenTint"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SheenTint { get; set; }
Public Property SheenTint As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace