RhinoCommon API
GroupTableEventArgs.OldState Property
 If the event is GroupTableEventType.Modified, then the old Group.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Group OldState { get; }
Public ReadOnly Property OldState As Group
	Get
Property Value
Type: Group
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GroupTableEventArgs Class
Rhino.DocObjects.Tables Namespace