RhinoCommon API
InstanceDefinition.ArchiveFileStatus Property
 Returns the archive file status of a linked instance definition.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public InstanceDefinitionArchiveFileStatus ArchiveFileStatus { get; }
Public ReadOnly Property ArchiveFileStatus As InstanceDefinitionArchiveFileStatus
	Get
Property Value
Type: InstanceDefinitionArchiveFileStatus
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace