RhinoCommon SDK
Utilities.SafeFrameEnabled Property
Rhino 5 for Windows
 Queries whether or not the Safe Frame is visible.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.30000.17 (5.13.60913.21340)
Syntax
public static bool SafeFrameEnabled { get; }
Public Shared ReadOnly Property SafeFrameEnabled As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
Utilities Class
Rhino.Render Namespace