RhinoCommon API
RenderCustomEventArgs.EventType Property
 The type of the event.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid EventType { get; }
Public ReadOnly Property EventType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderCustomEventArgs Class
Rhino.Render Namespace