RhinoCommon API
RevSurface.Curve Property
 Gets the revolute curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve Curve { get; }
Public ReadOnly Property Curve As Curve
	Get
Property Value
Type: Curve
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RevSurface Class
Rhino.Geometry Namespace