RhinoCommon API
Utilities.UiFramework Property
[Missing <summary> documentation for "P:Rhino.Render.Utilities.UiFramework"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Utilities.UiFrameworks UiFramework { get; }
Public Shared ReadOnly Property UiFramework As Utilities.UiFrameworks
	Get
Property Value
Type: Utilities.UiFrameworks
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Utilities Class
Rhino.Render Namespace