RhinoCommon API
PhysicallyBasedMaterial.SpecularTint Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.SpecularTint"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SpecularTint { get; set; }
Public Property SpecularTint As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace