RhinoCommon API
InstanceDefinitionTableEventArgs.OldState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs.OldState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public InstanceDefinitionGeometry OldState { get; }
Public ReadOnly Property OldState As InstanceDefinitionGeometry
	Get
Property Value
Type: InstanceDefinitionGeometry
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
InstanceDefinitionTableEventArgs Class
Rhino.DocObjects.Tables Namespace