RhinoCommon API
Mesh.TextureCoordinates Property
 Gets access to the vertex texture coordinate collection in this mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshTextureCoordinateList TextureCoordinates { get; }
Public ReadOnly Property TextureCoordinates As MeshTextureCoordinateList
	Get
Property Value
Type: MeshTextureCoordinateList
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Mesh Class
Rhino.Geometry Namespace