RhinoCommon API
DimensionStyle.LeaderArrowType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderArrowType"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyleArrowType LeaderArrowType { get; set; }
Public Property LeaderArrowType As DimensionStyleArrowType
	Get
	Set
Property Value
Type: DimensionStyleArrowType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace