RhinoCommon SDK
BrepRegion.BoundingBox Property
Gets the region bounding box.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public BoundingBox BoundingBox { get; }
Public ReadOnly Property BoundingBox As BoundingBox
	Get
Property Value
Type: BoundingBox
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace