RhinoCommon API
ModelComponent.HasId Property
 Returns a value indicating whether the component has an ID.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasId { get; }
Public ReadOnly Property HasId As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ModelComponent Class
Rhino.DocObjects Namespace