RhinoCommon API
RenderSettings.Snapshot Property
 Set os get the given snapshot view
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Snapshot { get; set; }
Public Property Snapshot As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderSettings Class
Rhino.Render Namespace