RhinoCommon API
ObjectAttributes.ClipParticipationSource Property
 Where clipping plane participation values are read from
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectClipParticipationSource ClipParticipationSource { get; set; }
Public Property ClipParticipationSource As ObjectClipParticipationSource
	Get
	Set
Property Value
Type: ObjectClipParticipationSource
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace