RhinoCommon SDK
MeshPart.VertexCount Property
EndVertexIndex - StartVertexIndex
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int VertexCount { get; }
Public ReadOnly Property VertexCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace