RhinoCommon API
HiddenLineDrawingParameters.IncludeHiddenCurves Property
 Include hidden curves in hidden line drawing (default is true)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IncludeHiddenCurves { get; set; }
Public Property IncludeHiddenCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
HiddenLineDrawingParameters Class
Rhino.Geometry Namespace