RhinoCommon API
Font.PostScriptName Property
 Returns the Font PostScriptName - "Apple font name"
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string PostScriptName { get; }
Public ReadOnly Property PostScriptName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Font Class
Rhino.DocObjects Namespace