RhinoCommon API
GetPointMouseEventArgs.Point Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetPointMouseEventArgs.Point"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Point { get; }
Public ReadOnly Property Point As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetPointMouseEventArgs Class
Rhino.Input.Custom Namespace