RhinoCommon SDK
TextStyleTable.Item Property
 Returns a TextStyle at [index] in the TextStyleTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public TextStyle this[
	int index
] { get; }
Public ReadOnly Default Property Item (
	index As Integer
) As TextStyle
	Get
Parameters
index
Type: System.Int32
Property Value
Type: TextStyle
See Also
Reference
TextStyleTable Class
Rhino.DocObjects.Tables Namespace