RhinoCommon API
DisplayPipelineAttributes.IgnoreHighlights Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.IgnoreHighlights"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IgnoreHighlights { get; set; }
Public Property IgnoreHighlights As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace