RhinoCommon SDK
GetCircle.Deformable Property
 Is the deformable option set
Namespace: Rhino.Input.Custom
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Deformable { get; set; }
Public Property Deformable As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GetCircle Class
Rhino.Input.Custom Namespace