RhinoCommon API
PhysicallyBasedMaterial.BaseColor Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.BaseColor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color4f BaseColor { get; set; }
Public Property BaseColor As Color4f
	Get
	Set
Property Value
Type: Color4f
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace