RhinoCommon SDK
ArcCurve.AngleRadians Property
 Gets the angles of this arc in radians.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double AngleRadians { get; }
Public ReadOnly Property AngleRadians As Double
	Get
Property Value
Type: Double
See Also
Reference
ArcCurve Class
Rhino.Geometry Namespace