RhinoCommon API
LayerTable.Count Property
 Returns number of layers in the layer table, including deleted layers.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
LayerTable Class
Rhino.DocObjects.Tables Namespace