RhinoCommon API
NurbsCurveKnotList.IsClampedEnd Property
 Gets a value indicating whether or not the knot vector is clamped at the end of the curve. Clamped curves are coincident with the first and last control-point. This requires fully multiple knots.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsClampedEnd { get; }
Public ReadOnly Property IsClampedEnd As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
NurbsCurveKnotList Class
Rhino.Geometry.Collections Namespace