RhinoCommon API
GumballAppearanceSettings.PlanarTranslationGripCorner Property
in pixels.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int PlanarTranslationGripCorner { get; set; }
Public Property PlanarTranslationGripCorner As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace