RhinoCommon API
Line.Unset Property
 Gets a line segment which has Unset end points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Line Unset { get; }
Public Shared ReadOnly Property Unset As Line
	Get
Property Value
Type: Line
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Line Structure
Rhino.Geometry Namespace