RhinoCommon API
SimpleArrayPlane.Count Property
 Gets the amount of lines in this array.
 Namespace: Rhino.Runtime.InteropWrappers
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SimpleArrayPlane Class
Rhino.Runtime.InteropWrappers Namespace