RhinoCommon API
Rectangle3d.Center Property
 Gets the point in the center of the rectangle.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d Center { get; }
Public ReadOnly Property Center As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rectangle3d Structure
Rhino.Geometry Namespace