RhinoCommon API
ShutLiningCurveInfo.Radius Property
 The profile radius.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Radius { get; }
Public ReadOnly Property Radius As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ShutLiningCurveInfo Class
Rhino.Geometry Namespace