RhinoCommon API
ObjectEnumeratorSettings.VisibleFilter Property
[Missing <summary> documentation for "P:Rhino.DocObjects.ObjectEnumeratorSettings.VisibleFilter"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool VisibleFilter { get; set; }
Public Property VisibleFilter As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace