RhinoCommon API
MeshingParameters.ComputeCurvature Property
 Gets or sets a value indicating whether or not surface curvature data will be embedded in the mesh.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ComputeCurvature { get; set; }
Public Property ComputeCurvature As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshingParameters Class
Rhino.Geometry Namespace