RhinoCommon API
PhysicallyBasedMaterial.OpacityRoughness Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.OpacityRoughness"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double OpacityRoughness { get; set; }
Public Property OpacityRoughness As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace