RhinoCommon API
DimensionStyle.AngleFormat Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AngleFormat"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.AngleDisplayFormat AngleFormat { get; set; }
Public Property AngleFormat As DimensionStyle.AngleDisplayFormat
	Get
	Set
Property Value
Type: DimensionStyle.AngleDisplayFormat
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace