RhinoCommon API
GetTorus.DefaultSize Property
 Default radius or diameter (based on InDiameterMode)
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double DefaultSize { get; set; }
Public Property DefaultSize As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetTorus Class
Rhino.Input.Custom Namespace