RhinoCommon API
LinearWorkflow.PostProcessGammaOn Property
 Linear workflow gamma
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool PostProcessGammaOn { get; set; }
Public Property PostProcessGammaOn As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace