RhinoCommon API
GroundPlane.Crc Property
 Get the checksum of this groundplane object
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint Crc { get; }
Public ReadOnly Property Crc As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GroundPlane Class
Rhino.Render.ChangeQueue Namespace