RhinoCommon API
FileSettings.TemplateFolder Property
Returns or sets the location of Rhino's template files.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string TemplateFolder { get; set; }
Public Shared Property TemplateFolder As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace