RhinoCommon API
Transform.M13 Property
Gets or sets this[1,3].
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double M13 { get; set; }
Public Property M13 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Transform Structure
Rhino.Geometry Namespace