RhinoCommon API
ViewCapture.RealtimeRenderPasses Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCapture.RealtimeRenderPasses"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int RealtimeRenderPasses { get; set; }
Public Property RealtimeRenderPasses As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewCapture Class
Rhino.Display Namespace