RhinoCommon API
FilePlyWriteOptions.UseSimpleDialog Property
 Determines whether to use the simple or detailed meshing dialog.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UseSimpleDialog { get; set; }
Public Property UseSimpleDialog As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace