RhinoCommon API
PlugIn.LoadTime Property
 Plug-ins are typically loaded on demand when they are first needed. You can change this behavior to load the plug-in at during different stages in time by overriding this property.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual PlugInLoadTime LoadTime { get; }
Public Overridable ReadOnly Property LoadTime As PlugInLoadTime
	Get
Property Value
Type: PlugInLoadTime
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace