RhinoCommon API
ObjectAttributes.LinetypeScale Property
 Per object linetype scale
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double LinetypeScale { get; set; }
Public Property LinetypeScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace