RhinoCommon API
RhinoDoc.UndoRecordingIsActive Property
 true if undo recording is actually happening now.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UndoRecordingIsActive { get; }
Public ReadOnly Property UndoRecordingIsActive As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace