RhinoCommon API
Intersection.UseNewMeshIntersections Property
 Instructs Rhino to provide the new mesh-mesh intersector implementation. This affects also MeshSplit and other commands.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool UseNewMeshIntersections { get; set; }
Public Shared Property UseNewMeshIntersections As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Intersection Class
Rhino.Geometry.Intersect Namespace