RhinoCommon API
PickContext.PickLine Property
 pick chord starts on near clipping plane and ends on far clipping plane.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Line PickLine { get; set; }
Public Property PickLine As Line
	Get
	Set
Property Value
Type: Line
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace