RhinoCommon SDK
AnnotationArrowhead.ArrowheadName Property
 Name of block used for user-defined arrowhead
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string ArrowheadName { get; set; }
Public Property ArrowheadName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnnotationArrowhead Class
Rhino.Geometry Namespace