RhinoCommon API
Light.Name Property
 Gets or sets the spot light name.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Light Class
Rhino.Geometry Namespace