RhinoCommon API
AnnotationBase.ParentDimensionStyle Property
 The parent dimension style associated with this annotation
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle ParentDimensionStyle { get; set; }
Public Property ParentDimensionStyle As DimensionStyle
	Get
	Set
Property Value
Type: DimensionStyle
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace