RhinoCommon API
LicenseStatus.CheckOutExpirationDate Property
 The date and time the checked out license will expire. Note, this is only set if m_license_type = Standalone or CloudZoo and if "limited license checkout" was enabled on the Zoo server in the case of Standalone. Note, date and time is in local time coordinates.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Nullable<DateTime> CheckOutExpirationDate { get; set; }
Public Property CheckOutExpirationDate As Nullable(Of DateTime)
	Get
	Set
Property Value
Type: Nullable<DateTime>
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace