RhinoCommon SDK
RLeader.LeaderScale Property
 Value to scale all sizes in the leader by
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double LeaderScale { get; set; }
Public Property LeaderScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RLeader Class
Rhino.Geometry Namespace