RhinoCommon API
DrawForegroundEventArgs.DrawWorldAxes Property
[Missing <summary> documentation for "P:Rhino.Display.DrawForegroundEventArgs.DrawWorldAxes"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawWorldAxes { get; set; }
Public Property DrawWorldAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DrawForegroundEventArgs Class
Rhino.Display Namespace