RhinoCommon API
Surface.IsSolid Property
 Gets a values indicating whether a surface is solid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual bool IsSolid { get; }
Public Overridable ReadOnly Property IsSolid As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Surface Class
Rhino.Geometry Namespace