RhinoCommon API
Dimension.LengthResolution Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.LengthResolution"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int LengthResolution { get; set; }
Public Property LengthResolution As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Dimension Class
Rhino.Geometry Namespace