RhinoCommon API
File3dmSettings.ModelAbsoluteTolerance Property
Gets or sets the model space absolute tolerance.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ModelAbsoluteTolerance { get; set; }
Public Property ModelAbsoluteTolerance As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmSettings Class
Rhino.FileIO Namespace