RhinoCommon SDK
Decal.Id Property
Rhino 5 for Windows
 Gets the decal ID associated with this decal.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.30000.17 (5.13.60913.21340)
Syntax
public int Id { get; }
Public ReadOnly Property Id As Integer
	Get
Property Value
Type: Int32
See Also
Reference
Decal Class
Rhino.Render Namespace