RhinoCommon API
DisplayPipelineAttributes.UseAssignedObjectMaterial Property
 Gets whether objects ought to be drawn using their assigned rendering material.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool UseAssignedObjectMaterial { get; }
Public ReadOnly Property UseAssignedObjectMaterial As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace