RhinoCommon API
DisplayPipelineAttributes.ShadingEnabled Property
Draw shaded meshes and surfaces. Set to false to use Flat Shading.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShadingEnabled { get; set; }
Public Property ShadingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace