RhinoCommon SDK
File3dm.Revision Property
 Gets or sets the revision number.
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Revision { get; set; }
Public Property Revision As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
File3dm Class
Rhino.FileIO Namespace