RhinoCommon API
NurbsCurve.Order Property
 Gets the order of the curve. Order = Degree + 1.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Order { get; }
Public ReadOnly Property Order As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace