RhinoCommon API
BrepEdge.TrimCount Property
 Gets the number of trim-curves that use this edge.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int TrimCount { get; }
Public ReadOnly Property TrimCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BrepEdge Class
Rhino.Geometry Namespace