RhinoCommon API
GetCircle.DeformablePointCount Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCircle.DeformablePointCount"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int DeformablePointCount { get; set; }
Public Property DeformablePointCount As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetCircle Class
Rhino.Input.Custom Namespace