RhinoCommon API
Symbols.RadiusSymbol Property
 Radius symbol
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static char RadiusSymbol { get; }
Public Shared ReadOnly Property RadiusSymbol As Char
	Get
Property Value
Type: Char
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Symbols Class
Rhino Namespace