RhinoCommon API
PhysicallyBasedMaterial.ReflectiveIOR Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ReflectiveIOR"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ReflectiveIOR { get; set; }
Public Property ReflectiveIOR As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace