RhinoCommon API
FileSettings.ClipboardOnExit Property
 Gets or sets a value that determines what to do with clipboard data on exit.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ClipboardState ClipboardOnExit { get; set; }
Public Shared Property ClipboardOnExit As ClipboardState
	Get
	Set
Property Value
Type: ClipboardState
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace