RhinoCommon API
NurbsSurface.IsRational Property
 Gets a value indicating whether or not the nurbs surface is rational.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsRational { get; }
Public ReadOnly Property IsRational As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
NurbsSurface Class
Rhino.Geometry Namespace