RhinoCommon SDK
RenderPrimitive.HasRenderMaterial Property
Rhino 5 for Windows
 This property will be true if this mesh has a RenderMaterial associated with it or false if there is a Material.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.30000.17 (5.13.60913.21340)
Syntax
public bool HasRenderMaterial { get; }
Public ReadOnly Property HasRenderMaterial As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace