RhinoCommon API
RenderContentEventArgs.Reason Property
 Not when used in CurrentEnvironmentChanged (defaults to None).
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderContentChangeReason Reason { get; }
Public ReadOnly Property Reason As RenderContentChangeReason
	Get
Property Value
Type: RenderContentChangeReason
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderContentEventArgs Class
Rhino.Render Namespace