RhinoCommon API
DraftAngleAnalysisSettingsState.ShowIsoCurves Property
 Show isoparametric curves.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowIsoCurves { get; set; }
Public Property ShowIsoCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DraftAngleAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace