RhinoCommon API
ImageFileEventArgs.FileName Property
[Missing <summary> documentation for "P:Rhino.Render.ImageFileEventArgs.FileName"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FileName { get; }
Public ReadOnly Property FileName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ImageFileEventArgs Class
Rhino.Render Namespace