RhinoCommon API
Dimension.AltUnitsDisplay Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.AltUnitsDisplay"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AltUnitsDisplay { get; set; }
Public Property AltUnitsDisplay As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Dimension Class
Rhino.Geometry Namespace