RhinoCommon API
Material.EmissionColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.EmissionColor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color EmissionColor { get; set; }
Public Property EmissionColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Material Class
Rhino.DocObjects Namespace