RhinoCommon API
GumballAppearanceSettings.TranslateYEnabled Property
 TranslateYEnabled is true, the Y axis translation control is available. The default setting is true.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool TranslateYEnabled { get; set; }
Public Property TranslateYEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GumballAppearanceSettings Class
Rhino.UI.Gumball Namespace