RhinoCommon API
PickContext.PickGroupsEnabled Property
 Thue if GroupObjects should be added to the pick list
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool PickGroupsEnabled { get; set; }
Public Property PickGroupsEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PickContext Class
Rhino.Input.Custom Namespace