RhinoCommon API
IntersectionEvent.ParameterB Property
 Gets the parameter on Curve B where the intersection occured. If the intersection type is overlap, then this will return the start of the overlap region.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ParameterB { get; }
Public ReadOnly Property ParameterB As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
IntersectionEvent Class
Rhino.Geometry.Intersect Namespace