RhinoCommon SDK
RenderEnvironment.CurrentEnvironmentForLighting Property
[Missing <summary> documentation for "P:Rhino.Render.RenderEnvironment.CurrentEnvironmentForLighting"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static RenderEnvironment CurrentEnvironmentForLighting { get; set; }
Public Shared Property CurrentEnvironmentForLighting As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace