RhinoCommon API
PanelIds.ContextHelp Property
 Rhino context sensitive help panel.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid ContextHelp { get; }
Public Shared ReadOnly Property ContextHelp As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PanelIds Class
Rhino.UI Namespace