RhinoCommon API
ObjectAttributes.LinetypeSource Property
 The Linetype used to display an object is specified in one of two ways. If LinetypeSource is ON::linetype_from_layer, then the object's layer ON_Layer::Linetype() is used. If LinetypeSource is ON::linetype_from_object, then value of m_linetype is used.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectLinetypeSource LinetypeSource { get; set; }
Public Property LinetypeSource As ObjectLinetypeSource
	Get
	Set
Property Value
Type: ObjectLinetypeSource
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace