RhinoCommon API
AnnotationBase.Plane Property
 Plane that this annotation lies on
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace