RhinoCommon API
Utilities.ShowIncompatibleTextures Property
 Specifies whether incompatible content should be shown in the corresponding editor.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ShowIncompatibleTextures { get; set; }
Public Shared Property ShowIncompatibleTextures As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Utilities Class
Rhino.Render Namespace