RhinoCommon SDK
RenderContentAddedEventArgs.Reason Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContentAddedEventArgs.Reason"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RenderContentAddedReason Reason { get; }
Public ReadOnly Property Reason As RenderContentAddedReason
	Get
Property Value
Type: RenderContentAddedReason
See Also
Reference
RenderContentAddedEventArgs Class
Rhino.Render Namespace