RhinoCommon API
FilePlyWriteOptions.MeshingParameters Property
[Missing <summary> documentation for "P:Rhino.FileIO.FilePlyWriteOptions.MeshingParameters"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public MeshingParameters MeshingParameters { get; set; }
Public Property MeshingParameters As MeshingParameters
	Get
	Set
Property Value
Type: MeshingParameters
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
FilePlyWriteOptions Class
Rhino.FileIO Namespace