RhinoCommon API
SafeFrame.TitleFrameYScale Property
 Title Frame Scale Y
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TitleFrameYScale { get; set; }
Public Property TitleFrameYScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SafeFrame Class
Rhino.Render Namespace