RhinoCommon API
RenderSettings.Dithering Property
 Get the document dithering interface
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Dithering Dithering { get; }
Public ReadOnly Property Dithering As Dithering
	Get
Property Value
Type: Dithering
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderSettings Class
Rhino.Render Namespace