RhinoCommon API
RhinoView.ActiveViewportID Property
 Returns viewport ID for the active viewport. Faster than ActiveViewport function when working with page views.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual Guid ActiveViewportID { get; }
Public Overridable ReadOnly Property ActiveViewportID As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoView Class
Rhino.Display Namespace