RhinoCommon API
TransformObjectList.GripCount Property
 Number of elements in grip list
 Namespace: Rhino.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int GripCount { get; }
Public ReadOnly Property GripCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
TransformObjectList Class
Rhino.Collections Namespace