RhinoCommon SDK
RuiUpdateUi.MenuItemId Property
Id of the menu item that owns this menu item
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid MenuItemId { get; }
Public ReadOnly Property MenuItemId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace