RhinoCommon API
Command.LocalName Property
 Gets the local name of the command.
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual string LocalName { get; }
Public Overridable ReadOnly Property LocalName As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Command Class
Rhino.Commands Namespace