RhinoCommon SDK
RenderEnvironmentTable.Document Property
[Missing <summary> documentation for "P:Rhino.Render.RenderEnvironmentTable.Document"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RenderEnvironmentTable Class
Rhino.Render Namespace