RhinoCommon API
LengthValue.UnitSystem Property
 UnitSystem used by this LengthValue
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UnitSystem UnitSystem { get; }
Public ReadOnly Property UnitSystem As UnitSystem
	Get
Property Value
Type: UnitSystem
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LengthValue Class
Rhino Namespace