RhinoCommon API
File3dm.AllNamedConstructionPlanes Property
 Named construction planes in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmNamedConstructionPlanes AllNamedConstructionPlanes { get; }
Public ReadOnly Property AllNamedConstructionPlanes As File3dmNamedConstructionPlanes
	Get
Property Value
Type: File3dmNamedConstructionPlanes
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dm Class
Rhino.FileIO Namespace