RhinoCommon API
ObjectPropertiesPageEventArgs.Page Property
 The page sending these arguments
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectPropertiesPage Page { get; }
Public ReadOnly Property Page As ObjectPropertiesPage
	Get
Property Value
Type: ObjectPropertiesPage
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace