RhinoCommon API
ViewCaptureSettings.DrawSelectedObjectsOnly Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.DrawSelectedObjectsOnly"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DrawSelectedObjectsOnly { get; set; }
Public Property DrawSelectedObjectsOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace