RhinoCommon API
RenderContent.ProxyType Property
 Gets the proxy type of the render content
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ProxyTypes ProxyType { get; }
Public ReadOnly Property ProxyType As ProxyTypes
	Get
Property Value
Type: ProxyTypes
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderContent Class
Rhino.Render Namespace