RhinoCommon API
SubDCreationOptions.InteriorCreaseAtMeshCrease Property
 Create an interior sub-D crease along coincident input mesh edges where the vertex normal directions at one end differ by at least 30 degrees.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static SubDCreationOptions InteriorCreaseAtMeshCrease { get; }
Public Shared ReadOnly Property InteriorCreaseAtMeshCrease As SubDCreationOptions
	Get
Property Value
Type: SubDCreationOptions
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace