RhinoCommon API
Material.Transparency Property
 Gets or sets the transparency of the material (0.0 = opaque to 1.0 = transparent)
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Transparency { get; set; }
Public Property Transparency As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Material Class
Rhino.DocObjects Namespace