RhinoCommon API
ViewInfo.Description Property
 Gets or sets the contents, or description, of the view.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewInfo Class
Rhino.DocObjects Namespace