RhinoCommon API
PhysicallyBasedMaterial.Anisotropic Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.Anisotropic"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Anisotropic { get; set; }
Public Property Anisotropic As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace