RhinoCommon API
Arc.EndAngle Property
 Gets or sets the end angle (in Radians) for this arc segment.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double EndAngle { get; set; }
Public Property EndAngle As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Arc Structure
Rhino.Geometry Namespace