RhinoCommon API
RhinoModifyObjectAttributesEventArgs.NewAttributes Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoModifyObjectAttributesEventArgs.NewAttributes"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ObjectAttributes NewAttributes { get; }
Public ReadOnly Property NewAttributes As ObjectAttributes
	Get
Property Value
Type: ObjectAttributes
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoModifyObjectAttributesEventArgs Class
Rhino.DocObjects Namespace