RhinoCommon API
CreatePreviewEventArgs.Lights Property
[Missing <summary> documentation for "P:Rhino.Render.CreatePreviewEventArgs.Lights"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public List<Light> Lights { get; }
Public ReadOnly Property Lights As List(Of Light)
	Get
Property Value
Type: List<Light>
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace