RhinoCommon API
SubDVertexList.Count Property
 Gets the number of SubD vertices.
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SubDVertexList Class
Rhino.Geometry.Collections Namespace