RhinoCommon SDK
MeshVertexHiddenList.HiddenCount Property
 Gets a value indicating how many vertices have been set to hidden.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int HiddenCount { get; }
Public ReadOnly Property HiddenCount As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshVertexHiddenList Class
Rhino.Geometry.Collections Namespace