RhinoCommon SDK
RLeader.ContentAngleStyle Property
 How content angle aligns with leader tail
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public LeaderContentAngleStyle ContentAngleStyle { get; set; }
Public Property ContentAngleStyle As LeaderContentAngleStyle
	Get
	Set
Property Value
Type: LeaderContentAngleStyle
See Also
Reference
RLeader Class
Rhino.Geometry Namespace