RhinoCommon API
AppearanceSettings.DefaultFontFaceName Property
 Gets or sets the default font face name used in Rhino.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string DefaultFontFaceName { get; set; }
Public Shared Property DefaultFontFaceName As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
AppearanceSettings Class
Rhino.ApplicationSettings Namespace