RhinoCommon API
RhinoDoc.CurrentEnvironment Property
 Access to the current environment for various uses
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public ICurrentEnvironment CurrentEnvironment { get; }
Public ReadOnly Property CurrentEnvironment As ICurrentEnvironment
	Get
Property Value
Type: ICurrentEnvironment
See Also
Reference
RhinoDoc Class
Rhino Namespace