RhinoCommon API
FontQuartet.EnglishQuartetName Property
[Missing <summary> documentation for "P:Rhino.DocObjects.FontQuartet.EnglishQuartetName"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string EnglishQuartetName { get; }
Public ReadOnly Property EnglishQuartetName As String
	Get
Property Value
Type: String
See Also
Reference
FontQuartet Class
Rhino.DocObjects Namespace