RhinoCommon API
ViewportInfo.FrustumTop Property
 Gets the frustum top value. This is -bottom if the frustum has a horizontal symmetry axis.
This number is usually positive.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double FrustumTop { get; }
Public ReadOnly Property FrustumTop As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace