RhinoCommon API
SweepOneRail.IsRoadlikeFront Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepOneRail.IsRoadlikeFront"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsRoadlikeFront { get; }
Public ReadOnly Property IsRoadlikeFront As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
SweepOneRail Class
Rhino.Geometry Namespace