RhinoCommon SDK
Sun.Longitude Property
[Missing <summary> documentation for "P:Rhino.Render.Sun.Longitude"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Longitude { get; }
Public ReadOnly Property Longitude As Double
	Get
Property Value
Type: Double
See Also
Reference
Sun Class
Rhino.Render Namespace