RhinoCommon API
AppearanceSettingsState.WorldCoordIconYAxisColor Property
Gets or sets the color of the world Y axis of the world coordinate icon, appearing usually bottom left in viewports.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color WorldCoordIconYAxisColor { get; set; }
Public Property WorldCoordIconYAxisColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace