RhinoCommon API
PhysicallyBasedMaterial.OpacityIOR Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.OpacityIOR"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double OpacityIOR { get; set; }
Public Property OpacityIOR As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace