RhinoCommon API
RenderMaterialTable.Count Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterialTable.Count"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderMaterialTable Class
Rhino.Render Namespace