RhinoCommon API
RenderContent.DocumentRegistered Property
 If this content is used by a document, including not in the content lists (for example, as a decal), the document will be returned. Otherwise null.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public RhinoDoc DocumentRegistered { get; }
Public ReadOnly Property DocumentRegistered As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
RenderContent Class
Rhino.Render Namespace