RhinoCommon API
GetEllipsoid.FirstPoint Property
 Returns the first point. If in "from foci" mode, then this is the first foci point.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d FirstPoint { get; }
Public ReadOnly Property FirstPoint As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetEllipsoid Class
Rhino.Input.Custom Namespace