RhinoCommon API
FileSettings.AutoSaveEnabled Property
Enables or disables Rhino's automatic file saving mechanism.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool AutoSaveEnabled { get; set; }
Public Shared Property AutoSaveEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace