RhinoCommon API
StringParserSettings.ParseSignificandDigitSeparators Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseSignificandDigitSeparators"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseSignificandDigitSeparators { get; set; }
Public Property ParseSignificandDigitSeparators As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace