RhinoCommon API
FileWriteOptions.SuppressAllInput Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.SuppressAllInput"]
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SuppressAllInput { get; set; }
Public Property SuppressAllInput As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace