RhinoCommon API
Point3d.MaximumCoordinate Property
 Gets the largest (both positive and negative) valid coordinate in this point, or RhinoMath.UnsetValue if no coordinate is valid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MaximumCoordinate { get; }
Public ReadOnly Property MaximumCoordinate As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Point3d Structure
Rhino.Geometry Namespace