RhinoCommon SDK
MouseCursor.Location Property
 Retrieves the position of the mouse cursor, in screen coordinates
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static Point2d Location { get; }
Public Shared ReadOnly Property Location As Point2d
	Get
Property Value
Type: Point2d
See Also
Reference
MouseCursor Class
Rhino.UI Namespace