RhinoCommon API
CurvatureAnalysisSettingsState.GaussRange Property
 Gets or sets the Gaussian curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Interval GaussRange { get; set; }
Public Property GaussRange As Interval
	Get
	Set
Property Value
Type: Interval
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
CurvatureAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace