RhinoCommon API
GetColorEventArgs.InputColor Property
[Missing <summary> documentation for "P:Rhino.UI.GetColorEventArgs.InputColor"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color InputColor { get; }
Public ReadOnly Property InputColor As Color
	Get
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetColorEventArgs Class
Rhino.UI Namespace