RhinoCommon API
CursorTooltipSettings.OsnapPane Property
 Displays the current object snap selection.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool OsnapPane { get; set; }
Public Shared Property OsnapPane As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace