RhinoCommon API
MeshCheckParameters.CheckForDegenerateFaces Property
 If true, then look for triangles and quads that have zero area and quads where one sub triangle has zero area.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CheckForDegenerateFaces { get; set; }
Public Property CheckForDegenerateFaces As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace