RhinoCommon API
ViewCaptureWriter.Pen.Color Property
[Missing <summary> documentation for "P:Rhino.Runtime.ViewCaptureWriter.Pen.Color"]
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color Color { get; }
Public ReadOnly Property Color As Color
	Get
Property Value
Type: Color
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewCaptureWriter.Pen Class
Rhino.Runtime Namespace