RhinoCommon API
HiddenLineDrawingPoint.Index Property
 Index of this object in HiddenLineDrawing.Points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
HiddenLineDrawingPoint Class
Rhino.Geometry Namespace