RhinoCommon API
ComponentStatus.SelectedPersistent Property
 The persistent selection flag is checked.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static ComponentStatus SelectedPersistent { get; }
Public Shared ReadOnly Property SelectedPersistent As ComponentStatus
	Get
Property Value
Type: ComponentStatus
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ComponentStatus Structure
Rhino.Geometry Namespace