RhinoCommon API
RealtimeDisplayMode.Locked Property
[Missing <summary> documentation for "P:Rhino.Render.RealtimeDisplayMode.Locked"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Locked { get; set; }
Public Property Locked As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RealtimeDisplayMode Class
Rhino.Render Namespace