RhinoCommon API
FileSettings.FileLockingEnabled Property
Ensure that only one person at a time can have a file open for saving.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool FileLockingEnabled { get; set; }
Public Shared Property FileLockingEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace