RhinoCommon API
DimensionStyle.ArcLengthSymbol Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.ArcLengthSymbol"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ArcLengthSymbol { get; set; }
Public Property ArcLengthSymbol As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace