RhinoCommon API
Notification.ShowEventId Property
 A field used by Rhino for displaying notifications. Not intended for public use.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Nullable<Guid> ShowEventId { get; }
Public ReadOnly Property ShowEventId As Nullable(Of Guid)
	Get
Property Value
Type: Nullable<Guid>
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace