RhinoCommon API
RenderMaterial.PhysicallyBased.ChildSlotNames.Anisotropic Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PhysicallyBased.ChildSlotNames.Anisotropic"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Anisotropic { get; }
Public Shared ReadOnly Property Anisotropic As String
	Get
Property Value
Type: String
See Also
Reference
RenderMaterial.PhysicallyBased.ChildSlotNames Class
Rhino.Render Namespace