RhinoCommon API
UserDataListEnumerator.Current Property
 Get current UserData on the enumerator.
 Namespace: Rhino.DocObjects.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public UserData Current { get; }
Public ReadOnly Property Current As UserData
	Get
Property Value
Type: UserData
Implements
IEnumerator<T>.Current
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
UserDataListEnumerator Class
Rhino.DocObjects.Custom Namespace