RhinoCommon API
FileSettings.SaveViewChanges Property
true for users who consider view changes a document change.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool SaveViewChanges { get; set; }
Public Shared Property SaveViewChanges As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace