RhinoCommon API
LicenseStatus.BuildType Property
 The build contentType of the product, where: 100 = A release build, either commercical, education, nfr, etc. 200 = A evaluation build 300 = A beta build, such as a wip.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public LicenseBuildType BuildType { get; set; }
Public Property BuildType As LicenseBuildType
	Get
	Set
Property Value
Type: LicenseBuildType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace