RhinoCommon SDK
SweepTwoRail.SweepTolerance Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepTwoRail.SweepTolerance"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double SweepTolerance { get; set; }
Public Property SweepTolerance As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace