RhinoCommon API
RhinoTransformObjectsEventArgs.Objects Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoTransformObjectsEventArgs.Objects"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoObject[] Objects { get; }
Public ReadOnly Property Objects As RhinoObject()
	Get
Property Value
Type: RhinoObject[]
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoTransformObjectsEventArgs Class
Rhino.DocObjects Namespace