RhinoCommon SDK
RenderEnvironment.CurrentEnvironmentForBackground Property
[Missing <summary> documentation for "P:Rhino.Render.RenderEnvironment.CurrentEnvironmentForBackground"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public static RenderEnvironment CurrentEnvironmentForBackground { get; set; }
Public Shared Property CurrentEnvironmentForBackground As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
See Also
Reference
RenderEnvironment Class
Rhino.Render Namespace