RhinoCommon API
RenderMaterial.PhysicallyBased.ParametersNames.ClearcoatRoughness Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PhysicallyBased.ParametersNames.ClearcoatRoughness"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string ClearcoatRoughness { get; }
Public Shared ReadOnly Property ClearcoatRoughness As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderMaterial.PhysicallyBased.ParametersNames Class
Rhino.Render Namespace