RhinoCommon API
GetEllipsoid.SecondPoint Property
 Returns the second point. If in "from foci" mode, then this is the second foci point.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d SecondPoint { get; }
Public ReadOnly Property SecondPoint As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetEllipsoid Class
Rhino.Input.Custom Namespace