RhinoCommon API
GeneralSettingsState.MiddleMousePopupToolbar Property
 Gets or sets the toolbar to popup when the middle mouse is clicked on a view, this value is only used when MiddleMouseMode is set to PopupToolbar.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string MiddleMousePopupToolbar { get; set; }
Public Property MiddleMousePopupToolbar As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace