RhinoCommon API
MaterialRefCreateParams.BackFaceMaterialIndex Property
 The index of the material used to render the back of an object
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int BackFaceMaterialIndex { get; set; }
Public Property BackFaceMaterialIndex As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace