RhinoCommon SDK
RLeader.CurveType Property
 Shape of the curve used by this leader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public LeaderCurveType CurveType { get; set; }
Public Property CurveType As LeaderCurveType
	Get
	Set
Property Value
Type: LeaderCurveType
See Also
Reference
RLeader Class
Rhino.Geometry Namespace