RhinoCommon API
StackedDialogPage.LocalPageTitle Property
 Localized page title that will appear on a tab or other page navigation control. This is also uses as a command line option when scripting this page.
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual string LocalPageTitle { get; }
Public Overridable ReadOnly Property LocalPageTitle As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace