RhinoCommon API
MeshInstance.GroupId Property
 Get identifier that specifies the grouping of these mesh instances - usually based on the object that this originally comprised.
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public uint GroupId { get; }
Public ReadOnly Property GroupId As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace