RhinoCommon API
DimensionStyle.AlternatePrefix Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.AlternatePrefix"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string AlternatePrefix { get; set; }
Public Property AlternatePrefix As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace