RhinoCommon API
MeshDisplacementInfo.Texture Property
 The texture used as displacement.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderTexture Texture { get; }
Public ReadOnly Property Texture As RenderTexture
	Get
Property Value
Type: RenderTexture
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace