RhinoCommon API
RenderContent.Document Property
 If this content is in a document content list, the document will be returned. Otherwise null.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderContent Class
Rhino.Render Namespace