RhinoCommon API
TextFields.InstanceAttributeField.Key Property
 Attribute key
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Key { get; }
Public ReadOnly Property Key As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextFields.InstanceAttributeField Class
Rhino.Runtime Namespace