RhinoCommon API
Material.PhysicallyBased Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.PhysicallyBased"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PhysicallyBasedMaterial PhysicallyBased { get; }
Public ReadOnly Property PhysicallyBased As PhysicallyBasedMaterial
	Get
Property Value
Type: PhysicallyBasedMaterial
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Material Class
Rhino.DocObjects Namespace