RhinoCommon API
RealtimeDisplayModeClassInfo.GUID Property
 Get the RealtimeDisplayMode implementation GUID
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract Guid GUID { get; }
Public MustOverride ReadOnly Property GUID As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RealtimeDisplayModeClassInfo Class
Rhino.Render Namespace