RhinoCommon API
SafeFrame.FieldsOn Property
 Show a 4 by 3 grid in the safe-frame.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool FieldsOn { get; set; }
Public Property FieldsOn As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SafeFrame Class
Rhino.Render Namespace