RhinoCommon API
DisplayPipelineAttributes.AmbientLightingColor Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPipelineAttributes.AmbientLightingColor"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color AmbientLightingColor { get; set; }
Public Property AmbientLightingColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace