RhinoCommon API
LicenseData.LicenseExpires Property
[Missing <summary> documentation for "P:Rhino.PlugIns.LicenseData.LicenseExpires"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool LicenseExpires { get; }
Public ReadOnly Property LicenseExpires As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace