RhinoCommon API
HistorySettings.UpdateEnabled Property
 When history update is enabled, dependant objects are automatically updated when an antecedent is modified.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool UpdateEnabled { get; set; }
Public Shared Property UpdateEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
HistorySettings Class
Rhino.ApplicationSettings Namespace