RhinoCommon API
FileSettings.ExecutableFolder Property
Returns the directory where the main Rhino executable is located.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string ExecutableFolder { get; }
Public Shared ReadOnly Property ExecutableFolder As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace