RhinoCommon API
ICurrentEnvironment_Get.ForBackground Property
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment_Get.ForBackground"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
RenderEnvironment ForBackground { get; }
ReadOnly Property ForBackground As RenderEnvironment
	Get
Property Value
Type: RenderEnvironment
See Also
Reference
ICurrentEnvironment_Get Interface
Rhino.Render Namespace