RhinoCommon API
RenderSettings.RenderMeshEdges Property
 Gets or sets a value indicating whether to instruct the rendering engine to show mesh edges.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RenderMeshEdges { get; set; }
Public Property RenderMeshEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderSettings Class
Rhino.Render Namespace