RhinoCommon API
MeshCheckParameters.UnusedVertexCount Property
 Gets the total count of unused vertices for all meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int UnusedVertexCount { get; }
Public ReadOnly Property UnusedVertexCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace