RhinoCommon API
RenderMaterial.PhysicallyBased.ChildSlotNames.SubsurfaceScatteringColor Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PhysicallyBased.ChildSlotNames.SubsurfaceScatteringColor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string SubsurfaceScatteringColor { get; }
Public Shared ReadOnly Property SubsurfaceScatteringColor As String
	Get
Property Value
Type: String
See Also
Reference
RenderMaterial.PhysicallyBased.ChildSlotNames Class
Rhino.Render Namespace