RhinoCommon SDK
ViewportInfo.CameraZ Property
 Gets the unit vector in -CameraDirection.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Vector3d CameraZ { get; }
Public ReadOnly Property CameraZ As Vector3d
	Get
Property Value
Type: Vector3d
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace