RhinoCommon API
ICurrentEnvironment.ForAnyUsage Property
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment.ForAnyUsage"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
RenderEnvironment ForAnyUsage { set; }
WriteOnly Property ForAnyUsage As RenderEnvironment
	Set
Property Value
Type: RenderEnvironment
See Also
Reference
ICurrentEnvironment Interface
Rhino.Render Namespace