RhinoCommon SDK
AngularDimensionObject.DimensionStyle Property
 Gets the DimensionStyle associated with this AngularDimensionObject.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle DimensionStyle { get; }
Public ReadOnly Property DimensionStyle As DimensionStyle
	Get
Property Value
Type: DimensionStyle
See Also
Reference
AngularDimensionObject Class
Rhino.DocObjects Namespace