RhinoCommon SDK
RLeaderObject.LeaderGeometry Property
 Get the Leader geometry for this object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RLeader LeaderGeometry { get; set; }
Public Property LeaderGeometry As RLeader
	Get
	Set
Property Value
Type: RLeader
See Also
Reference
RLeaderObject Class
Rhino.DocObjects Namespace