RhinoCommon API
GroupTable.Document Property
Document that owns this group table.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace