RhinoCommon API
ObjectAttributes.ReceivesShadows Property
 Gets or sets an object's receives shadows property, or whether or not an object receives shadows from other objects.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ReceivesShadows { get; set; }
Public Property ReceivesShadows As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectAttributes Class
Rhino.DocObjects Namespace