RhinoCommon API
Extrusion.ProfileCount Property
 Gets the amount of profile curves.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ProfileCount { get; }
Public ReadOnly Property ProfileCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace