RhinoCommon API
StringParserSettings.ParseHyphenAsNumberDash Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseHyphenAsNumberDash"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseHyphenAsNumberDash { get; set; }
Public Property ParseHyphenAsNumberDash As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace