RhinoCommon API
File3dmInstanceDefinitionTable.ComponentType Property
 Returns InstanceDefinition.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmInstanceDefinitionTable Class
Rhino.FileIO Namespace