RhinoCommon API
FileObjWriteOptions.ExportNormals Property
 Enable/disable export of vertex normals, if they exist.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExportNormals { get; set; }
Public Property ExportNormals As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileObjWriteOptions Class
Rhino.FileIO Namespace