RhinoCommon API
BoundingBox.Diagonal Property
 Gets the diagonal vector of this BoundingBox. The diagonal connects the Min and Max points.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d Diagonal { get; }
Public ReadOnly Property Diagonal As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
BoundingBox Structure
Rhino.Geometry Namespace