RhinoCommon API
SubDCreationOptions.InteriorCreaseTest Property
 how interior creases are treated
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SubDCreationOptions.InteriorCreaseOption InteriorCreaseTest { get; set; }
Public Property InteriorCreaseTest As SubDCreationOptions.InteriorCreaseOption
	Get
	Set
Property Value
Type: SubDCreationOptions.InteriorCreaseOption
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace