RhinoCommon API
ModelAidSettings.NudgeMode Property
0 = world, 1 = cplane, 2 = view, 3 = uvn, -1 = not set.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int NudgeMode { get; set; }
Public Shared Property NudgeMode As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ModelAidSettings Class
Rhino.ApplicationSettings Namespace