RhinoCommon API
DraftAngleAnalysisSettings.UpDirection Property
 The up direction.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Vector3d UpDirection { get; set; }
Public Shared Property UpDirection As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DraftAngleAnalysisSettings Class
Rhino.ApplicationSettings Namespace