RhinoCommon API
DimensionStyle.SuppressExtension1 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.SuppressExtension1"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SuppressExtension1 { get; set; }
Public Property SuppressExtension1 As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace