RhinoCommon API
PlugInInfo.FileTypeExtensions Property
 Returns the file types extensions supported for file import and file export plug-in.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string[] FileTypeExtensions { get; }
Public ReadOnly Property FileTypeExtensions As String()
	Get
Property Value
Type: String[]
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace