RhinoCommon SDK
MeshPoint.Mesh Property
 The mesh that is ralated to this point.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Mesh Mesh { get; }
Public ReadOnly Property Mesh As Mesh
	Get
Property Value
Type: Mesh
See Also
Reference
MeshPoint Class
Rhino.Geometry Namespace