RhinoCommon API
HostUtils.RunningOnWindows Property
 Tests if this process is currently executing on the Windows platform.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool RunningOnWindows { get; }
Public Shared ReadOnly Property RunningOnWindows As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace