RhinoCommon API
QuadRemeshParameters.TargetQuadCount Property
 The number of quads to try to achieve in the final remeshed object
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int TargetQuadCount { get; set; }
Public Property TargetQuadCount As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
QuadRemeshParameters Class
Rhino.Geometry Namespace