RhinoCommon API
RenderMaterial.PhysicallyBased.ChildSlotNames.AnisotropicRotation Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PhysicallyBased.ChildSlotNames.AnisotropicRotation"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string AnisotropicRotation { get; }
Public Shared ReadOnly Property AnisotropicRotation As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderMaterial.PhysicallyBased.ChildSlotNames Class
Rhino.Render Namespace