RhinoCommon API
Interval.T1 Property
 Gets or sets the upper bound of the Interval.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double T1 { get; set; }
Public Property T1 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Interval Structure
Rhino.Geometry Namespace