RhinoCommon API
InstanceDefinition.IsTenuous Property
[Missing <summary> documentation for "P:Rhino.DocObjects.InstanceDefinition.IsTenuous"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public bool IsTenuous { get; }
Public ReadOnly Property IsTenuous As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
InstanceDefinition Class
Rhino.DocObjects Namespace