RhinoCommon API
Extrusion.PathStart Property
 Gets the start point of the path.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PathStart { get; }
Public ReadOnly Property PathStart As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Extrusion Class
Rhino.Geometry Namespace