RhinoCommon API
GroundPlane.ShadowOnly Property
 Determines whether the ground plane shows the material assigned, or whether it is transparent, but captures shadows.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShadowOnly { get; set; }
Public Property ShadowOnly As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GroundPlane Class
Rhino.Render Namespace