RhinoCommon API
DraftAngleAnalysisSettingsState.UpDirection Property
 The up direction.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d UpDirection { get; set; }
Public Property UpDirection As Vector3d
	Get
	Set
Property Value
Type: Vector3d
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DraftAngleAnalysisSettingsState Class
Rhino.ApplicationSettings Namespace