RhinoCommon API
ModelAidSettingsState.Planar Property
Gets or sets the enabled state of Rhino's Planar modeling aid.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Planar { get; set; }
Public Property Planar As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace