RhinoCommon API
GetCancel.ProgressReporting Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCancel.ProgressReporting"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ProgressReporting { get; set; }
Public Property ProgressReporting As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace