RhinoCommon API
DimensionStyle.MaskColor Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.MaskColor"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color MaskColor { get; set; }
Public Property MaskColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace