RhinoCommon API
File3dmWriteOptions.SaveAnalysisMeshes Property
 Include analysis meshes in the file. Default is true
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SaveAnalysisMeshes { get; set; }
Public Property SaveAnalysisMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Obsolete (compiler warning) in 7.0
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace