RhinoCommon API
MeshCheckParameters.CheckForBadNormals Property
 If true, then then look for vertex normals that are not unit vectors, are zero length or vary greatly from the general direction of the face normals.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool CheckForBadNormals { get; set; }
Public Property CheckForBadNormals As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace