RhinoCommon API
ObjectTable.ComponentType Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.ObjectTable.ComponentType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Implements
ICommonComponentTable<T>.ComponentType
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace