RhinoCommon SDK
TextStyle.FaceName Property
 Font face name of the font used by this style
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string FaceName { get; set; }
Public Property FaceName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
TextStyle Class
Rhino.DocObjects Namespace