RhinoCommon API
SelectionFilterSettingsState.SubObjectSelect Property
 Enables or disabled sub-object selection.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SubObjectSelect { get; set; }
Public Property SubObjectSelect As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SelectionFilterSettingsState Class
Rhino.ApplicationSettings Namespace