RhinoCommon SDK
LinearWorkflow.Gamma Property
 Get gamma
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public float Gamma { get; }
Public ReadOnly Property Gamma As Single
	Get
Property Value
Type: Single
See Also
Reference
LinearWorkflow Class
Rhino.Render.ChangeQueue Namespace