RhinoCommon API
DisplayPipelineAttributes.UseCustomObjectMaterial Property
 Gets whether objects ought to be drawn using a custom material.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool UseCustomObjectMaterial { get; }
Public ReadOnly Property UseCustomObjectMaterial As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace