RhinoCommon API
PersistentSettings.StringListRootKey Property
 Adding this string to a string list when calling SetStringList will cause the ProgramData setting to get inserted at that location in the list.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string StringListRootKey { get; }
Public Shared ReadOnly Property StringListRootKey As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PersistentSettings Class
Rhino Namespace