RhinoCommon SDK
Color4fField.SystemColorValue Property
 Gets or sets the field value
Namespace: Rhino.Render.Fields
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Color SystemColorValue { get; set; }
Public Property SystemColorValue As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
Color4fField Class
Rhino.Render.Fields Namespace