RhinoCommon API
RenderContent.Xml Property
[Missing <summary> documentation for "P:Rhino.Render.RenderContent.Xml"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Xml { get; }
Public ReadOnly Property Xml As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderContent Class
Rhino.Render Namespace