RhinoCommon API
DimensionStyle.LeaderArrowBlockId Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderArrowBlockId"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid LeaderArrowBlockId { get; set; }
Public Property LeaderArrowBlockId As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace