RhinoCommon API
DraftAngleAnalysisSettings.ShowIsoCurves Property
 Show isoparametric curves.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool ShowIsoCurves { get; set; }
Public Shared Property ShowIsoCurves As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DraftAngleAnalysisSettings Class
Rhino.ApplicationSettings Namespace