RhinoCommon SDK
ObjectEnumeratorSettings.ViewportFilter Property
 Filter on value of object->IsActiveInViewport()
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoViewport ViewportFilter { get; set; }
Public Property ViewportFilter As RhinoViewport
	Get
	Set
Property Value
Type: RhinoViewport
See Also
Reference
ObjectEnumeratorSettings Class
Rhino.DocObjects Namespace