RhinoCommon API
RhinoObjectSelectionEventArgs.Document Property
[Missing <summary> documentation for "P:Rhino.DocObjects.RhinoObjectSelectionEventArgs.Document"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoObjectSelectionEventArgs Class
Rhino.DocObjects Namespace