RhinoCommon API
CursorTooltipSettings.AutoSuppress Property
 Attempts to display only the most useful tooltip.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool AutoSuppress { get; set; }
Public Shared Property AutoSuppress As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace