RhinoCommon API
OptionInteger.InitialValue Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.OptionInteger.InitialValue"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int InitialValue { get; }
Public ReadOnly Property InitialValue As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
OptionInteger Class
Rhino.Input.Custom Namespace