RhinoCommon API
ComponentFunctionInfo.InputDescriptions Property
 The function input parameter descriptions.
 Namespace: Rhino.NodeInCode
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IReadOnlyList<string> InputDescriptions { get; }
Public ReadOnly Property InputDescriptions As IReadOnlyList(Of String)
	Get
Property Value
Type: IReadOnlyList<String>
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ComponentFunctionInfo Class
Rhino.NodeInCode Namespace