RhinoCommon API
DimensionStyle.LeaderTextRotationDegrees Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderTextRotationDegrees"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double LeaderTextRotationDegrees { get; set; }
Public Property LeaderTextRotationDegrees As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace