RhinoCommon API
DimensionStyle.LeaderLandingLength Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderLandingLength"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double LeaderLandingLength { get; set; }
Public Property LeaderLandingLength As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace