RhinoCommon API
Notification.ButtonClicked Property
 An Action that will be invoked whenever a button for the notification is clicked or the notification is closed.
 Namespace: Rhino.Runtime.Notifications
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Action<ButtonType> ButtonClicked { get; set; }
Public Property ButtonClicked As Action(Of ButtonType)
	Get
	Set
Property Value
Type: Action<ButtonType>
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Notification Class
Rhino.Runtime.Notifications Namespace