RhinoCommon API
ViewCaptureSettings.UsePrintWidths Property
[Missing <summary> documentation for "P:Rhino.Display.ViewCaptureSettings.UsePrintWidths"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool UsePrintWidths { get; set; }
Public Property UsePrintWidths As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace