RhinoCommon API
RhinoDoc.PostEffects Property
 Access to the post effects
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public PostEffects PostEffects { get; }
Public ReadOnly Property PostEffects As PostEffects
	Get
Property Value
Type: PostEffects
See Also
Reference
RhinoDoc Class
Rhino Namespace