RhinoCommon API
DimStyleTableEventArgs.OldState Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Tables.DimStyleTableEventArgs.OldState"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle OldState { get; }
Public ReadOnly Property OldState As DimensionStyle
	Get
Property Value
Type: DimensionStyle
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimStyleTableEventArgs Class
Rhino.DocObjects.Tables Namespace