RhinoCommon API
PersistentSettings.HiddenFromUserInterface Property
 If false then values will appear in the EditOptions window
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HiddenFromUserInterface { get; set; }
Public Property HiddenFromUserInterface As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PersistentSettings Class
Rhino Namespace