RhinoCommon API
PhysicallyBasedMaterial.SubsurfaceScatteringRadius Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.SubsurfaceScatteringRadius"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SubsurfaceScatteringRadius { get; set; }
Public Property SubsurfaceScatteringRadius As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace