RhinoCommon API
PhysicallyBasedMaterial.Opacity Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.Opacity"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Opacity { get; set; }
Public Property Opacity As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace