RhinoCommon API
NurbsCurve.HasBezierSpans Property
 Returns true if the NURBS curve has bezier spans (all distinct knots have multiplitity = degree)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasBezierSpans { get; }
Public ReadOnly Property HasBezierSpans As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
NurbsCurve Class
Rhino.Geometry Namespace