RhinoCommon API
Layer.PathSeparator Property
 The string "::" (colon,colon) is used to separate parent and child layer names.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public static string PathSeparator { get; }
Public Shared ReadOnly Property PathSeparator As String
	Get
Property Value
Type: String
See Also
Reference
Layer Class
Rhino.DocObjects Namespace