RhinoCommon API
FileSettings.AutoSaveMeshes Property
save render and display meshes in autosave file.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool AutoSaveMeshes { get; set; }
Public Shared Property AutoSaveMeshes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileSettings Class
Rhino.ApplicationSettings Namespace