RhinoCommon SDK
RenderPrimitive.Material Property
Rhino 5 for Windows
 The Materialassociated with this mesh or null if the RenderPrimitive property has a value.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: 5.1.30000.17 (5.13.60913.21340)
Syntax
public Material Material { get; }
Public ReadOnly Property Material As Material
	Get
Property Value
Type: Material
See Also
Reference
RenderPrimitive Class
Rhino.Render Namespace