RhinoCommon API
RhinoApp.LicenseUserOrganization Property
Gets the name of the organization of the user that owns the license or lease.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static string LicenseUserOrganization { get; }
Public Shared ReadOnly Property LicenseUserOrganization As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoApp Class
Rhino Namespace