RhinoCommon SDK
RLeader.LandingLength Property
 Length of landing segment if there is one
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double LandingLength { get; set; }
Public Property LandingLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RLeader Class
Rhino.Geometry Namespace