RhinoCommon API
SubDCreationOptions.Smooth Property
 No interior creases and no corners.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static SubDCreationOptions Smooth { get; }
Public Shared ReadOnly Property Smooth As SubDCreationOptions
	Get
Property Value
Type: SubDCreationOptions
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace