RhinoCommon API
ObjectPropertiesPage.SupportedTypes Property
 Override to specify which objects this page supports
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual ObjectType SupportedTypes { get; }
Public Overridable ReadOnly Property SupportedTypes As ObjectType
	Get
Property Value
Type: ObjectType
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectPropertiesPage Class
Rhino.UI Namespace