RhinoCommon API
LicenseStatus.ProductId Property
The id of the product or plugin.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid ProductId { get; set; }
Public Property ProductId As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace