RhinoCommon API
TextObject.TextGeometry Property
 Get the text geometry for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextEntity TextGeometry { get; }
Public ReadOnly Property TextGeometry As TextEntity
	Get
Property Value
Type: TextEntity
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextObject Class
Rhino.DocObjects Namespace