RhinoCommon API
Text3d.FontFace Property
 Gets or sets the FontFace name.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string FontFace { get; set; }
Public Property FontFace As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Text3d Class
Rhino.Display Namespace