RhinoCommon API
ContentUuids.PictureMaterialType Property
[Missing <summary> documentation for "P:Rhino.Render.ContentUuids.PictureMaterialType"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid PictureMaterialType { get; }
Public Shared ReadOnly Property PictureMaterialType As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ContentUuids Class
Rhino.Render Namespace