RhinoCommon API
AppearanceSettingsState.EchoPromptsToHistoryWindow Property
Gets or sets a value that determines if prompt messages are written to the history window.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EchoPromptsToHistoryWindow { get; set; }
Public Property EchoPromptsToHistoryWindow As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace