RhinoCommon API
SafeFrame.TitleFrameXScale Property
 Title Frame Scale X
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TitleFrameXScale { get; set; }
Public Property TitleFrameXScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SafeFrame Class
Rhino.Render Namespace