RhinoCommon API
HistorySettings.BrokenRecordWarningEnabled Property
 Displays a warning dialog when an action is taken that breaks the link between the output and input objects.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool BrokenRecordWarningEnabled { get; set; }
Public Shared Property BrokenRecordWarningEnabled As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
HistorySettings Class
Rhino.ApplicationSettings Namespace