RhinoCommon API
Font.Italic Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Italic"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool Italic { get; }
Public ReadOnly Property Italic As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Font Class
Rhino.DocObjects Namespace