RhinoCommon SDK
RLeader.UserArrowheadName Property
 Name of block for user defined arrow
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string UserArrowheadName { get; set; }
Public Property UserArrowheadName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RLeader Class
Rhino.Geometry Namespace