RhinoCommon SDK
LinearWorkflow.Active Property
 True if linear workflow is active
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Active { get; }
Public ReadOnly Property Active As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
LinearWorkflow Class
Rhino.Render.ChangeQueue Namespace