RhinoCommon API
SubDCreationOptions.InteriorCreaseAtMeshEdge Property
 Create an interior sub-D crease along all coincident input mesh edges.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static SubDCreationOptions InteriorCreaseAtMeshEdge { get; }
Public Shared ReadOnly Property InteriorCreaseAtMeshEdge As SubDCreationOptions
	Get
Property Value
Type: SubDCreationOptions
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace