RhinoCommon API
DimensionStyle.LeaderHasLanding Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderHasLanding"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool LeaderHasLanding { get; set; }
Public Property LeaderHasLanding As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace