RhinoCommon API
PlugIn.LoadAtStartup Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.PlugIns.PlugIn.LoadAtStartup"]
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute("Use LoadTime virtual property instead")]
public virtual bool LoadAtStartup { get; }
<ObsoleteAttribute("Use LoadTime virtual property instead")>
Public Overridable ReadOnly Property LoadAtStartup As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Obsolete (compiler warning) in 5.4
Rhino for Windows
Obsolete (compiler warning) in 7.0
See Also
Reference
PlugIn Class
Rhino.PlugIns Namespace