RhinoCommon API
Curve.PointAtEnd Property
 Evaluates point at the end of the curve.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d PointAtEnd { get; }
Public ReadOnly Property PointAtEnd As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Curve Class
Rhino.Geometry Namespace