RhinoCommon API
RhinoAccountsGroup.Id Property
 The id of the group. The id is unique to a group within Rhino Accounts.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Id { get; }
Public ReadOnly Property Id As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoAccountsGroup Class
Rhino.Runtime.RhinoAccounts Namespace