RhinoCommon SDK
Torus.MinorRadius Property
 Gets or sets the radius of the torus section.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double MinorRadius { get; set; }
Public Property MinorRadius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Torus Structure
Rhino.Geometry Namespace