RhinoCommon API
ColorHSV.A Property
 Gets or sets the alpha channel value. Alpha channels are limited to a 0~1 range.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double A { get; set; }
Public Property A As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ColorHSV Structure
Rhino.Display Namespace