RhinoCommon API
RenderSettings.LinearWorkflow Property
 Get the document linear workflow interface
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public LinearWorkflow LinearWorkflow { get; }
Public ReadOnly Property LinearWorkflow As LinearWorkflow
	Get
Property Value
Type: LinearWorkflow
See Also
Reference
RenderSettings Class
Rhino.Render Namespace