RhinoCommon API
DisplayPointAttributes.StrokeWidth Property
[Missing <summary> documentation for "P:Rhino.Display.DisplayPointAttributes.StrokeWidth"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float StrokeWidth { get; set; }
Public Property StrokeWidth As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPointAttributes Class
Rhino.Display Namespace