RhinoCommon API
RhinoDocObserverArgs.RuntimeSerialNumber Property
 Document runtime serial number, will be different across Rhino sessions.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public uint RuntimeSerialNumber { get; }
Public ReadOnly Property RuntimeSerialNumber As UInteger
	Get
Property Value
Type: UInt32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDocObserverArgs Class
Rhino Namespace