RhinoCommon API
LicenseLease.ProductEdition Property
 Edition of product that this lease is issued to. For example, "Commercial" or "Beta"
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ProductEdition { get; }
Public ReadOnly Property ProductEdition As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LicenseLease Class
Rhino.PlugIns Namespace