RhinoCommon SDK
SweepTwoRail.MaintainHeight Property
[Missing <summary> documentation for "P:Rhino.Geometry.SweepTwoRail.MaintainHeight"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool MaintainHeight { get; set; }
Public Property MaintainHeight As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace