RhinoCommon API
SubDVertex.Edges Property
 All edges that this vertex is part of
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IEnumerable<SubDEdge> Edges { get; }
Public ReadOnly Property Edges As IEnumerable(Of SubDEdge)
	Get
Property Value
Type: IEnumerable<SubDEdge>
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace