RhinoCommon API
CurvatureAnalysisSettings.MaxRadiusRange Property
 Gets or sets the Maximum Radius curvature range.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Interval MaxRadiusRange { get; set; }
Public Shared Property MaxRadiusRange As Interval
	Get
	Set
Property Value
Type: Interval
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
CurvatureAnalysisSettings Class
Rhino.ApplicationSettings Namespace