RhinoCommon API
ConstructionPlane.GridLineCount Property
 Gets or sets the total amount of grid lines in each direction.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int GridLineCount { get; set; }
Public Property GridLineCount As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace