RhinoCommon API
MeshThicknessMeasurement.OppositePoint Property
 Gets the point opposite to the measurement point.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point3d OppositePoint { get; }
Public ReadOnly Property OppositePoint As Point3d
	Get
Property Value
Type: Point3d
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshThicknessMeasurement Structure
Rhino.Geometry Namespace