RhinoCommon API
RadialDimension.AnnotationType Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.AnnotationType"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public AnnotationType AnnotationType { get; set; }
Public Property AnnotationType As AnnotationType
	Get
	Set
Property Value
Type: AnnotationType
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace