RhinoCommon API
Sphere.EquatorialPlane Property
 Gets or sets the Equatorial plane for this sphere.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane EquatorialPlane { get; set; }
Public Property EquatorialPlane As Plane
	Get
	Set
Property Value
Type: Plane
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace