RhinoCommon API
StringParserSettings.ParseSubtraction Property
[Missing <summary> documentation for "P:Rhino.Input.StringParserSettings.ParseSubtraction"]
 Namespace: Rhino.Input
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ParseSubtraction { get; set; }
Public Property ParseSubtraction As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
StringParserSettings Class
Rhino.Input Namespace