RhinoCommon API
LicenseData.ProductLicense Property
 The actual product license. This is provided by the plugin that validated the license.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ProductLicense { get; set; }
Public Property ProductLicense As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace