RhinoCommon SDK
AnnotationArrowhead.ArrowheadType Property
 Type of arrowhead used by annotation
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public AnnotationArrowheadType ArrowheadType { get; set; }
Public Property ArrowheadType As AnnotationArrowheadType
	Get
	Set
Property Value
Type: AnnotationArrowheadType
See Also
Reference
AnnotationArrowhead Class
Rhino.Geometry Namespace