RhinoCommon API
ViewEventArgs.View Property
[Missing <summary> documentation for "P:Rhino.Display.ViewEventArgs.View"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RhinoView View { get; }
Public ReadOnly Property View As RhinoView
	Get
Property Value
Type: RhinoView
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewEventArgs Class
Rhino.Display Namespace