RhinoCommon SDK
GroundPlane.Document Property
Document this groundplane is associated with.
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public RhinoDoc Document { get; }
Public ReadOnly Property Document As RhinoDoc
	Get
Property Value
Type: RhinoDoc
See Also
Reference
GroundPlane Class
Rhino.Render Namespace