RhinoCommon API
RuiUpdateUi.FileId Property
Id of the RUI file that owns this menu item
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid FileId { get; }
Public ReadOnly Property FileId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RuiUpdateUi Class
Rhino.UI Namespace