RhinoCommon API
PlugInInfo.Description Property
 Returns the plug-in's description.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace