RhinoCommon API
EarthAnchorPoint.EarthBasepointLatitude Property
 Gets or sets a point latitude on earth, in decimal degrees. +90 = north pole, 0 = equator, -90 = south pole.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double EarthBasepointLatitude { get; set; }
Public Property EarthBasepointLatitude As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace