RhinoCommon API
RhinoDoc.EarthAnchorPoint Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.EarthAnchorPoint"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public EarthAnchorPoint EarthAnchorPoint { get; set; }
Public Property EarthAnchorPoint As EarthAnchorPoint
	Get
	Set
Property Value
Type: EarthAnchorPoint
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace