RhinoCommon API
ViewSettingsState.RotateCircleIncrement Property
 Gets or sets the rotation increment.
When the user rotates a view with the keyboard, Rhino rotates the view in steps. The usual step is 1/60th of a circle, which equals six degrees.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int RotateCircleIncrement { get; set; }
Public Property RotateCircleIncrement As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace