RhinoCommon API
RhinoViewport.IsValidFrustum Property
[Missing <summary> documentation for "P:Rhino.Display.RhinoViewport.IsValidFrustum"]
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsValidFrustum { get; }
Public ReadOnly Property IsValidFrustum As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoViewport Class
Rhino.Display Namespace