RhinoCommon API
ToneMappingPostEffectPlugIn.SerialNumber Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.ToneMappingPostEffectPlugIn.SerialNumber"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SerialNumber { get; set; }
Public Property SerialNumber As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ToneMappingPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace