RhinoCommon API
File3dm.AllViews Property
 Views that represent the RhinoViews which are displayed when Rhino loads this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmViewTable AllViews { get; }
Public ReadOnly Property AllViews As File3dmViewTable
	Get
Property Value
Type: File3dmViewTable
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dm Class
Rhino.FileIO Namespace