RhinoCommon API
SubDVertex.Previous Property
 Previous vertex in linked list of vertices on this level
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public SubDVertex Previous { get; }
Public ReadOnly Property Previous As SubDVertex
	Get
Property Value
Type: SubDVertex
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace