RhinoCommon SDK
TextStyle.Italic Property
 From the font used by this style
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Italic { get; set; }
Public Property Italic As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TextStyle Class
Rhino.DocObjects Namespace