RhinoCommon SDK
RhinoObject.Geometry Property
 Gets the underlying geometry for this object.
All rhino objects are composed of geometry and attributes.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public GeometryBase Geometry { get; }
Public ReadOnly Property Geometry As GeometryBase
	Get
Property Value
Type: GeometryBase
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace