RhinoCommon API
ViewportInfo.FrustumBottomPlane Property
 Gets the frustum bottom plane that separates visibile from off-screen.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Plane FrustumBottomPlane { get; }
Public ReadOnly Property FrustumBottomPlane As Plane
	Get
Property Value
Type: Plane
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace