RhinoCommon API
ManifestTable.Count Property
 Total number of items in the manifest, including deleted items.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Implements
IReadOnlyCollection<T>.Count
ICollection<T>.Count
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ManifestTable Class
Rhino.FileIO Namespace