RhinoCommon API
PolyCurve.HasGap Property
 This is a quick way to see if the curve has gaps between the sub curve segments.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HasGap { get; }
Public ReadOnly Property HasGap As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
PolyCurve Class
Rhino.Geometry Namespace