RhinoCommon API
RhinoAccoountsProgressInfo.State Property
 The state to report.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ProgressState State { get; }
Public ReadOnly Property State As ProgressState
	Get
Property Value
Type: ProgressState
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoAccoountsProgressInfo Class
Rhino.Runtime.RhinoAccounts Namespace