RhinoCommon API
CreatePreviewEventArgs.PreviewImage Property
 Initially null. If this image is set, then this image will be used for the preview. If never set, the default internal simulation preview will be used.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Bitmap PreviewImage { get; set; }
Public Property PreviewImage As Bitmap
	Get
	Set
Property Value
Type: Bitmap
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace