RhinoCommon API
IOpenIDConnectToken.Aud Property
 The id of the client (the audience) this token is intended for.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
string Aud { get; }
ReadOnly Property Aud As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace