RhinoCommon SDK
DisplayMaterial.BackAmbient Property
Note: This API is now obsolete.
 Gets or sets the Ambient color of the back side of the Material. The alpha component of the color will be ignored.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[ObsoleteAttribute("This property is obsolete. Use BackEmission instead.")]
public Color BackAmbient { get; set; }
<ObsoleteAttribute("This property is obsolete. Use BackEmission instead.")>
Public Property BackAmbient As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace