RhinoCommon API
EarthAnchorPoint.Description Property
 Gets or sets the long form of the identifying information about this location.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Description { get; set; }
Public Property Description As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
EarthAnchorPoint Class
Rhino.DocObjects Namespace