RhinoCommon SDK
RLeader.AttachStyle Property
 How text aligns vertically with the leader tail
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public LeaderTextAttachStyle AttachStyle { get; set; }
Public Property AttachStyle As LeaderTextAttachStyle
	Get
	Set
Property Value
Type: LeaderTextAttachStyle
See Also
Reference
RLeader Class
Rhino.Geometry Namespace