RhinoCommon API
GetEllipsoid.MarkFoci Property
 Indicates the user wants the ellipsoid foci marked with point objects.
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool MarkFoci { get; set; }
Public Property MarkFoci As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetEllipsoid Class
Rhino.Input.Custom Namespace