RhinoCommon API
Pixels.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.Pixels.CppPointer"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Pixels Class
Rhino.Render.PostEffects Namespace