RhinoCommon API
RenderCustomEventArgs.Argument Property
 The pointer to the custom event args.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public IntPtr Argument { get; }
Public ReadOnly Property Argument As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RenderCustomEventArgs Class
Rhino.Render Namespace