RhinoCommon SDK
RhinoView.TitleVisible Property
 Visibility of the viewport title window.
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool TitleVisible { get; set; }
Public Property TitleVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RhinoView Class
Rhino.Display Namespace