RhinoCommon API
Layer.SectionHatchIndex Property
 Hatch pattern index for hatch to use when drawing a closed section Default is RhinoMath.UnsetIntIndex which means don't draw a hatch
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SectionHatchIndex { get; set; }
Public Property SectionHatchIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Layer Class
Rhino.DocObjects Namespace