RhinoCommon API
MeshFace.A Property
 Gets or sets the first corner index of the mesh face.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int A { get; set; }
Public Property A As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshFace Structure
Rhino.Geometry Namespace