RhinoCommon API
SubDVertex.ControlNetPoint Property
 Location of the "control net" point that this SubDVertex represents
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public Point3d ControlNetPoint { get; set; }
Public Property ControlNetPoint As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
SubDVertex Class
Rhino.Geometry Namespace