RhinoCommon API
RenderWindow.ChannelEx.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.RenderWindow.ChannelEx.CppPointer"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
RenderWindow.ChannelEx Class
Rhino.Render Namespace