RhinoCommon API
IndexPair.I Property
 Gets or sets the first, I index.
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int I { get; set; }
Public Property I As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
IndexPair Structure
Rhino Namespace