RhinoCommon API
FileSlcWriteOptions.SliceDistance Property
 The distance between the slices or layers of curves that your final output will contain. The distance should be based on the slice thickness of your final output device
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double SliceDistance { get; set; }
Public Property SliceDistance As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileSlcWriteOptions Class
Rhino.FileIO Namespace