RhinoCommon API
PhysicallyBasedMaterial.Metallic Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.Metallic"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Metallic { get; set; }
Public Property Metallic As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace