RhinoCommon API
CustomRenderMeshProvider.ThickeningId Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderMeshProvider.ThickeningId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid ThickeningId { get; }
Public Shared ReadOnly Property ThickeningId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace