RhinoCommon API
CustomRenderMeshProvider.CurvePipingId Property
[Missing <summary> documentation for "P:Rhino.Render.CustomRenderMeshProvider.CurvePipingId"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid CurvePipingId { get; }
Public Shared ReadOnly Property CurvePipingId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
CustomRenderMeshProvider Class
Rhino.Render Namespace