RhinoCommon SDK
MeshVertexHiddenList.Capacity Property
 Gets or sets the total number of hidden vertex information the internal data structure can hold without resizing.
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Capacity { get; set; }
Public Property Capacity As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
MeshVertexHiddenList Class
Rhino.Geometry.Collections Namespace