RhinoCommon API
Font.Weight Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Font.Weight"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Font.FontWeight Weight { get; }
Public ReadOnly Property Weight As Font.FontWeight
	Get
Property Value
Type: Font.FontWeight
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Font Class
Rhino.DocObjects Namespace