RhinoCommon API
IOpenIDConnectToken.AuthTime Property
 Time when the End-User authentication occurred
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
Nullable<DateTime> AuthTime { get; }
ReadOnly Property AuthTime As Nullable(Of DateTime)
	Get
Property Value
Type: Nullable<DateTime>
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace