RhinoCommon API
Worksession.ModelCount Property
 Returns the number of models in the worksession. The active model will included in this count whether or not it has been saved.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ModelCount { get; }
Public ReadOnly Property ModelCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Worksession Class
Rhino.DocObjects Namespace