RhinoCommon API
RenderContent.ChildSlotDisplayName Property
 Returns the localized display name of the child slot name
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string ChildSlotDisplayName { get; }
Public ReadOnly Property ChildSlotDisplayName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderContent Class
Rhino.Render Namespace