RhinoCommon API
Matrix.IsSquare Property
 Gets a value indicating whether this matrix has the same number of rows and columns. 0x0 matrices are not considered square.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsSquare { get; }
Public ReadOnly Property IsSquare As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Matrix Class
Rhino.Geometry Namespace