RhinoCommon API
RenderWindowClonedEventArgs.NewRenderWindow Property
[Missing <summary> documentation for "P:Rhino.Render.RenderWindowClonedEventArgs.NewRenderWindow"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderWindow NewRenderWindow { get; }
Public ReadOnly Property NewRenderWindow As RenderWindow
	Get
Property Value
Type: RenderWindow
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderWindowClonedEventArgs Class
Rhino.Render Namespace