RhinoCommon SDK
RLeader.Points3D Property
 Get or set the 3d points defining the curve used by this leader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d[] Points3D { get; set; }
Public Property Points3D As Point3d()
	Get
	Set
Property Value
Type: Point3d[]
See Also
Reference
RLeader Class
Rhino.Geometry Namespace