RhinoCommon SDK
BrepRegionFaceSide.Brep Property
 The brep this side belongs to.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Brep Brep { get; }
Public ReadOnly Property Brep As Brep
	Get
Property Value
Type: Brep
See Also
Reference
BrepRegionFaceSide Class
Rhino.Geometry Namespace