RhinoCommon API
MeshDisplacementInfo.BlackMove Property
 The amount of displacement for the black color in the texture.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double BlackMove { get; set; }
Public Property BlackMove As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshDisplacementInfo Class
Rhino.Geometry Namespace