RhinoCommon API
ModelAidSettingsState.DisplayControlPolygon Property
Gets or sets the enabled state of Rhino's display control polygon.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool DisplayControlPolygon { get; set; }
Public Property DisplayControlPolygon As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace