RhinoCommon API
RenderMaterial.PhysicallyBased.ParametersNames.Sheen Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PhysicallyBased.ParametersNames.Sheen"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string Sheen { get; }
Public Shared ReadOnly Property Sheen As String
	Get
Property Value
Type: String
See Also
Reference
RenderMaterial.PhysicallyBased.ParametersNames Class
Rhino.Render Namespace