RhinoCommon SDK
BrepRegion.Index Property
Gets the index of region in the RegionTopology array.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BrepRegion Class
Rhino.Geometry Namespace