RhinoCommon API
Silhouette.Curve Property
 3D curve representing the shape of the silhouette.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Curve Curve { get; }
Public ReadOnly Property Curve As Curve
	Get
Property Value
Type: Curve
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Silhouette Class
Rhino.Geometry Namespace