RhinoCommon API
Field.TextureAmountMax Property
 Set Max value for Texture amount
 Namespace: Rhino.Render.Fields
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int TextureAmountMax { set; }
Public WriteOnly Property TextureAmountMax As Integer
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Field Class
Rhino.Render.Fields Namespace