RhinoCommon API
SafeFrame.ActionFrameYScale Property
 Action Frame Scale Y
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ActionFrameYScale { get; set; }
Public Property ActionFrameYScale As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
SafeFrame Class
Rhino.Render Namespace