RhinoCommon API
Material.DefaultMaterial Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.DefaultMaterial"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Material DefaultMaterial { get; }
Public Shared ReadOnly Property DefaultMaterial As Material
	Get
Property Value
Type: Material
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Material Class
Rhino.DocObjects Namespace