RhinoCommon API
CursorTooltipSettings.BackgroundColor Property
Tooltip background color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Color BackgroundColor { get; set; }
Public Shared Property BackgroundColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace