RhinoCommon API
RenderContentType.InternalName Property
 Returns the internal name identifier associated with this type.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string InternalName { get; }
Public ReadOnly Property InternalName As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RenderContentType Class
Rhino.Render Namespace