RhinoCommon API
Vector2d.Length Property
 Computes the length (or magnitude, or size) of this vector. This is an application of Pythagoras' theorem.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Vector2d Structure
Rhino.Geometry Namespace