RhinoCommon API
ViewportInfo.PerspectiveMinNearDist Property
 Expert user function to control the minimum value of near when perspective projections are being used.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double PerspectiveMinNearDist { get; set; }
Public Property PerspectiveMinNearDist As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace