RhinoCommon API
LicenseStatus.SerialNumber Property
The "for display only" product license or serial number.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string SerialNumber { get; set; }
Public Property SerialNumber As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
LicenseStatus Class
Rhino.PlugIns Namespace