RhinoCommon API
File3dmWriteOptions.Version Property
File version. Default is major version number of this assembly version.
Must be in range [2; current version].
Alternatively, 0 is a placeholder for the last valid version.
Rhino can read its current version, plus earlier file versions except 1.
Use latest version when possible.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Version { get; set; }
Public Property Version As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dmWriteOptions Class
Rhino.FileIO Namespace