RhinoCommon API
RadialDimension.TextAngleType Property
[Missing <summary> documentation for "P:Rhino.Geometry.RadialDimension.TextAngleType"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override DimensionStyle.LeaderContentAngleStyle TextAngleType { get; set; }
Public Overrides Property TextAngleType As DimensionStyle.LeaderContentAngleStyle
	Get
	Set
Property Value
Type: DimensionStyle.LeaderContentAngleStyle
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RadialDimension Class
Rhino.Geometry Namespace