RhinoCommon API
DisplayMaterial.BackDiffuse Property
 Gets or sets the Diffuse color of the back side of the Material. The alpha component of the color will be ignored.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color BackDiffuse { get; set; }
Public Property BackDiffuse As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayMaterial Class
Rhino.Display Namespace