RhinoCommon API
OrdinateDimension.KinkOffset1 Property
[Missing <summary> documentation for "P:Rhino.Geometry.OrdinateDimension.KinkOffset1"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double KinkOffset1 { get; set; }
Public Property KinkOffset1 As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
OrdinateDimension Class
Rhino.Geometry Namespace