RhinoCommon API
Text3d.HorizontalAlignment Property
 Horizontal alignment that this Text3d is drawn with
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextHorizontalAlignment HorizontalAlignment { get; set; }
Public Property HorizontalAlignment As TextHorizontalAlignment
	Get
	Set
Property Value
Type: TextHorizontalAlignment
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Text3d Class
Rhino.Display Namespace