RhinoCommon API
AppearanceSettingsState.DefaultLayerColor Property
 Gets or sets the default layer color.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Color DefaultLayerColor { get; set; }
Public Property DefaultLayerColor As Color
	Get
	Set
Property Value
Type: Color
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
AppearanceSettingsState Class
Rhino.ApplicationSettings Namespace