RhinoCommon API
ViewSettingsState.ZoomExtentsPerspectiveViewBorder Property
 Border amount to apply to perspective viewport during zoom extents
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double ZoomExtentsPerspectiveViewBorder { get; set; }
Public Property ZoomExtentsPerspectiveViewBorder As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace