RhinoCommon API
GetTransform.HaveTransform Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetTransform.HaveTransform"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool HaveTransform { get; set; }
Public Property HaveTransform As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetTransform Class
Rhino.Input.Custom Namespace