RhinoCommon SDK
ToolbarGroup.Visible Property
[Missing <summary> documentation for "P:Rhino.UI.ToolbarGroup.Visible"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool Visible { get; set; }
Public Property Visible As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ToolbarGroup Class
Rhino.UI Namespace