RhinoCommon API
OrdinateDimensionObject.OrdinateDimensionGeometry Property
 Get the dimension geometry for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public OrdinateDimension OrdinateDimensionGeometry { get; }
Public ReadOnly Property OrdinateDimensionGeometry As OrdinateDimension
	Get
Property Value
Type: OrdinateDimension
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
OrdinateDimensionObject Class
Rhino.DocObjects Namespace