RhinoCommon API
DimensionStyle.DimensionScaleValue Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.DimensionScaleValue"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public ScaleValue DimensionScaleValue { get; set; }
Public Property DimensionScaleValue As ScaleValue
	Get
	Set
Property Value
Type: ScaleValue
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace