RhinoCommon API
PhysicallyBasedMaterial.ParametersNames.Metallic Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Metallic"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[ObsoleteAttribute]
public static string Metallic { get; }
<ObsoleteAttribute>
Public Shared ReadOnly Property Metallic As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Obsolete (compiler warning) in 7.0
See Also
Reference
PhysicallyBasedMaterial.ParametersNames Class
Rhino.Render Namespace