RhinoCommon SDK
TextStyleTable.Count Property
 Returns number of text styles in the textstyle table, including deleted styles.
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
See Also
Reference
TextStyleTable Class
Rhino.DocObjects.Tables Namespace