RhinoCommon API
PhysicallyBasedMaterial.Subsurface Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.Subsurface"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public double Subsurface { get; set; }
Public Property Subsurface As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace