RhinoCommon API
GetCancel.Progress Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.GetCancel.Progress"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IProgress<double> Progress { get; }
Public ReadOnly Property Progress As IProgress(Of Double)
	Get
Property Value
Type: IProgress<Double>
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetCancel Class
Rhino.Input.Custom Namespace