RhinoCommon API
ViewportInfo.IsCameraUpLocked Property
 Gets or sets a value that indicates whether the camera up vector is unmodifiable.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsCameraUpLocked { get; set; }
Public Property IsCameraUpLocked As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewportInfo Class
Rhino.DocObjects Namespace