RhinoCommon API
PostEffectJob.CppPointer Property
[Missing <summary> documentation for "P:Rhino.Render.PostEffects.PostEffectJob.CppPointer"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IntPtr CppPointer { get; }
Public ReadOnly Property CppPointer As IntPtr
	Get
Property Value
Type: IntPtr
See Also
Reference
PostEffectJob Class
Rhino.Render.PostEffects Namespace