RhinoCommon API
ProviderIds.ImageFileInfo Property
[Missing <summary> documentation for "P:Rhino.UI.Controls.DataSource.ProviderIds.ImageFileInfo"]
 Namespace: Rhino.UI.Controls.DataSource
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Guid ImageFileInfo { get; }
Public Shared ReadOnly Property ImageFileInfo As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ProviderIds Class
Rhino.UI.Controls.DataSource Namespace