RhinoCommon API
MaterialTable.Count Property
 Returns number of materials in the material table, including deleted materials.
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
See Also
Reference
MaterialTable Class
Rhino.DocObjects.Tables Namespace