RhinoCommon API
Point2d.MinimumCoordinate Property
 Gets the smallest (both positive and negative) valid coordinate, or RhinoMath.UnsetValue if no coordinate is valid.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double MinimumCoordinate { get; }
Public ReadOnly Property MinimumCoordinate As Double
	Get
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace