RhinoCommon SDK
Sphere.Center Property
 Gets or sets the center point of the sphere.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Point3d Center { get; set; }
Public Property Center As Point3d
	Get
	Set
Property Value
Type: Point3d
See Also
Reference
Sphere Structure
Rhino.Geometry Namespace