RhinoCommon API
DisplayPen.Thickness Property
 Thickness for stoke
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public float Thickness { get; set; }
Public Property Thickness As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
DisplayPen Class
Rhino.Display Namespace