RhinoCommon API
PersistentSettingsSavedEventArgs.PlugInSettings Property
 The old PlugIn settings
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PersistentSettings PlugInSettings { get; }
Public ReadOnly Property PlugInSettings As PersistentSettings
	Get
Property Value
Type: PersistentSettings
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PersistentSettingsSavedEventArgs Class
Rhino Namespace
PlugIn.Settings
PlugIn.SettingsSaved