RhinoCommon API
ViewCaptureSettings.Resolution Property
 Capture "density" in dots per inch
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double Resolution { get; set; }
Public Property Resolution As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewCaptureSettings Class
Rhino.Display Namespace