RhinoCommon API
RayShootEvent.GeometryIndex Property
 The index of the surface or Brep that was hit.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int GeometryIndex { get; set; }
Public Property GeometryIndex As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RayShootEvent Structure
Rhino.Geometry.Intersect Namespace