RhinoCommon API
ModelAidSettingsState.OrthoAngle Property
Gets or sets the base orthogonal angle.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double OrthoAngle { get; set; }
Public Property OrthoAngle As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ModelAidSettingsState Class
Rhino.ApplicationSettings Namespace