RhinoCommon API
AnnotationBase.DecimalSeparator Property
 Set or get the decimal separator c
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public char DecimalSeparator { get; set; }
Public Property DecimalSeparator As Char
	Get
	Set
Property Value
Type: Char
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
AnnotationBase Class
Rhino.Geometry Namespace