RhinoCommon API
LeaderObject.LeaderGeometry Property
 Get the leader geometry for this object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Leader LeaderGeometry { get; }
Public ReadOnly Property LeaderGeometry As Leader
	Get
Property Value
Type: Leader
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LeaderObject Class
Rhino.DocObjects Namespace