RhinoCommon API
LinearWorkflow.PreProcessGamma Property
 Linear workflow gamma
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public float PreProcessGamma { get; set; }
Public Property PreProcessGamma As Single
	Get
	Set
Property Value
Type: Single
See Also
Reference
LinearWorkflow Class
Rhino.Render Namespace