RhinoCommon API
Dimension.TextRotation Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.TextRotation"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public double TextRotation { get; set; }
Public Property TextRotation As Double
	Get
	Set
Property Value
Type: Double
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Dimension Class
Rhino.Geometry Namespace