RhinoCommon API
OptionToggle.InitialValue Property
[Missing <summary> documentation for "P:Rhino.Input.Custom.OptionToggle.InitialValue"]
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool InitialValue { get; }
Public ReadOnly Property InitialValue As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
OptionToggle Class
Rhino.Input.Custom Namespace