RhinoCommon SDK
SimulatedTexture.Filename Property
[Missing <summary> documentation for "P:Rhino.Render.SimulatedTexture.Filename"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public string Filename { get; set; }
Public Property Filename As String
	Get
	Set
Property Value
Type: String
See Also
Reference
SimulatedTexture Class
Rhino.Render Namespace