RhinoCommon API
MaterialRef.BackFaceMaterialId Property
 The Id of the Material used to render the back of an object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid BackFaceMaterialId { get; }
Public ReadOnly Property BackFaceMaterialId As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MaterialRef Class
Rhino.DocObjects Namespace