RhinoCommon API
GetContextArgs.CallCount Property
 Number of times Get() has been called for a given getter
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int CallCount { get; }
Public ReadOnly Property CallCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetContextArgs Class
Rhino.Input.Custom Namespace