RhinoCommon API
Decal.Transparency Property
 Gets the decal's transparency in the range 0 to 1.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.10
Syntax
public double Transparency { get; }
Public ReadOnly Property Transparency As Double
	Get
Property Value
Type: Double
See Also
Reference
Decal Class
Rhino.Render Namespace