RhinoCommon API
Quaternion.Identity Property
 Returns the (1,0,0,0) quaternion.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Quaternion Identity { get; }
Public Shared ReadOnly Property Identity As Quaternion
	Get
Property Value
Type: Quaternion
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace