RhinoCommon API
Quaternion.Zero Property
 Returns the default quaternion, where all coefficients are 0.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Quaternion Zero { get; }
Public Shared ReadOnly Property Zero As Quaternion
	Get
Property Value
Type: Quaternion
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace