RhinoCommon API
UndoRedoEventArgs.IsPurgeRecord Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.IsPurgeRecord"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool IsPurgeRecord { get; }
Public ReadOnly Property IsPurgeRecord As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace