RhinoCommon SDK
Linetype.Id Property
 Gets the ID of this linetype object.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
Property Value
Type: Guid
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace