RhinoCommon API
File3dm.AllNamedViews Property
 Named views in this file.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public File3dmViewTable AllNamedViews { get; }
Public ReadOnly Property AllNamedViews As File3dmViewTable
	Get
Property Value
Type: File3dmViewTable
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
File3dm Class
Rhino.FileIO Namespace