RhinoCommon API
GeneralSettingsState.EnableContextMenu Property
 true if right mouse down + delay will pop up context menu on a mouse up if no move happens.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool EnableContextMenu { get; set; }
Public Property EnableContextMenu As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GeneralSettingsState Class
Rhino.ApplicationSettings Namespace