RhinoCommon SDK
TextLog.IndentSize Property
 0: one tab per indent. >0: number of spaces per indent
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int IndentSize { get; set; }
Public Property IndentSize As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
TextLog Class
Rhino.FileIO Namespace