RhinoCommon API
SubDCreationOptions.ConvexCornerAtMeshCorner Property
 Look for convex corners at SubD vertices with 2 edges that have an included angle <= 90 degrees.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static SubDCreationOptions ConvexCornerAtMeshCorner { get; }
Public Shared ReadOnly Property ConvexCornerAtMeshCorner As SubDCreationOptions
	Get
Property Value
Type: SubDCreationOptions
See Also
Reference
SubDCreationOptions Class
Rhino.Geometry Namespace