RhinoCommon API
StackedDialogPage.PageImage Property
 Optionally override to provide a image to display in the Mac Rhino UI
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public virtual Image PageImage { get; }
Public Overridable ReadOnly Property PageImage As Image
	Get
Property Value
Type: Image
The page image.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace