RhinoCommon API
DimensionStyle.LeaderTextHorizontalAlignment Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.LeaderTextHorizontalAlignment"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextHorizontalAlignment LeaderTextHorizontalAlignment { get; set; }
Public Property LeaderTextHorizontalAlignment As TextHorizontalAlignment
	Get
	Set
Property Value
Type: TextHorizontalAlignment
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace