RhinoCommon SDK
Material.RenderMaterialInstanceId Property
[Missing <summary> documentation for "P:Rhino.DocObjects.Material.RenderMaterialInstanceId"]
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Guid RenderMaterialInstanceId { get; }
Public ReadOnly Property RenderMaterialInstanceId As Guid
	Get
Property Value
Type: Guid
See Also
Reference
Material Class
Rhino.DocObjects Namespace