RhinoCommon API
DimensionStyle.SuppressArrow2 Property
[Missing <summary> documentation for "P:Rhino.DocObjects.DimensionStyle.SuppressArrow2"]
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool SuppressArrow2 { get; set; }
Public Property SuppressArrow2 As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace