RhinoCommon API
ReduceMeshParameters.ProgressReporter Property
[Missing <summary> documentation for "P:Rhino.Geometry.ReduceMeshParameters.ProgressReporter"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public IProgress<double> ProgressReporter { get; set; }
Public Property ProgressReporter As IProgress(Of Double)
	Get
	Set
Property Value
Type: IProgress<Double>
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ReduceMeshParameters Class
Rhino.Geometry Namespace