RhinoCommon SDK
OrdinateDimensionObject.DimensionStyle Property
 Gets the DimensionStyle associated with this OrdinateDimensionObject.
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public DimensionStyle DimensionStyle { get; }
Public ReadOnly Property DimensionStyle As DimensionStyle
	Get
Property Value
Type: DimensionStyle
See Also
Reference
OrdinateDimensionObject Class
Rhino.DocObjects Namespace