RhinoCommon API
IOpenIDConnectToken.Emails Property
 All the emails belonging to the account the token represents.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
IReadOnlyCollection<string> Emails { get; }
ReadOnly Property Emails As IReadOnlyCollection(Of String)
	Get
Property Value
Type: IReadOnlyCollection<String>
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace