RhinoCommon API
CursorTooltipSettings.DistancePane Property
 Displays the distance from the last picked point.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static bool DistancePane { get; set; }
Public Shared Property DistancePane As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CursorTooltipSettings Class
Rhino.ApplicationSettings Namespace