RhinoCommon API
HiddenLineDrawing.WorldToHiddenLine Property
 Returns the world-coordinate system to HLD-coordinate system transformation.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform WorldToHiddenLine { get; }
Public ReadOnly Property WorldToHiddenLine As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
HiddenLineDrawing Class
Rhino.Geometry Namespace