RhinoCommon SDK
RLeader.TextGap Property
 Gap between leader tail and text in the leader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double TextGap { get; set; }
Public Property TextGap As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RLeader Class
Rhino.Geometry Namespace