RhinoCommon SDK
FileWriteOptions.ApplyTransform Property
[Missing <summary> documentation for "P:Rhino.FileIO.FileWriteOptions.ApplyTransform"]
Namespace: Rhino.FileIO
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public bool ApplyTransform { get; set; }
Public Property ApplyTransform As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace