RhinoCommon SDK
MeshPart.StartFaceIndex Property
Start of subinterval of parent mesh face array
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public int StartFaceIndex { get; }
Public ReadOnly Property StartFaceIndex As Integer
	Get
Property Value
Type: Int32
See Also
Reference
MeshPart Class
Rhino.Geometry Namespace