RhinoCommon API
MeshCheckParameters.SelfIntersectingPairsCount Property
 Gets the total count of self intersections for all meshes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int SelfIntersectingPairsCount { get; }
Public ReadOnly Property SelfIntersectingPairsCount As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshCheckParameters Structure
Rhino.Geometry Namespace