RhinoCommon API
GetPolyline.SecondPointPrompt Property
Prompt when getting second point
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string SecondPointPrompt { get; set; }
Public Property SecondPointPrompt As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
GetPolyline Class
Rhino.Input.Custom Namespace