RhinoCommon API
PhysicallyBasedMaterial.BRDF Property
[Missing <summary> documentation for "P:Rhino.Render.PhysicallyBasedMaterial.BRDF"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public PhysicallyBasedMaterial.BRDFs BRDF { get; set; }
Public Property BRDF As PhysicallyBasedMaterial.BRDFs
	Get
	Set
Property Value
Type: PhysicallyBasedMaterial.BRDFs
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace