RhinoCommon SDK
RichText.FormatHeight Property
 Text format height
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double FormatHeight { get; set; }
Public Property FormatHeight As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RichText Class
Rhino.Geometry Namespace