RhinoCommon API
DisplayPipeline.StereoProjection Property
 Gets the current stereo projection if stereo mode is on.
0 = left
1 = right
 If stereo mode is not enables, this property always returns 0.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int StereoProjection { get; }
Public ReadOnly Property StereoProjection As Integer
	Get
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayPipeline Class
Rhino.Display Namespace