RhinoCommon API
TextureMapping.MappingType Property
 Texture mapping type associated with this Mapping object.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public TextureMappingType MappingType { get; }
Public ReadOnly Property MappingType As TextureMappingType
	Get
Property Value
Type: TextureMappingType
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextureMapping Class
Rhino.Render Namespace