RhinoCommon SDK
RLeader.Curve Property
 Gets the curve used by this leader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public NurbsCurve Curve { get; }
Public ReadOnly Property Curve As NurbsCurve
	Get
Property Value
Type: NurbsCurve
See Also
Reference
RLeader Class
Rhino.Geometry Namespace