RhinoCommon API
UndoRedoEventArgs.UndoSerialNumber Property
[Missing <summary> documentation for "P:Rhino.Commands.UndoRedoEventArgs.UndoSerialNumber"]
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public uint UndoSerialNumber { get; }
Public ReadOnly Property UndoSerialNumber As UInteger
	Get
Property Value
Type: UInt32
See Also
Reference
UndoRedoEventArgs Class
Rhino.Commands Namespace