RhinoCommon API
RenderSettings.RenderChannels Property
 Get the document render channels interface
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public RenderChannels RenderChannels { get; }
Public ReadOnly Property RenderChannels As RenderChannels
	Get
Property Value
Type: RenderChannels
See Also
Reference
RenderSettings Class
Rhino.Render Namespace