RhinoCommon API
ConstructionPlane.ShowAxes Property
 Gets or sets whether the axes of the grid should be visible.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowAxes { get; set; }
Public Property ShowAxes As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ConstructionPlane Class
Rhino.DocObjects Namespace