RhinoCommon API
Linetype.LinetypeIndex Property
The index of this linetype.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 5.0
Syntax
public int LinetypeIndex { get; set; }
Public Property LinetypeIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
Linetype Class
Rhino.DocObjects Namespace