RhinoCommon API
Particle.DisplayBitmapIndex Property
[Missing <summary> documentation for "P:Rhino.Geometry.Particle.DisplayBitmapIndex"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int DisplayBitmapIndex { get; set; }
Public Property DisplayBitmapIndex As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Particle Class
Rhino.Geometry Namespace