RhinoCommon API
Point2d.Unset Property
 Gets a point at RhinoMath.UnsetValue,RhinoMath.UnsetValue.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static Point2d Unset { get; }
Public Shared ReadOnly Property Unset As Point2d
	Get
Property Value
Type: Point2d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Point2d Structure
Rhino.Geometry Namespace