RhinoCommon API
TextureMapping.ComponentType Property
 Returns TextureMapping.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public override ModelComponentType ComponentType { get; }
Public Overrides ReadOnly Property ComponentType As ModelComponentType
	Get
Property Value
Type: ModelComponentType
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
TextureMapping Class
Rhino.Render Namespace