RhinoCommon API
PlugInInfo.Id Property
 Returns the plug-in's Id.
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid Id { get; }
Public ReadOnly Property Id As Guid
	Get
Property Value
Type: Guid
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
PlugInInfo Class
Rhino.PlugIns Namespace