RhinoCommon API
RenderMaterial.PhysicallyBased.ParametersNames.SubsurfaceScatteringRadius Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PhysicallyBased.ParametersNames.SubsurfaceScatteringRadius"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string SubsurfaceScatteringRadius { get; }
Public Shared ReadOnly Property SubsurfaceScatteringRadius As String
	Get
Property Value
Type: String
See Also
Reference
RenderMaterial.PhysicallyBased.ParametersNames Class
Rhino.Render Namespace