RhinoCommon API
ViewSettingsState.AlwaysPanParallelViews Property
Gets or sets the 'always pan parallel views' value.
If the view is not looking straight at the construction plane, then sets parallel viewports so they will not rotate.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool AlwaysPanParallelViews { get; set; }
Public Property AlwaysPanParallelViews As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
ViewSettingsState Class
Rhino.ApplicationSettings Namespace