RhinoCommon API
Dimension.ZeroSuppression Property
[Missing <summary> documentation for "P:Rhino.Geometry.Dimension.ZeroSuppression"]
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DimensionStyle.ZeroSuppression ZeroSuppression { get; set; }
Public Property ZeroSuppression As DimensionStyle.ZeroSuppression
	Get
	Set
Property Value
Type: DimensionStyle.ZeroSuppression
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Dimension Class
Rhino.Geometry Namespace