RhinoCommon API
MaterialRefCreateParams.FrontFaceMaterialId Property
 The Id of the Material used to render the front of an object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Guid FrontFaceMaterialId { get; set; }
Public Property FrontFaceMaterialId As Guid
	Get
	Set
Property Value
Type: Guid
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
MaterialRefCreateParams Class
Rhino.DocObjects Namespace