RhinoCommon SDK
RLeader.Plane Property
 Get and set Leaders Plane
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public Plane Plane { get; set; }
Public Property Plane As Plane
	Get
	Set
Property Value
Type: Plane
See Also
Reference
RLeader Class
Rhino.Geometry Namespace