RhinoCommon API
CursorTooltipSettingsState.Offset Property
 The x and y distances in pixels from the cursor location to the tooltip.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Point Offset { get; set; }
Public Property Offset As Point
	Get
	Set
Property Value
Type: Point
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CursorTooltipSettingsState Class
Rhino.ApplicationSettings Namespace