RhinoCommon API
ObjectPropertiesPageEventArgs.ObjectCount Property
[Missing <summary> documentation for "P:Rhino.UI.ObjectPropertiesPageEventArgs.ObjectCount"]
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public int ObjectCount { get; }
Public ReadOnly Property ObjectCount As Integer
	Get
Return Value
Type: Int32
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
ObjectPropertiesPageEventArgs Class
Rhino.UI Namespace