RhinoCommon SDK
CreatePreviewEventArgs.Viewport Property
[Missing <summary> documentation for "P:Rhino.Render.CreatePreviewEventArgs.Viewport"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public ViewportInfo Viewport { get; }
Public ReadOnly Property Viewport As ViewportInfo
	Get
Property Value
Type: ViewportInfo
See Also
Reference
CreatePreviewEventArgs Class
Rhino.Render Namespace