RhinoCommon API
RhinoAccoountsProgressInfo.Description Property
 A localized description of the state that may be shown to the user of the application.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoAccoountsProgressInfo Class
Rhino.Runtime.RhinoAccounts Namespace