RhinoCommon API
RenderMaterial.PhysicallyBased.ParametersNames.BaseColor Property
[Missing <summary> documentation for "P:Rhino.Render.RenderMaterial.PhysicallyBased.ParametersNames.BaseColor"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public static string BaseColor { get; }
Public Shared ReadOnly Property BaseColor As String
	Get
Property Value
Type: String
See Also
Reference
RenderMaterial.PhysicallyBased.ParametersNames Class
Rhino.Render Namespace