RhinoCommon API
Skin.ApplicationName Property
If you want to provide a custom name for your skin.
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
protected virtual string ApplicationName { get; }
Protected Overridable ReadOnly Property ApplicationName As String
	Get
Property Value
Type: String
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Skin Class
Rhino.Runtime Namespace