RhinoCommon API
CurveProxy.ProxyCurveIsReversed Property
 True if "this" is a curve is reversed from the "real" curve geometry
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ProxyCurveIsReversed { get; }
Public ReadOnly Property ProxyCurveIsReversed As Boolean
	Get
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
CurveProxy Class
Rhino.Geometry Namespace