RhinoCommon API
GeneralSettings.MaximumUndoMemoryMb Property
 Gets or sets the minimum undo memory Mb.
Undo records will be purged if there are more than MinimumUndoSteps and they use more than MaximumUndoMemoryMb.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static int MaximumUndoMemoryMb { get; set; }
Public Shared Property MaximumUndoMemoryMb As Integer
	Get
	Set
Property Value
Type: Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
GeneralSettings Class
Rhino.ApplicationSettings Namespace