RhinoCommon API
Unroller.ExplodeOutput Property
 Gets or sets a value determining whether geometry should be exploded.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ExplodeOutput { get; set; }
Public Property ExplodeOutput As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Unroller Class
Rhino.Geometry Namespace