RhinoCommon API
RhinoDoc.RenderEnvironments Property
[Missing <summary> documentation for "P:Rhino.RhinoDoc.RenderEnvironments"]
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public RenderEnvironmentTable RenderEnvironments { get; }
Public ReadOnly Property RenderEnvironments As RenderEnvironmentTable
	Get
Property Value
Type: RenderEnvironmentTable
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoDoc Class
Rhino Namespace