RhinoCommon API
RhinoPageView.PageDescription Property
 Gets or sets the contents, or description, of the page.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string PageDescription { get; set; }
Public Property PageDescription As String
	Get
	Set
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
RhinoPageView Class
Rhino.Display Namespace