RhinoCommon API
DisplayPipelineAttributes.ShowLights Property
Show light widgets.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool ShowLights { get; set; }
Public Property ShowLights As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace