RhinoCommon API
LicenseData.RequiresOnlineValidation Property
 Set to true if this license requires online validation. Caller must also pass VerifyOnlineValidationCodeDelegate to GetLicense/AskUserForLicense
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public bool RequiresOnlineValidation { get; set; }
Public Property RequiresOnlineValidation As Boolean
	Get
	Set
Property Value
Type: Boolean
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
LicenseData Class
Rhino.PlugIns Namespace