RhinoCommon API
IOpenIDConnectToken.AdminGroups Property
 Returns all the groups the user is an admin of.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
IReadOnlyDictionary<string, RhinoAccountsGroup> AdminGroups { get; }
ReadOnly Property AdminGroups As IReadOnlyDictionary(Of String, RhinoAccountsGroup)
	Get
Property Value
Type: IReadOnlyDictionary<String, RhinoAccountsGroup>
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
IOpenIDConnectToken Interface
Rhino.Runtime.RhinoAccounts Namespace