RhinoCommon API
Quaternion.Vector Property
 The imaginary part of the quaternion
(B,C,D)
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Vector3d Vector { get; }
Public ReadOnly Property Vector As Vector3d
	Get
Property Value
Type: Vector3d
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Quaternion Structure
Rhino.Geometry Namespace