RhinoCommon API
MeshInstance.OcsTransform Property
 OCS Transform for the MeshInstance (identity means no OCS, potentially just simple WCS/WCS Box)
 Namespace: Rhino.Render.ChangeQueue
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public Transform OcsTransform { get; }
Public ReadOnly Property OcsTransform As Transform
	Get
Property Value
Type: Transform
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace