RhinoCommon API
DisplayPipelineAttributes.UseCustomObjectColor Property
 Gets whether objects ought to be drawn using a custom color.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public bool UseCustomObjectColor { get; }
Public ReadOnly Property UseCustomObjectColor As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace