RhinoCommon API
DisplayPipelineAttributes.StereoRenderContext Property
 Get or set the stereo render context.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public DisplayPipelineAttributes.StereoRenderContextEnum StereoRenderContext { get; set; }
Public Property StereoRenderContext As DisplayPipelineAttributes.StereoRenderContextEnum
	Get
	Set
Property Value
Type: DisplayPipelineAttributes.StereoRenderContextEnum
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
DisplayPipelineAttributes Class
Rhino.Display Namespace