RhinoCommon API
ICurrentEnvironment.ForBackground_CheckMode Property
[Missing <summary> documentation for "P:Rhino.Render.ICurrentEnvironment.ForBackground_CheckMode"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
RenderEnvironment ForBackground_CheckMode { get; set; }
Property ForBackground_CheckMode As RenderEnvironment
	Get
	Set
Property Value
Type: RenderEnvironment
Implements
ICurrentEnvironment_Get.ForBackground_CheckMode
See Also
Reference
ICurrentEnvironment Interface
Rhino.Render Namespace