RhinoCommon API
FileReference.RelativePath Property
 Gets the relative path of this file reference.
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public string RelativePath { get; }
Public ReadOnly Property RelativePath As String
	Get
Property Value
Type: String
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
FileReference Class
Rhino.FileIO Namespace