RhinoCommon SDK
RLeader.ContentType Property
 Type of annotation on the leader Currently only text
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public LeaderContentType ContentType { get; }
Public ReadOnly Property ContentType As LeaderContentType
	Get
Property Value
Type: LeaderContentType
See Also
Reference
RLeader Class
Rhino.Geometry Namespace