RhinoCommon SDK
Arc.Circumference Property
 Gets the circumference of the circle that is coincident with this arc.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public double Circumference { get; }
Public ReadOnly Property Circumference As Double
	Get
Property Value
Type: Double
See Also
Reference
Arc Structure
Rhino.Geometry Namespace