RhinoCommon SDK
TextStyle Properties
The TextStyle type exposes the following members.
Properties
Name | Description
Bold
 From the font used by this style
FaceName
 Font face name of the font used by this style
Id
 TextStyle Id
Italic
 From the font used by this style
LinefeedRatio
 Ratio of Height / distance from one line to the next lower line (default 1.6)
Strikeout
 From the font used by this style
Underline
 From the font used by this style
Top
See Also
Reference
TextStyle Class
Rhino.DocObjects Namespace