RhinoCommon API
PostEffectPlugIn Properties
The PostEffectPlugIn type exposes the following members.
Properties
Name | Description
CppPointer
Top
See Also
Reference
PostEffectPlugIn Class
Rhino.Render.PostEffects Namespace