RhinoCommon API
PhysicallyBasedMaterial Properties
The PhysicallyBasedMaterial type exposes the following members.
Properties
Name | Description
Anisotropic
AnisotropicRotation
BaseColor
BRDF
Clearcoat
ClearcoatRoughness
Emission
Material
Metallic
Opacity
OpacityIOR
OpacityRoughness
ReflectiveIOR
Roughness
Sheen
SheenTint
Specular
SpecularTint
Subsurface
SubsurfaceScatteringColor
SubsurfaceScatteringRadius
Supported
Top
See Also
Reference
PhysicallyBasedMaterial Class
Rhino.Render Namespace