RhinoCommon SDK
Silhouette Properties
The Silhouette type exposes the following members.
Properties
Name | Description
Curve
 3D Curve of silhouette
GeometryComponentIndex
 If valid, the component index of geometry containing entire silhouette curve
SilhouetteType
 How the silhouette was generated from the geometry
Top
See Also
Reference
Silhouette Class
Rhino.Geometry Namespace