RhinoCommon API
Vector2f Properties
The Vector2f type exposes the following members.
Properties
Name | Description
IsValid
 Returns an indication regarding the validity of this vector.
SquareLength
 Returns the square of the length of this vector. This method does not check for the validity of its inputs.
X
 Gets or sets the X (first) component of this vector.
Y
 Gets or sets the Y (second) component of this vector.
Top
See Also
Reference
Vector2f Structure
Rhino.Geometry Namespace