RhinoCommon API
QuadRemeshParameters Properties
The QuadRemeshParameters type exposes the following members.
Properties
Name | Description
AdaptiveSize
 Larger values results in for quad sizes that adjust to match input curvature. Smaller values results in more uniform quad sizes at the risk of less feature preservation. Range [0 - 100]
DetectHardEdges
 When enabled the hard edges in models will be retained.
SymmetryAxis
 Symmetry axis to use for symmetric remeshing
TargetQuadCount
 The number of quads to try to achieve in the final remeshed object
Top
See Also
Reference
QuadRemeshParameters Class
Rhino.Geometry Namespace