RhinoCommon API
ParametersNames Properties
The RenderMaterial.PhysicallyBased.ParametersNames type exposes the following members.
Properties
Name | Description
AmbientOcclusion
Anisotropic
AnisotropicRotation
BaseColor
BRDF
Bump
Clearcoat
ClearcoatBump
ClearcoatRoughness
Displacement
Emission
Metallic
Opacity
OpacityIor
OpacityRoughness
Roughness
Sheen
SheenTint
Specular
SpecularTint
Subsurface
SubsurfaceScatteringColor
SubsurfaceScatteringRadius
Top
See Also
Reference
RenderMaterial.PhysicallyBased.ParametersNames Class
Rhino.Render Namespace