RhinoCommon SDK
NurbsCurvePointList Properties
The NurbsCurvePointList type exposes the following members.
Properties
Name | Description
ControlPolygonLength
 Gets the length of the polyline connecting all control points.
Count
 Gets the number of control points in this curve.
Item
 Gets or sets the control point location at the given index.
Top
See Also
Reference
NurbsCurvePointList Class
Rhino.Geometry.Collections Namespace