RhinoCommon SDK
RichTextObject Properties
The RichTextObject type exposes the following members.
Properties
Name | Description
TextGeometry
 Get the RichText geometry for this object.
Top
See Also
Reference
RichTextObject Class
Rhino.DocObjects Namespace