RhinoCommon SDK
RhinoObject Properties
The RhinoObject type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the object attributes.
Document
 Gets the document that owns this object.
Geometry
 Gets the underlying geometry for this object.
All rhino objects are composed of geometry and attributes.
GripsOn
Gets or sets the activation state of object default editing grips.
GripsSelected
 true if grips are turned on and at least one is selected.
GroupCount
Number of groups object belongs to.
HasDynamicTransform
 True if the object has a dynamic transformation
Id
 Every object has a Guid (globally unique identifier, also known as UUID, or universally unique identifier). The default value is Guid.Empty.
 When an object is added to a model, the value is checked. If the value is Guid.Empty, a new Guid is created. If the value is not null but it is already used by another object in the model, a new Guid is created. If the value is not Guid.Empty and it is not used by another object in the model, then that value persists. When an object is updated, by a move for example, the value of ObjectId persists.
This value is the same as the one returned by this.Attributes.ObjectId.
IsDeletable
 Some objects cannot be deleted, like grips on lights and annotation objects.
IsDeleted
 true if the object is deleted. Deleted objects are kept by the document for undo purposes. Call RhinoDoc.UndeleteObject to undelete an object.
IsHidden
 An object must be in one of three modes: normal, locked or hidden. If an object is in normal mode, then the object's layer controls visibility and selectability. If an object is locked, then the object's layer controls visibility by the object cannot be selected. If the object is hidden, it is not visible and it cannot be selected.
IsInstanceDefinitionGeometry
 true if the object is used as part of an instance definition.
IsLocked
 An object must be in one of three modes: normal, locked or hidden. If an object is in normal mode, then the object's layer controls visibility and selectability. If an object is locked, then the object's layer controls visibility by the object cannot be selected. If the object is hidden, it is not visible and it cannot be selected.
IsNormal
 An object must be in one of three modes: normal, locked or hidden. If an object is in normal mode, then the object's layer controls visibility and selectability. If an object is locked, then the object's layer controls visibility by the object cannot be selected. If the object is hidden, it is not visible and it cannot be selected.
IsReference
 Gets a value indicating if an object is a reference object. An object from a work session reference model is a reference object and cannot be modified. An object is a reference object if, and only if, it is on a reference layer.
IsValid
 Tests an object to see if its data members are correctly initialized.
Name
 Rhino objects have optional text names. More than one object in a model can have the same name and some objects may have no name.
NextRuntimeSerialNumber
 Gets the runtime serial number that will be assigned to the next Rhino Object that is created.
ObjectType
 Gets the Rhino-based object type.
RenderMaterial
 Gets the render material associated with this object or null if there is none. This does not pay attention to the material source and will not check parent objects or layers for a RenderMaterial.
RuntimeSerialNumber
 Gets the objects runtime serial number.
Visible
Gets the object visibility.
Top
See Also
Reference
RhinoObject Class
Rhino.DocObjects Namespace