RhinoCommon API
ChannelDataCollection Properties
The ChannelDataCollection type exposes the following members.
Properties
Name | Description
CppPointer
Top
See Also
Reference
ChannelDataCollection Class
Rhino.Render.PostEffects Namespace