RhinoCommon API
SubDFace Properties
The SubDFace type exposes the following members.
Properties
Name | Description
EdgeCount
 Number of edges for this face. Note that EdgeCount is always the same as VertexCount. Two properties are provided simply for clarity.
LimitSurfaceCenterPoint
 Get the limit surface point location at the center of the face
PerFaceColor
 If per-face color is "Empty", then this face does not have a custom color
VertexCount
 Number of vertices for this face. Note that EdgeCount is always the same as VertexCount. Two properties are provided simply for clarity.
Top
See Also
Reference
SubDFace Class
Rhino.Geometry Namespace