RhinoCommon API
RenderCustomEventArgs Properties
The RenderCustomEventArgs type exposes the following members.
Properties
Name | Description
Argument
 The pointer to the custom event args.
EventType
 The type of the event.
Top
See Also
Reference
RenderCustomEventArgs Class
Rhino.Render Namespace