RhinoCommon API
SubD Properties
The SubD type exposes the following members.
Properties
Name | Description
Edges
 All edges in this SubD
Faces
 All faces in this SubD
IsSolid
 Test subd to see if the active level is a solid. A "solid" is a closed oriented manifold, or a closed oriented manifold.
Vertices
 All vertices in this SubD
Top
See Also
Reference
SubD Class
Rhino.Geometry Namespace