RhinoCommon API
Field Properties
The Field type exposes the following members.
Properties
Name | Description
IsHiddenInAutoUI
 When fields are used by the automatic UI, they can be hidden from it by calling this method.
Key |  Obsolete.
 Field name value string passed to the constructor
Name
 Field name value string passed to the constructor.
Tag
 Gets or sets an object that contains data to associate with the field.
TextureAmountMax
 Set Max value for Texture amount
TextureAmountMin
 Set Min value for Texture amount
Top
See Also
Reference
Field Class
Rhino.Render.Fields Namespace