RhinoCommon SDK
RLeaderObject Properties
The RLeaderObject type exposes the following members.
Properties
Name | Description
LeaderGeometry
 Get the Leader geometry for this object.
Top
See Also
Reference
RLeaderObject Class
Rhino.DocObjects Namespace