RhinoCommon API
Ellipse Properties
The Ellipse type exposes the following members.
Properties
Name | Description
IsValid
 Returns an indication of the validity of this ellipse.
Plane
 Gets or sets the base plane of the ellipse.
Radius1
 Gets or sets the radius of the ellipse along the base plane X semi-axis.
Radius2
 Gets or sets the radius of the ellipse along the base plane Y semi-axis.
Top
See Also
Reference
Ellipse Structure
Rhino.Geometry Namespace