RhinoCommon API
ChildSlotNames Properties
The RenderMaterial.PhysicallyBased.ChildSlotNames type exposes the following members.
Properties
Name | Description
AmbientOcclusion
Anisotropic
AnisotropicRotation
BaseColor
Bump
Clearcoat
ClearcoatBump
ClearcoatRoughness
Displacement
Emission
Metallic
Opacity
OpacityIor
OpacityRoughness
Roughness
Sheen
SheenTint
Specular
SpecularTint
Subsurface
SubsurfaceScatteringColor
SubsurfaceScatteringRadius
Top
See Also
Reference
RenderMaterial.PhysicallyBased.ChildSlotNames Class
Rhino.Render Namespace