RhinoCommon SDK
MouseCallbackEventArgs Properties
The MouseCallbackEventArgs type exposes the following members.
Properties
Name | Description
Button
CtrlKeyDown
ShiftKeyDown
View
ViewportPoint
Top
See Also
Reference
MouseCallbackEventArgs Class
Rhino.UI Namespace