RhinoCommon API
MeshInstance Properties
The MeshInstance type exposes the following members.
Properties
Name | Description
CastShadows
 Return true if mesh instance should cast shadows
Decals
 Access to the decals for this MeshInstance if any. Null if no decal iterator exists for this mesh instance
GroupId
 Get identifier that specifies the grouping of these mesh instances - usually based on the object that this originally comprised.
InstanceId
 Get the instance identifier for this mesh instance.
MaterialId
 The Material CRC / RenderHash
MeshId
 Get the mesh identifier for this mesh instance.
MeshIndex
 Get the mesh index for this mesh instance.
OcsTransform
 OCS Transform for the MeshInstance - this is the Object Coordinate System texture mapping transformation set in the texture mapping properties dialog. (identity means no OCS, potentially just simple WCS/WCS Box)
ParentId
 Get the Guid of the object that is at the parent of the MeshInstance ancestry, or Guid.Empty if there is no parent.
ReceiveShadows
 Return true if mesh instance should receive shadows
RenderMaterial
 RenderMaterial associated with mesh instance
RootId
 Get the Guid of the object that is at the root of the MeshInstance ancestry, or Guid.Empty if this has no root.
Transform
 Transform for the MeshInstance
Top
See Also
Reference
MeshInstance Class
Rhino.Render.ChangeQueue Namespace