RhinoCommon API
ChannelData Properties
The ChannelData type exposes the following members.
Properties
Name | Description
CppPointer
Top
See Also
Reference
ChannelData Class
Rhino.Render.PostEffects Namespace