RhinoCommon SDK
AnnotationArrowhead Properties
The AnnotationArrowhead type exposes the following members.
Properties
Name | Description
ArrowheadName
 Name of block used for user-defined arrowhead
ArrowheadType
 Type of arrowhead used by annotation
Top
See Also
Reference
AnnotationArrowhead Class
Rhino.Geometry Namespace