RhinoCommon API
GroupTable Properties
The GroupTable type exposes the following members.
Properties
Name | Description
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of groups in the group table.
In Rhino for Windows 7.0, this member is inherited from .CommonComponentTable<T>Count.
Document
Document that owns this group table.
In Rhino for Windows 7.0, this member is inherited from .RhinoDocCommonTable<T>Document.
Top
See Also
Reference
GroupTable Class
Rhino.DocObjects.Tables Namespace