RhinoCommon API
SubDFaceList Properties
The SubDFaceList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of SubD faces.
Top
See Also
Reference
SubDFaceList Class
Rhino.Geometry.Collections Namespace