RhinoCommon SDK
BitmapEntry Properties
The BitmapEntry type exposes the following members.
Properties
Name | Description
FileName
The name of this bitmap.
IsReference
 Gets a value indicting whether this bitmap is a referenced bitmap. Referenced bitmaps are part of referenced documents.
Top
See Also
Reference
BitmapEntry Class
Rhino.DocObjects Namespace