RhinoCommon SDK
ObjectTable Properties
The ObjectTable type exposes the following members.
Properties
Name | Description
BoundingBox
 Gets the boundingbox for all objects (normal, locked and hidden) in this document that exist in "model" space. This bounding box does not include objects that exist in layout space.
BoundingBoxVisible
 Gets the boundingbox for all visible objects (normal and locked) in this document that exist in "model" space. This bounding box does not include hidden objects or any objects that exist in layout space.
Document
 Gets the document that owns this object table.
Top
See Also
Reference
ObjectTable Class
Rhino.DocObjects.Tables Namespace