RhinoCommon API
SweepTwoRail Properties
The SweepTwoRail type exposes the following members.
Properties
Name | Description
AngleToleranceRadians
 Gets or sets the angle tolerance in radians.
ClosedSweep
 If the input rails are closed, ClosedSweep determines if the swept Breps will also be closed.
MaintainHeight
 Removes the association between the height scaling from the width scaling.
SweepTolerance
 Gets or sets the sweeping tolerance.
Top
See Also
Reference
SweepTwoRail Class
Rhino.Geometry Namespace