RhinoCommon SDK
TextStyleTable Properties
The TextStyleTable type exposes the following members.
Properties
Name | Description
Count
 Returns number of text styles in the textstyle table, including deleted styles.
Document
Document that owns this table.
Item
 Returns a TextStyle at [index] in the TextStyleTable
Top
See Also
Reference
TextStyleTable Class
Rhino.DocObjects.Tables Namespace