RhinoCommon API
SubDComponent Properties
The SubDComponent type exposes the following members.
Properties
Name | Description
Id
 Unique id within the parent SubD for this item
ParentSubD
 SubD that this component belongs to
Top
See Also
Reference
SubDComponent Class
Rhino.Geometry Namespace