RhinoCommon API
SafeFrame Properties
The SafeFrame type exposes the following members.
Properties
Name | Description
ActionFrameLinked
 Action Frame Linked, On = Use the same scale for X and Y. Off = use different scales for X and Y.
ActionFrameOn
 Turn on the user specified action area, which shown with blue frames.
ActionFrameXScale
 Action Frame Scale X
ActionFrameYScale
 Action Frame Scale Y
Enabled
 Determines whether the safeframe is enabled.
FieldsOn
 Show a 4 by 3 grid in the safe-frame.
LiveFrameOn
 Turn on the live area, which shows the size of the rendered view as a yellow frame in the viewport.
PerspectiveOnly
 Show the safe-frame only in perspective views.
TitleFrameLinked
 Title Frame Linked, On = Use the same scale for X and Y. Off = use different scales for X and Y.
TitleFrameOn
 Show a user specified title area frame in orange.
TitleFrameXScale
 Title Frame Scale X
TitleFrameYScale
 Title Frame Scale Y
Top
See Also
Reference
SafeFrame Class
Rhino.Render Namespace