RhinoCommon API
LatePostEffectPlugIn Properties
The LatePostEffectPlugIn type exposes the following members.
Properties
Name | Description
SerialNumber
Top
See Also
Reference
LatePostEffectPlugIn Class
Rhino.Render.PostEffects Namespace