RhinoCommon API
PostEffectUI Properties
The PostEffectUI type exposes the following members.
Properties
Name | Description
CppPointer
Top
See Also
Reference
PostEffectUI Class
Rhino.Render.PostEffects Namespace