RhinoCommon API
PostEffectState Properties
The PostEffectState type exposes the following members.
Properties
Name | Description
CppPointer
Top
See Also
Reference
PostEffectState Class
Rhino.Render.PostEffects Namespace