RhinoCommon API
FileWriteOptions Properties
The FileWriteOptions type exposes the following members.
Properties
Name | Description
ApplyTransform
DestinationFileName
 For use on Apple frameworks only. Retrns the final destination file name.
FileVersion
IncludeBitmapTable
 The file written should include the bitmap table if your File Writing Plug-in supports it.
IncludeHistory
 The file written should include history information if your File Writing Plug-In supports it.
IncludePreviewImage
 The file written should include a preview image if your File Writing Plug-in supports it.
IncludeRenderMeshes
 The file written should include the render meshes if your File Writing Plug-in supports it.
SuppressAllInput
SuppressDialogBoxes
 If true, it means the command has been run with a '-', meaning you should not ask questions during writing. (no dialogs, no "getters", etc.)
UpdateDocumentPath
 If a complete, current version, 3dm file is successfully saved, then the name of the file will be used to update the document's default file path and title and document will be marked as not modified.
WriteAsTemplate
 Write as template
WriteGeometryOnly
 If true, the file written should include only geometry File Writing Plug-in supports it.
WriteSelectedObjectsOnly
 If true, this command should export only the objects currently selected in the Rhino model.
WriteUserData
 If true, the file written should include User Data if your File Writing Plug-in supports it.
Xform
Top
See Also
Reference
FileWriteOptions Class
Rhino.FileIO Namespace