RhinoCommon API
PostEffectJob Properties
The PostEffectJob type exposes the following members.
Properties
Name | Description
CppPointer
SerialNumber
Top
See Also
Reference
PostEffectJob Class
Rhino.Render.PostEffects Namespace