RhinoCommon SDK
LinearWorkflow Properties
The LinearWorkflow type exposes the following members.
Properties
Name | Description
Active
 True if linear workflow is active
Gamma
 Get gamma
GammaReciprocal
 Get gamma reciprocal
Top
See Also
Reference
LinearWorkflow Class
Rhino.Render.ChangeQueue Namespace