RhinoCommon API
SubDEdge Properties
The SubDEdge type exposes the following members.
Properties
Name | Description
ControlNetLine
 Line representing the control net end points
FaceCount
 Number of faces for this edge
Tag
 identifies the type of subdivision edge
VertexFrom
 Start vertex for this edge
VertexTo
 End vertex for this edge
Top
See Also
Reference
SubDEdge Class
Rhino.Geometry Namespace