RhinoCommon API
GpuDeviceInfo Properties
The GpuDeviceInfo type exposes the following members.
Properties
Name | Description
Memory
 Memory of the device in bytes
MemoryAsString
 Memory of the device as a human-readable string
Name
 Name of the device
Vendor
 Vendor of the device
Top
See Also
Reference
GpuDeviceInfo Class
Rhino Namespace