RhinoCommon SDK
InstanceObject Properties
The InstanceObject type exposes the following members.
Properties
Name | Description
InsertionPoint
Basepoint coordinates of a block.
InstanceDefinition
instance definition that this object uses.
InstanceXform
 transformation applied to an instance definition for this object.
Top
See Also
Reference
InstanceObject Class
Rhino.DocObjects Namespace