RhinoCommon SDK
StackedDialogPage Properties
The StackedDialogPage type exposes the following members.
Properties
Name | Description
Children
EnglishPageTitle
HasChildren
LocalPageTitle
PageControl
 Return the control that represents this page. Currently only classes derived from System.Windows.Forms.Control are allowed
ShowDefaultsButton
Called when this page is activated.
Top
See Also
Reference
StackedDialogPage Class
Rhino.UI Namespace