RhinoCommon API
HostUtils Properties
The HostUtils type exposes the following members.
Properties
Name | Description
ComputerSerialNumber
 Gets the serial number of the computer running Rhino.
CurrentOSLanguage
 Get the current operating system language.
DeviceId
 The DeviceId is a unique, stable ID that anonymously identifies the device that Rhino is running on. It is computed based on hardware information that should not change when the OS is upgraded, or if commonly modified hardware are added or removed from the computer. The machine-specific information is hashed using a cryptographic hash to make it anonymous.
DeviceName
 Name of the computer running Rhino. If the computer is part of a Windows Domain, the computer name has "@[DOMAIN]" appended.
OperatingSystemBuildNumber
 Returns Operating System Build Number "11763" | "7601" | ... | "Unknown"
OperatingSystemEdition
 Returns Operating System Edition: "Professional" | "ServerDatacenter" | ... | "Unknown"
OperatingSystemInstallationType
 Returns Operating System Installation Type: "Client" | "Server" | "Unknown"
OperatingSystemProductName
 Returns Operating System Edition: "Professional" | "ServerDatacenter" | ... | "Unknown"
OperatingSystemVersion
 Returns Operating System Version "6.1" | "6.3" | ... | "Unknown"
RunningInDarkMode
 Returns true if the host operating system is in dark mode and Rhino supports dark mode.
RunningInMono
 Tests if this process is currently executing under the Mono runtime.
RunningInRhino
 Tests if RhinoCommon is currently executing inside of the Rhino.exe process. There are other cases where RhinoCommon could be running; specifically inside of Visual Studio when something like a windows form is being worked on in the resource editor or running stand-alone when compiled to be used as a version of OpenNURBS.
RunningOnOSX
 Tests if this process is currently executing on the Mac OSX platform.
RunningOnWindows
 Tests if this process is currently executing on the Windows platform.
SendDebugToCommandLine
 Gets or sets whether debug messages are printed to the command line.
Top
See Also
Reference
HostUtils Class
Rhino.Runtime Namespace