RhinoCommon API
PostEffectThreadEngine Properties
The PostEffectThreadEngine type exposes the following members.
Properties
Name | Description
CppPointer
Top
See Also
Reference
PostEffectThreadEngine Class
Rhino.Render.PostEffects Namespace