RhinoCommon SDK
DimensionStyle Properties
The DimensionStyle type exposes the following members.
Properties
Name | Description
AlternateLengthFactor
AngleResolution
ArrowLength
ArrowType
CenterMarkSize
ExtensionLineExtension
ExtensionLineOffset
FontIndex
Id
Index
IsReference
LeaderArrowLength
LeaderArrowType
LengthFactor
LengthFormat
LengthResolution
Linear display precision.
Name
Prefix
Suffix
TextAlignment
TextGap
TextHeight
Top
See Also
Reference
DimensionStyle Class
Rhino.DocObjects Namespace