RhinoCommon API
GetContextArgs Properties
The GetContextArgs type exposes the following members.
Properties
Name | Description
CallCount
 Number of times Get() has been called for a given getter
ContextName
 Name of the context that this get operation is happening under
ContextObject
 Optional object that may be associated with this get operation
Top
See Also
Reference
GetContextArgs Class
Rhino.Input.Custom Namespace