RhinoCommon API
DisplayPen Properties
The DisplayPen type exposes the following members.
Properties
Name | Description
CapStyle
 How caps are drawn at the ends of open curves
Color
 Color applied to stroke
JoinStyle
 How corners of curves are joined
PatternBySegment
 Restart patterns at corners in a curve
PatternLengthInWorldUnits
 If true, lengths in pattern definition are interpreted to be in world units. If false, screen pixel distances are used.
PatternOffset
 Offset to apply to pattern. If RhinoMath.UnsetSingle, then pattern is centered to keep even dash lengths at ends
Thickness
 Thickness for stoke
Top
See Also
Reference
DisplayPen Class
Rhino.Display Namespace