RhinoCommon SDK
RenderContent Properties
The RenderContent type exposes the following members.
Properties
Name | Description
CanBeEdited
 Determines if the content can be edited.
ChildSlotName
Document
 Get the document this content belongs to or null if the content has not yet been added to a document. This will be null when content is generated for browsers or preview generation.
Fields
 Rhino.Render.Fields FieldDictionary which provides access to setting and retrieving field values.
FilesToEmbed
 A string array of full paths to files used by the content that may be embedded in .3dm files and library files (.rmtl, .renv, .rtex). The default implementation returns an empty string list. Override this to return the file name or file names used by your content. This is typically used by textures that reference files containing the texture imagery.
FirstChild
 Return First child of this content or nullptr if none.
Hidden
 Determines if the content has the hidden flag set.
Id
 Instance identifier for this content.
IsLocked
 Set this property to true prior to adding content to the document to lock the content browser editing UI methods. Setting this to true will keep the browser from allowing things like deleting, renaming or changing content. This is useful for custom child content that you want to be editable but persistent. Setting this after adding content to the document will cause an exception to be thrown.
Name
 Instance name for this content.
NextSibling
 Return First sibling of this content or nullptr if none.
Notes
 Notes for this content.
Parent
 Returns the top content in this parent/child chain.
RenderHash
 Render hash for the content hierarchy. It iterates children and includes a caching mechanism which means the hash value can be retrieved quickly if it hasn't changed. The cache is invalidated when Changed() is called. You can override the CalculateRenderHash() method to provide a custom hash value.
TopLevel
 Returns true if this content has no parent, false if it is the child of another content.
TopLevelParent
 Returns the top content in this parent/child chain.
TypeDescription
 Description for your content type. ie. "Procedural checker pattern"
TypeName
 Name for your content type. ie. "My .net Texture"
Top
See Also
Reference
RenderContent Class
Rhino.Render Namespace