RhinoCommon API
EarlyPostEffectPlugIn Properties
The EarlyPostEffectPlugIn type exposes the following members.
Properties
Name | Description
SerialNumber
Top
See Also
Reference
EarlyPostEffectPlugIn Class
Rhino.Render.PostEffects Namespace