RhinoCommon SDK
RichText Properties
The RichText type exposes the following members.
Properties
Name | Description
FormatHeight
 Text format height
FormatWidth
 Text format width
Height
 Text height
HorizontalAlignment
 Text horizontal alignment
Plane
TextString
VerticalAlignment
 Text vertical alignment
Top
See Also
Reference
RichText Class
Rhino.Geometry Namespace