RhinoCommon API
ChannelEx Properties
The RenderWindow.ChannelEx type exposes the following members.
Properties
Name | Description
CppPointer
Top
See Also
Reference
RenderWindow.ChannelEx Class
Rhino.Render Namespace