RhinoCommon SDK
MeshVertexHiddenList Class
 Provides access to the runtime vertex hidden list in a mesh.
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.MeshVertexHiddenList
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class MeshVertexHiddenList : IResizableList<bool>,
	IList<bool>, ICollection<bool>, IList, ICollection,
	IReadOnlyList, IReadOnlyCollection, IEnumerable<bool>, IEnumerable
Public Class MeshVertexHiddenList
	Implements IResizableList(Of Boolean), IList(Of Boolean),
	ICollection(Of Boolean), IList, ICollection, IReadOnlyList,
	IReadOnlyCollection, IEnumerable(Of Boolean), IEnumerable
The MeshVertexHiddenList type exposes the following members.
Methods
Name | Description
Add
 Adds a new flag at the end of the list.
AddRange
 Appends an array, a list or any enumerable of flags to the end of the list.
Clear
 Clears the hidden vertex list on the mesh. This results in a fully visible mesh.
Contains
 Determines if some vertices are hidden or some are shown.
CopyTo
 Copies to an array, starting at an index.
Destroy
 Releases all memory allocated to store hidden vertices. The list capacity will be 0 after this call.
Vertices will be immediately considered visible.
Subsequent calls can add new items.
GetEnumerator
 Gets an enumerator that yields all flags in this collection.
Top
Properties
Name | Description
Capacity
 Gets or sets the total number of hidden vertex information the internal data structure can hold without resizing.
Count
 Gets or sets the number of hidden vertices. For this to be a valid part of a mesh, this count should be the same as the one of mesh vertices.
HiddenCount
 Gets a value indicating how many vertices have been set to hidden.
Item
 Gets or sets the hidden value at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace