RhinoCommon API
VisualAnalysisMode.AnalysisStyle Enumeration
 Contains enumerated values for analysis styles, such as wireframe, texture or false colors..
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum AnalysisStyle
Public Enumeration AnalysisStyle
Members
Member name | Value | Description
Wireframe | 1 | The analysis is showing with wires.
Texture | 2 | The analysis is showing with textures.
FalseColor | 4 | The analysis is showing with false colors.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Display Namespace