RhinoCommon SDK
SubDFacesIterator Class
[Missing <summary> documentation for "T:Rhino.Geometry.SubDFacesIterator"]
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDFacesIterator
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class SubDFacesIterator : IEnumerable<SubDFace>,
	IEnumerable
Public Class SubDFacesIterator
	Implements IEnumerable(Of SubDFace), IEnumerable
The SubDFacesIterator type exposes the following members.
Methods
Name | Description
GetEnumerator
Top
See Also
Reference
Rhino.Geometry Namespace