RhinoCommon API
AngularDimension Class
 Represents a dimension of an entity that can be measured with an angle.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.Dimension
 Rhino.Geometry.AngularDimension
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class AngularDimension : Dimension
<SerializableAttribute>
Public Class AngularDimension
	Inherits Dimension
The AngularDimension type exposes the following members.
Constructors
Name | Description
AngularDimension()
Initializes a new instance of the AngularDimension class
AngularDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
AngularDimension(Arc, Double)
 Create an angular dimension from a given arc
Top
Properties
Name | Description
AngleFormat
AngleResolution
AngleRoundoff
AngleZeroSuppression
ArrowPoint1
ArrowPoint2
CenterPoint
DefPoint1
DefPoint2
DimlinePoint
Top
Methods
Name | Description
AdjustFromPoints(Plane, Point3d, Point3d, Point3d, Point3d)
 Update Dimension geometry from point locations
AdjustFromPoints(Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Update Dimension geometry from point locations
Create(Guid, Plane, Point3d, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
Create(DimensionStyle, Plane, Vector3d, Point3d, Point3d, Point3d, Point3d)
 Initialize Dimension parameters
Get3dPoints
 Get locations of dimension's 3d points
GetAngleDisplayText
GetDisplayLines
GetTextRectangle
Top
See Also
Reference
Rhino.Geometry Namespace