RhinoCommon API
DisplayTechnology Enumeration
 Graphics display techologies.
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum DisplayTechnology
Public Enumeration DisplayTechnology
Members
Member name | Value | Description
OpenGL | 0
Metal | 1
DirectX | 2
Software | 3
Vulkan | 4
See Also
Reference
Rhino.Display Namespace