RhinoCommon SDK
RLeaderObject Class
 A Rhino Object that represents leader geometry and attributes
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.RLeaderObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class RLeaderObject : RhinoObject
Public Class RLeaderObject
	Inherits RhinoObject
The RLeaderObject type exposes the following members.
Methods
Name | Description
DuplicateLeaderGeometry
 Constructs a deep (full) copy of the RLeader geometry.
Top
Properties
Name | Description
LeaderGeometry
 Get the Leader geometry for this object.
Top
See Also
Reference
Rhino.DocObjects Namespace