RhinoCommon SDK
ShowMessageBoxMode Enumeration
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageBoxMode"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum ShowMessageBoxMode
Public Enumeration ShowMessageBoxMode
Members
Member name | Value | Description
ApplicationModal | 0
SystemModal | 4096
TaskModal | 8192
See Also
Reference
Rhino.UI Namespace