RhinoCommon API
ListablePostEffectPlugIn Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.ListablePostEffectPlugIn"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.PostEffectPlugIn
 Rhino.Render.PostEffects.ListablePostEffectPlugIn
 Rhino.Render.PostEffects.EarlyPostEffectPlugIn
 Rhino.Render.PostEffects.LatePostEffectPlugIn
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ListablePostEffectPlugIn : PostEffectPlugIn
Public Class ListablePostEffectPlugIn
	Inherits PostEffectPlugIn
The ListablePostEffectPlugIn type exposes the following members.
Constructors
Name | Description
ListablePostEffectPlugIn
Initializes a new instance of the ListablePostEffectPlugIn class
Top
Properties
Name | Description
Top
Methods
Name | Description
Fixed
 Return true if the PEP is fixed, else false. Fixed plug-ins cannot be un-shown by the user, although they can be turned off.
On
 Return true if the PEP is turned on. Only PEPs that are on will execute.
SetOn
 Turn the PEP on or off.
SetShown
 Show or hide the PEP.
Shown
 return true if the PEP is shown in a list. Only PEPs that are shown will execute.
Top
Fields
Name | Description
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render.PostEffects Namespace