RhinoCommon API
SubDEdge Class
 Single edge of a SubD
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDComponent
 Rhino.Geometry.SubDEdge
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class SubDEdge : SubDComponent
Public NotInheritable Class SubDEdge
	Inherits SubDComponent
The SubDEdge type exposes the following members.
Properties
Name | Description
ControlNetLine
 Line representing the control net end points
FaceCount
 Number of faces for this edge
Tag
 identifies the type of subdivision edge
VertexFrom
 Start vertex for this edge
VertexTo
 End vertex for this edge
Top
Methods
Name | Description
FaceAt
 Retrieve a SubDFace from this edge
ToNurbsCurve
 Get a cubic, uniform, nonrational, NURBS curve that is on the edge's limit curve.
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Geometry Namespace