RhinoCommon API
TextureEvaluator Class
 This is the interface to a lightweight object capable of evaluating texture color throughout uvw space. Derive from this class to create your own texture evaluator to return from a custom RenderTexture.
Inheritance Hierarchy
System.Object
 Rhino.Render.TextureEvaluator
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class TextureEvaluator : IDisposable
Public Class TextureEvaluator
	Implements IDisposable
The TextureEvaluator type exposes the following members.
Constructors
Name | Description
TextureEvaluator() |  Obsolete.
 Base class constructor
TextureEvaluator(RenderTexture.TextureEvaluatorFlags)
 Base class constructor
Top
Methods
Name | Description
CanBeDumpedToBytes
 Fast access to bitmap evaluator for Cycles - supply size (which you will probably have received from CRhRdkTexture::PixelSize) to see if the data can be extracted direct to a width*height*4 array of unsigned chars. This is implemented by EVF(L"CanBeDumpedToBytes", ON_2iSize*) != nullptr;
Dispose()
 For Dispose pattern
Dispose(Boolean)
 For Dispose pattern
DumpToBytes
 Fast access to bitmap evaluator for Cycles - supply size (which you will probably have received from CRhRdkTexture::PixelSize) to see if the data can be extracted direct to a width*height*4 array of unsigned chars. This is implemented by EVF(L"CanBeDumpedToBytes", ON_2iSize*) != nullptr;
Finalize
 For Dispose pattern
 (Overrides Object.Finalize().)
FreeByteArray
GetByteArrayValue
GetColor(Point3d, Vector3d, Vector3d)
 Get the color of the texture at a particular point in uvw space. May be called from within a rendering shade pipeline. note For ray differentials see Pharr Humphreys, "Physically Based Rendering", chapter 11.
GetColor(Point3d, Vector3d, Vector3d, Color4f)
 Optimized version of GetColor for callers. Much faster in the case of a native (C++) evaluator.
Initialize
 Call this function before calling GetColor for the first time. Ideally, this should be on the main thread, but you can also call it on a worker thread as long as you are sure that Initialize() or GetColor() cannot be called at the same time on another thread.
NewByteArray
Rdk_TextureEvaluator_ApplyGamma
SetByteArrayValue
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render Namespace