RhinoCommon SDK
RenderContent Class
[Missing <summary> documentation for "T:Rhino.Render.RenderContent"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderContent
 Rhino.Render.RenderEnvironment
 Rhino.Render.RenderMaterial
 Rhino.Render.RenderTexture
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public abstract class RenderContent : IDisposable
Public MustInherit Class RenderContent
	Implements IDisposable
The RenderContent type exposes the following members.
Methods
Name | Description
AddAutomaticUserInterfaceSection
 Add a new automatic user interface section, Field values which include prompts will be automatically added to this section.
AddChild(RenderContent) |  Obsolete.
AddChild(RenderContent, String) |  Obsolete.
AddPersistentRenderContent(RenderContent) |  Obsolete.
 Add a material, environment or texture to the internal RDK document lists as top level content. The content must have been returned from RenderContent::MakeCopy, NewContentFromType or a similar function that returns a non-document content.
AddPersistentRenderContent(RhinoDoc, RenderContent)
 Add a material, environment or texture to the internal RDK document lists as top level content. The content must have been returned from RenderContent::MakeCopy, NewContentFromType or a similar function that returns a non-document content.
AddUserInterfaceSection
 Add a new .NET control to an content expandable tab section, the height of the createExpanded tabs client area will be the initial height of the specified control.
BeginChange
 Begins a change or batch of changes. This returns a reference to the content which you should use to make your changes. It may also make a copy of the content state allowing EndChange() to send an event with the old and new contents. Calls to this method are counted; you must call EndChange() once for every call to BeginChange(). Note: If Changed() was called between the calls to BeginChange() and EndChange(), the last call to EndChange() may cause the ContentChanged event to be sent.
BindParameterToField(String, Field, RenderContent.ChangeContexts)
 Use bindings to automatically wire parameters to fields
BindParameterToField(String, String, Field, RenderContent.ChangeContexts)
 Use bindings to automatically wire parameters to fields
CalculateRenderHash
 Override this method to calculate the render hash of the state that affects how the content is rendered. Does not include children or perform any caching. Render hash values are now automatically cached by the content framework and you do not have to worry about caching. You also do not have to worry about iterating into children. This method is now only called internally by the framework, use the RenderHash property to get the current hash value.
ChangeChild |  Obsolete.
ChildSlotAmount
 Gets the amount property for the texture in the specified child slot. Values are typically from 0.0 - 100.0
ChildSlotNameFromParamName
 A "child slot" is the specific "slot" that a child (usually a texture) occupies. This is generally the "use" of the child - in other words, the thing the child operates on. Some examples are "color", "transparency".
ChildSlotOn
 Gets the on-ness property for the texture in the specified child slot.
Create(Guid, RenderContent.ShowContentChooserFlags, RhinoDoc)
 Constructs a new content of the specified type and add it to the persistent content list. This function cannot be used to create temporary content that you delete after use. Content created by this function is owned by RDK and appears in the content editor. To create a temporary content which is owned by you, call RhRdkContentFactories().NewContentFromType().
Create(Type, RenderContent.ShowContentChooserFlags, RhinoDoc)
 Constructs a new content of the specified type and add it to the persistent content list. This function cannot be used to create temporary content that you delete after use. Content created by this function is owned by RDK and appears in the content editor. To create a temporary content which is owned by you, call RhRdkContentFactories().NewContentFromType().
Create(Guid, RenderContent, String, RenderContent.ShowContentChooserFlags, RhinoDoc)
 Constructs a new content of the specified type and add it to the persistent content list. This function cannot be used to create temporary content that you delete after use. Content created by this function is owned by RDK and appears in the content editor. To create a temporary content which is owned by you, call RhRdkContentFactories().NewContentFromType().
Create(Type, RenderContent, String, RenderContent.ShowContentChooserFlags, RhinoDoc)
 Constructs a new content of the specified type and add it to the persistent content list. This function cannot be used to create temporary content that you delete after use. Content created by this function is owned by RDK and appears in the content editor. To create a temporary content which is owned by you, call RhRdkContentFactories().NewContentFromType().
DeleteAllChildren
DeleteChild
Dispose()
Releases all resources used by the RenderContent
Dispose(Boolean)
Releases the unmanaged resources used by the RenderContent and optionally releases the managed resources
EndChange
 Ends a change or batch of changes. Calls to this method are counted; you must call this method once for every call to BeginChange(RenderContent.ChangeContexts). Note: If BeginChange(RenderContent.ChangeContexts) was called with ChangeContexts.UI, ChangeContexts.Program, ChangeContexts.Drop or ChangeContexts.UI.Tree and Changed() was called between the calls to BeginChange(RenderContent.ChangeContexts) and EndChange(), the last call to EndChange() will raise the ContentChanged event.
Finalize |  (Overrides Object.Finalize().)
FindChild
FromId
 Search for a content object based on its Id
GetChildSlotParameter
 Extra requirements are a way of specifying extra functionality on parameters in the automatic UI. Implement this function to specify additional functionality for automatic UI sections or the texture summary. See IAutoUIExtraRequirements.h in the C++ RDK for string definitions for the parameter names.
GetEmbeddedFilesList
GetParameter
 Query the content instance for the value of a given named parameter. If you do not support this parameter, call the base class.
Icon
 Icon to display in the content browser, this bitmap needs to be valid for the life of this content object, the content object that returns the bitmap is responsible for disposing of the bitmap.
IsFactoryProductAcceptableAsChild
 Override this method to restrict the type of acceptable child content. The default implementation of this method just returns true.
IsRenderHashCached |  Obsolete.
 This method is deprecated and no longer called. For more information see CalculateRenderHash()
LoadFromFile
 Loads content from a library file. Does not add the content to the persistent content list. Use AddPersistantContent to add it to the list.
ModifyRenderContentStyles
OnAddUserInterfaceSections
 Override to provide UI sections to display in the editor.
OnGetDefaultsInteractive
 Override this method to prompt user for information necessary to create a new content object. For example, if you are created a textured material you may prompt the user for a bitmap file name prior to creating the textured material.
OpenInEditor
 Call this method to open the content in the relevant thumbnail editor and select it for editing by the user. The content must be in the document or the call will fail.
OpenInModalEditor
 Call this method to open the content in the a modal version of the editor. The content must be in the document or the call will fail.
ParamNameFromChildSlotName
 A "child slot" is the specific "slot" that a child (usually a texture) occupies. This is generally the "use" of the child - in other words, the thing the child operates on. Some examples are "color", "transparency".
RegisterContent(PlugIn)
 Call RegisterContent in your plug-in's OnLoad function in order to register all of the custom RenderContent classes in your assembly.
RegisterContent(Assembly, Guid)
 Call RegisterContent in your plug-in's OnLoad function in order to register all of the custom RenderContent classes in your assembly.
SetChild
 Set another content as a child of this content. This content may or may not be attached to a document. If this content already has a child with the specified child slot name, that child will be deleted. If this content is not attached to a document, the child will be added without sending any events. If this content is attached to a document, the necessary events will be sent to update the UI. Note: Do not call this method to add children in your constructor. If you want to add default children, you should override Initialize() and add them there.
SetChildSlotAmount
 Sets the amount property for the texture in the specified child slot. Values are typically from 0.0 - 100.0
SetChildSlotOn
 Sets the on-ness property for the texture in the specified child slot.
SetChildSlotParameter
 Extra requirements are a way of specifying extra functionality on parameters in the automatic UI. Implement this function to support values being set from automatic UI sections or the texture summary. See IAutoUIExtraRequirements.h in the C++ RDK for string definitions for the parameter names.
SetParameter(String, Object)
 Set the named parameter value for this content instance. If you do not support this parameter, call the base class.
SetParameter(String, Object, RenderContent.ChangeContexts)
 Set the named parameter value for this content instance. If you do not support this parameter, call the base class.
SetRenderHash |  Obsolete.
 This method is deprecated and no longer called. For more information see CalculateRenderHash()
Top
Properties
Name | Description
CanBeEdited
 Determines if the content can be edited.
ChildSlotName
Document
 Get the document this content belongs to or null if the content has not yet been added to a document. This will be null when content is generated for browsers or preview generation.
Fields
 Rhino.Render.Fields FieldDictionary which provides access to setting and retrieving field values.
FilesToEmbed
 A string array of full paths to files used by the content that may be embedded in .3dm files and library files (.rmtl, .renv, .rtex). The default implementation returns an empty string list. Override this to return the file name or file names used by your content. This is typically used by textures that reference files containing the texture imagery.
FirstChild
 Return First child of this content or nullptr if none.
Hidden
 Determines if the content has the hidden flag set.
Id
 Instance identifier for this content.
IsLocked
 Set this property to true prior to adding content to the document to lock the content browser editing UI methods. Setting this to true will keep the browser from allowing things like deleting, renaming or changing content. This is useful for custom child content that you want to be editable but persistent. Setting this after adding content to the document will cause an exception to be thrown.
Name
 Instance name for this content.
NextSibling
 Return First sibling of this content or nullptr if none.
Notes
 Notes for this content.
Parent
 Returns the top content in this parent/child chain.
RenderHash
 Render hash for the content hierarchy. It iterates children and includes a caching mechanism which means the hash value can be retrieved quickly if it hasn't changed. The cache is invalidated when Changed() is called. You can override the CalculateRenderHash() method to provide a custom hash value.
TopLevel
 Returns true if this content has no parent, false if it is the child of another content.
TopLevelParent
 Returns the top content in this parent/child chain.
TypeDescription
 Description for your content type. ie. "Procedural checker pattern"
TypeName
 Name for your content type. ie. "My .net Texture"
Top
Events
Name | Description
ContentAdded
 Used to monitor render content addition to the document.
ContentChanged
 Used to monitor render content modifications.
ContentDeleted
 Used to monitor render content deletion from the document.
ContentDeleting
 Used to monitor render content deletion from the document.
ContentFieldChanged
 This event is raised when a field value is modified.
ContentRenamed
 Used to monitor render content renaming in the document.
ContentReplaced
 Used to monitor render content replacing in the document.
ContentReplacing
 Used to monitor render content replacing in the document.
ContentUpdatePreview
 Used to monitor render content preview updates.
Top
See Also
Reference
Rhino.Render Namespace