RhinoCommon SDK
RLeader Class
 Leader geometry class
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.RLeader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class RLeader : GeometryBase
<SerializableAttribute>
Public Class RLeader
	Inherits GeometryBase
The RLeader type exposes the following members.
Constructors
Name | Description
RLeader
 Constructotr
Top
Methods
Name | Description
Create
 Creates a RLeader geometry object
Top
Properties
Name | Description
ArrowSize
 Size of leader arrow
ArrowType
 Type of arrow used by the leader
AttachStyle
 How text aligns vertically with the leader tail
ContentAngleStyle
 How content angle aligns with leader tail
ContentType
 Type of annotation on the leader Currently only text
Curve
 Gets the curve used by this leader
CurveType
 Shape of the curve used by this leader
HasLanding
 Determines if the leader has a landing segment or not Landing is a small segment between last leader point and content
LandingLength
 Length of landing segment if there is one
LeaderScale
 Value to scale all sizes in the leader by
Plane
 Get and set Leaders Plane
Points2D
 Get or set the 2d points defining the curve used by this leader
Points3D
 Get or set the 3d points defining the curve used by this leader
Text
 Gets the text used by this leader
TextGap
 Gap between leader tail and text in the leader
TextHeight
 Height of text in the leader
TextString
 Return text string from RichText used by this leader
UserArrowheadName
 Name of block for user defined arrow
Top
See Also
Reference
Rhino.Geometry Namespace