RhinoCommon SDK
LeaderContentType Enumeration
 Type of content used by leader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum LeaderContentType
Public Enumeration LeaderContentType
Members
Member name | Value | Description
NoContent | 0 |  Nothing
Text | 1 |  Text
TextDot | 2 |  TextDot
Block | 3 |  Userdefined block
See Also
Reference
Rhino.Geometry Namespace