RhinoCommon SDK
TextStyleTable Class
 A TextStyleTable manages a collection of TextStyles
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.TextStyleTable
Namespace: Rhino.DocObjects.Tables
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class TextStyleTable : IEnumerable<TextStyle>,
	IEnumerable, IRhinoTable<TextStyle>
Public NotInheritable Class TextStyleTable
	Implements IEnumerable(Of TextStyle), IEnumerable,
	IRhinoTable(Of TextStyle)
The TextStyleTable type exposes the following members.
Methods
Name | Description
FindFont
 Returns the array index of the style with id == FontId or -1 if not found
GetEnumerator
 for IEnumerable(TextStyle)
Top
Properties
Name | Description
Count
 Returns number of text styles in the textstyle table, including deleted styles.
Document
Document that owns this table.
Item
 Returns a TextStyle at [index] in the TextStyleTable
Top
See Also
Reference
Rhino.DocObjects.Tables Namespace