RhinoCommon API
DimensionStyle.MaskFrame Enumeration
 Draw a frame stroke around the text mask area
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum MaskFrame
Public Enumeration MaskFrame
Members
Member name | Value | Description
NoFrame | 0 |  Text mask frame not drawn
RectFrame | 1 |  Text mask frame outline rectangle drawn
See Also
Reference
Rhino.DocObjects Namespace