RhinoCommon SDK
Decals Class
Represents all the decals of an object.
Inheritance Hierarchy
System.Object
 Rhino.Render.Decals
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class Decals : IEnumerable<Decal>,
	IEnumerable
Public Class Decals
	Implements IEnumerable(Of Decal), IEnumerable
The Decals type exposes the following members.
Methods
Name | Description
Add
 Add a new Decal to the decals list, use Decal.Create to create a new decal instance to add.
Clear
GetEnumerator
Remove
Top
See Also
Reference
Rhino.Render Namespace