RhinoCommon API
RenderWindow.ChannelGPU Class
[Missing <summary> documentation for "T:Rhino.Render.RenderWindow.ChannelGPU"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderWindow.ChannelGPU
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ChannelGPU : IDisposable
Public Class ChannelGPU
	Implements IDisposable
The RenderWindow.ChannelGPU type exposes the following members.
Properties
Name | Description
DisplayTechnology
 Return the type of API used for this channel's texture handle.
Top
Methods
Name | Description
Clone
 Return a clone of the channel.
Close
 Close the channel.
CopyTo
 Copy the channel to a 'CPU' channel.
Dispose
 Dispose of the channel.
Finalize |  (Overrides Object.Finalize().)
Height
 Return the channel height.
Id
 Return the channel id.
PixelSize
 Return the size of one pixel's data in the channel.
TextureHandle
 Return the channel's texture handle.
Width
 Return the channel width.
Top
See Also
Reference
Rhino.Render Namespace