RhinoCommon SDK
RenderContentDeleteReason Enumeration
 Reason content is being detached from a document. see ContentDetaching,
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum RenderContentDeleteReason
Public Enumeration RenderContentDeleteReason
Members
Member name | Value | Description
Detach | 0 |  Content is being detached by the RenderContent.DeleteContent() method.
Change | 1 |  Content is being detached while changing.
Undo | 2 |  Content is being detached during undo/redo.
Delete | 4 |  Content is being detached during normal deletion.
See Also
Reference
Rhino.Render Namespace