RhinoCommon API
RenderMaterial.StandardChildSlots Enumeration
 Defines enumerated constant values for use in TextureChildSlotName(RenderMaterial.StandardChildSlots) method.
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum StandardChildSlots
Public Enumeration StandardChildSlots
Members
Member name | Value | Description
None | 0 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::None.
Diffuse | 1 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::Diffuse.
Transparency | 2 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::Transparency
Bump | 4 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::Bump
Environment | 8 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::Environment
PbrBaseColor | 1 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_base_color
PbrSubsurface | 32 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_subsurface
PbrSubSurfaceScattering | 64 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_subsurface_scattering
PbrSubsurfaceScatteringRadius | 128 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_subsurface_scattering_radius
PbrMetallic | 256 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_metallic
PbrSpecular | 512 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_specular
PbrSpecularTint | 1024 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_specular_tint
PbrRoughness | 2048 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_roughness
PbrAnisotropic | 4096 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_anisotropic
PbrAnisotropicRotation | 8192 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_anisotropic_rotation
PbrSheen | 16384 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_sheen
PbrSheenTint | 32768 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_sheen_tint
PbrClearcoat | 65536 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_clearcoat
PbrClearcoatRoughness | 131072 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_clearcoat_roughness
PbrOpacityIor | 262144 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_opacity_ior
PbrOpacity | 2 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_opacity
PbrOpacityRoughness | 524288 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_opacity_roughness
PbrEmission | 1048576 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_emission
PbrAmbientOcclusion | 2097152 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_ambient_occlusion
PbrDisplacement | 8388608 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_smudge
PbrClearcoatBump | 16777216 |  Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_clearcoat_roughness
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render Namespace