RhinoCommon SDK
TextVerticalAlignment Enumeration
[Missing <summary> documentation for "T:Rhino.Geometry.TextVerticalAlignment"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum TextVerticalAlignment
Public Enumeration TextVerticalAlignment
Members
Member name | Value | Description
Bottom | 0
Middle | 1
Top | 2
See Also
Reference
Rhino.Geometry Namespace