RhinoCommon SDK
LinearWorkflow Class
 ChangeQueue LinearWorkflow
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.LinearWorkflow
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class LinearWorkflow
Public Class LinearWorkflow
The LinearWorkflow type exposes the following members.
Methods
Name | Description
Top
Properties
Name | Description
Active
 True if linear workflow is active
Gamma
 Get gamma
GammaReciprocal
 Get gamma reciprocal
Top
See Also
Reference
Rhino.Render.ChangeQueue Namespace