RhinoCommon API
RenderMaterial.PhysicallyBased Class
 Helper class with fields containing the names of fields available in our PBR implementation.
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderMaterial.PhysicallyBased
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PhysicallyBased
Public Class PhysicallyBased
The RenderMaterial.PhysicallyBased type exposes the following members.
Constructors
Name | Description
RenderMaterial.PhysicallyBased
Initializes a new instance of the RenderMaterial.PhysicallyBased class
Top
Methods
Name | Description
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render Namespace