RhinoCommon SDK
DisplayPipelineAttributes.MeshDisplayAttributes Class
[Missing <summary> documentation for "T:Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes"]
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes
Namespace: Rhino.Display
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class MeshDisplayAttributes
Public NotInheritable Class MeshDisplayAttributes
The DisplayPipelineAttributes.MeshDisplayAttributes type exposes the following members.
Methods
Name | Description
Top
Properties
Name | Description
AllMeshWiresColor
 Color.Empty means that we are NOT using a single color for all mesh wires.
HighlightMeshes
MeshWireThickness
ShowMeshVertices
ShowMeshWires
Top
See Also
Reference
Rhino.Display Namespace