RhinoCommon API
PostEffectPipeline.Init Enumeration
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffectPipeline.Init"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum Init
Public Enumeration Init
Members
Member name | Value | Description
Empty | 0
Zero | 1
Copy | 2
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render.PostEffects Namespace