RhinoCommon API
Skin Class
 Represents a customized environment that changes the appearance of Rhino.
Skin DLLs must contain a single class that derives from the Skin class.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.Skin
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class Skin
Public MustInherit Class Skin
The Skin type exposes the following members.
Constructors
Name | Description
Skin
 Initializes a new instance of the Skin class.
Top
Properties
Name | Description
ActiveSkin
 Any time Rhino is running there is at most one skin being used (and possibly no skin). If a RhinoCommon based Skin class is being used, use ActiveSkin to get at the instance of this Skin class. May return null if no Skin is being used or if the skin is not a RhinoCommon based skin.
ApplicationName
If you want to provide a custom name for your skin.
MainRhinoIcon
If you want to provide a custom icon for your skin.
Settings
 Gets access to the skin persistent settings.
Top
Methods
Name | Description
HideSplash
Is called when the splash screen should be hidden.
OnBeginLoadAtStartPlugIns
Is called when the first plug-in that loads at start-up is going to be loaded.
OnBeginLoadPlugIn
Is called when a specific plug-in is going to be loaded.
OnBuiltInCommandsRegistered
Is called when built-in commands are registered.
OnEndLoadAtStartPlugIns
Is called after all of the load at start plug-ins have been loaded.
OnEndLoadPlugIn
Is called after each plug-in has been loaded.
OnLicenseCheckCompleted
Is called when the license check is completed.
OnMainFrameWindowCreated
Is called when the main frame window is created.
ShowHelp
 Called when the "help" splash screen should be shown. Default implementation just calls ShowSplash()
ShowSplash
Is called when the splash screen should be shown.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Runtime Namespace