RhinoCommon SDK
GroundPlane Class
 ChangeQueue ground plane
Inheritance Hierarchy
System.Object
 Rhino.Render.ChangeQueue.GroundPlane
Namespace: Rhino.Render.ChangeQueue
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class GroundPlane
Public Class GroundPlane
The GroundPlane type exposes the following members.
Methods
Name | Description
Top
Properties
Name | Description
Altitude
 Get the altitude for ground plane
Enabled
 Return true if ground plane is enabled
MaterialId
 The CRC / RenderHash of the material on this ground plane
TextureOffset
 Get texture offset on the ground plane
TextureScale
 Get texture scale on the ground plane
Top
See Also
Reference
Rhino.Render.ChangeQueue Namespace