RhinoCommon API
SubDHashType Enumeration
 ON_SubDHashType used used to specify what set of information is hashed (topology or geometry).
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SubDHashType
Public Enumeration SubDHashType
Members
Member name | Value | Description
Unset | 0 |  Unset indicates the hash type still needs to be selected. It is not a valid type for calculating a hash.
Topology | 1 |  A topology hash includes component ids, edge tags, and all topological relationships between vertices, edges, and faces. Note that edge tags are not a mathematically topological attribute, however creased edges divide the SubD into strong visual regions and change what many contexts consider to be the connected components. A topology hash ignores vertex control net points.
Geometry | 2 |  A geometry hash includes all information in a toplogy hash. In addition, a geometry hash includes vertex tags, vertex control net points, and nonzero subdivision displacements on vertices, edges, and faces. If two SubDs have the same geometry hash, then they have identical surface geometry.
See Also
Reference
Rhino.Geometry Namespace