RhinoCommon API
IPanelsService Interface
 For internal use, the IPanels service is implemented in RhinoWindows or RhinoMac as appropriate and handles the communication with core Rhino
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IPanelsService
Public Interface IPanelsService
The IPanelsService type exposes the following members.
Methods
Name | Description
ClosePanel
DestroyNativeWindow
GetOpenPanelIds
GetPanel
IsPanelVisible
OpenPanel(Guid)
OpenPanel(Guid, Guid)
OpenPanelAsSibling
PanelDockBar
RegisterPanel
SetF1Hook
SupportedType
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.UI Namespace