RhinoCommon API
CustomEvent Class
 This class contains the event for CustomEvents that are fired from RDK .
Inheritance Hierarchy
System.Object
 Rhino.Render.CustomEvent
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class CustomEvent
Public NotInheritable Class CustomEvent
The CustomEvent type exposes the following members.
Events
Name | Description
OnCustomEvent
 This event is raised when a Custom Event is triggered in rdk.
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render Namespace