RhinoCommon API
NamedParametersEventArgs Class
 Dictionary style class used for named callbacks from C++ -> .NET
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Runtime.NamedParametersEventArgs
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class NamedParametersEventArgs : EventArgs,
	IDisposable
Public Class NamedParametersEventArgs
	Inherits EventArgs
	Implements IDisposable
The NamedParametersEventArgs type exposes the following members.
Constructors
Name | Description
NamedParametersEventArgs
 Construct a new named parameter even args. You should dispose this class when you are done with it
Top
Methods
Name | Description
Dispose
 Dispose native resources
Finalize
 Finalizer in case Dispose wasn't called
 (Overrides Object.Finalize().)
Set(String, GeometryBase)
 Set geometry for a given key name
Set(String, Point3d)
 Set a Point3d value for a given key name
Set(String, Boolean)
 Set a bool value for a given key name
Set(String, IEnumerable<GeometryBase>)
 Set a list of geometry for a given key name
Set(String, IEnumerable<String>)
 Set a list of strings as a value for a given key name
Set(String, Double)
 Set a double value for a given key name
Set(String, Color)
 Set a Point3d value for a given key name
Set(String, Int32)
 Set an int value for a given key name
Set(String, String)
 Set a string value for a given key name
Set(String, UInt32)
 Set an unsigned int for a given key name
SetWindowHandle
 Set a HWND on Windows or NSView* on Mac
TryGetBool
 Try to get a bool value for a given key name
TryGetColor
 Try to get a Point3d value for a given key name
TryGetDouble
 Try to get a double value for a given key name
TryGetGeometry
TryGetInt
 Try to get an int value for a given key name
TryGetPoint
 Try to get a Point3d value for a given key name
TryGetRhinoObjects
 Get array of RhinoObject for the specified key
TryGetString
 Try to get a string value for a given key name
TryGetStrings
 Try to get a string value for a given key name
TryGetUnsignedInt
 Try to get an unsigned int for a given key name
TryGetViewport
 Try to get a viewport for a given key name
TryGetWindowHandle
 Gets a HWND on Windows or NSVIew* on Mac
Top
See Also
Reference
Rhino.Runtime Namespace