RhinoCommon SDK
ImageFileEventArgs Class
[Missing <summary> documentation for "T:Rhino.Render.ImageFileEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.ImageFileEventArgs
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class ImageFileEventArgs : EventArgs
Public Class ImageFileEventArgs
	Inherits EventArgs
The ImageFileEventArgs type exposes the following members.
Methods
Name | Description
Top
Properties
Name | Description
EllapsedTime
Event
FileName
RenderEngine
RenderEngineId
SessionId
Top
See Also
Reference
Rhino.Render Namespace