RhinoCommon API
PhysicallyBasedMaterial.BRDFs Enumeration
[Missing <summary> documentation for "T:Rhino.Render.PhysicallyBasedMaterial.BRDFs"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum BRDFs
Public Enumeration BRDFs
Members
Member name | Value | Description
GGX | 0
Ward | 1
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render Namespace