RhinoCommon SDK
ShowMessageBoxButton Enumeration
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageBoxButton"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum ShowMessageBoxButton
Public Enumeration ShowMessageBoxButton
Members
Member name | Value | Description
OK | 0
OKCancel | 1
AbortRetryIgnore | 2
YesNoCancel | 3
YesNo | 4
RetryCancel | 5
See Also
Reference
Rhino.UI Namespace