RhinoCommon API
MaterialTable Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.MaterialTable"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.MaterialTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class MaterialTable : IEnumerable<Material>,
	IEnumerable
Public NotInheritable Class MaterialTable
	Implements IEnumerable(Of Material), IEnumerable
The MaterialTable type exposes the following members.
Properties
Name | Description
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
 Returns number of materials in the material table, including deleted materials.
In Rhino for Windows 7.0, this member is inherited from .CommonComponentTable<T>Count.
CurrentMaterialIndex
 At all times, there is a "current" material. Unless otherwise specified, new objects are assigned to the current material. The current material is never locked, hidden, or deleted.
CurrentMaterialSource
 Gets or sets the current material source.
Document
Document that owns this table.
In Rhino for Windows 7.0, this member is inherited from .RhinoDocCommonTable<T>Document.
Item
 Conceptually, the material table is an array of materials. The operator[] can be used to get individual materials. A material is either active or deleted and this state is reported by Material.IsDeleted.
Top
Methods
Name | Description
Add()
 Adds a new material to the table based on the default material.
Add(Material)
 Adds a new material to the table based on a given material.
Add(Material, Boolean)
 Adds a new material to the table based on a given material.
Delete |  (Overrides CommonComponentTable<T>.Delete(T).)
DeleteAt
 Removes a material at a specific position from this material table.
Find(Guid, Boolean)
Finds a material with a matching id.
Find(String, Boolean)
 Finds a material with a given name.
FindIndex
 Retrieves a Material object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
GetEnumerator
In Rhino for Windows 7.0, this member is inherited from .CommonComponentTable<T>GetEnumerator().
Modify
Modify material settings.
ResetMaterial
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.DocObjects.Tables Namespace