RhinoCommon SDK
AnnotationArrowheadType Enumeration
 Arrowhead types for annotation objects
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum AnnotationArrowheadType
Public Enumeration AnnotationArrowheadType
Members
Member name | Value | Description
NoArrow | 0 |  User defined
User | 1 |  User defined
SolidTriangle | 2 |  2:1
Dot | 3
Tick | 4
ShortTriangle | 5 |  1:1
Arrow | 6
Rectangle | 7
LongTriangle | 8 |  4:1
LongerTriangle | 9 |  6:1
See Also
Reference
Rhino.Geometry Namespace