RhinoCommon API
QuadRemeshSymmetryAxis Enumeration
 Symmetrical meshing axis
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[FlagsAttribute]
public enum QuadRemeshSymmetryAxis
<FlagsAttribute>
Public Enumeration QuadRemeshSymmetryAxis
Members
Member name | Value | Description
None | 0 |  No symmetric remeshing
X | 1 |  Symmetry across X axis
Y | 2 |  Symmetry across Y axis
Z | 4 |  Symmetry across Z axis
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Geometry Namespace