RhinoCommon API
SetsCombinations Enumeration
 Marks mesh intersection events for consideration if they happen within the same mesh, between different meshes, or in any case.
 Namespace: Rhino.Geometry.Intersect
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SetsCombinations
Public Enumeration SetsCombinations
Members
Member name | Value | Description
Cross | 0 |  Events happen between different meshes.
Self | 1 |  Events happen within the mesh only.
Both | 2 |  All events.
VALIDITY_MARK | 3 |  (Internal usage) For bound checking only.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Geometry.Intersect Namespace