RhinoCommon SDK
ShowMessageBoxIcon Enumeration
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageBoxIcon"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum ShowMessageBoxIcon
Public Enumeration ShowMessageBoxIcon
Members
Member name | Value | Description
None | 0
Error | 16
Hand | 16
Stop | 16
Question | 32
Exclamation | 48
Warning | 48
Information | 64
Asterisk | 64
See Also
Reference
Rhino.UI Namespace