RhinoCommon SDK
RichText Class
 Represents a geometric rich text object.
This is fundamentally a class that derives from GeometryBase and contains RichText.
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.RichText
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class RichText : GeometryBase
<SerializableAttribute>
Public Class RichText
	Inherits GeometryBase
The RichText type exposes the following members.
Constructors
Name | Description
RichText
 Protected constructor for internal use.
Top
Methods
Name | Description
Create
 Create RichText geometry or null if input is invalid
SetTextString
Top
Properties
Name | Description
FormatHeight
 Text format height
FormatWidth
 Text format width
Height
 Text height
HorizontalAlignment
 Text horizontal alignment
Plane
TextString
VerticalAlignment
 Text vertical alignment
Top
See Also
Reference
Rhino.Geometry Namespace