RhinoCommon SDK
PointObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.PointObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.PointObject
 Rhino.DocObjects.Custom.CustomPointObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class PointObject : RhinoObject
Public Class PointObject
	Inherits RhinoObject
The PointObject type exposes the following members.
Methods
Name | Description
DuplicatePointGeometry
Top
Properties
Name | Description
PointGeometry
Top
See Also
Reference
Rhino.DocObjects Namespace