RhinoCommon API
AdvancedSetting Enumeration
Advanced setting Id
 Namespace: Rhino.Runtime
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum AdvancedSetting
Public Enumeration AdvancedSetting
Members
Member name | Value | Description
UseNewDraftAngleAnalysisUi | 0 |  UseNewDraftAngleAnalysisUi bool Value, defaults to true
UseCompressionWhenSaving | 1 |  Use compressed buffers when saving 3dm files. bool Value, defults to true
TestAdvancedString | 2 |  String value, defaults to "test string"
TestAdvancedInt | 3 |  Integer value, defaults 123
PdfOptionalContentGroups | 4 |  How optional content should be included when exporting PDF files
LeaveFloatingPanelsHiddenOnMac | 5 |  Bool value used on Mac to satisfy a user request to hide floating stuff when a command starts and leave it hidden when the command ends. This is false by default. https://mcneel.myjetbrains.com/youtrack/issue/RH-57945
DisableFileWatchers | 6 |  Disable file watchers, using to diagnose Mac Rhino mystery crashes https://mcneel.myjetbrains.com/youtrack/issue/RH-52805
EnableCheckForUpdates | 7 |  Auto check for update, enabled by default on Mac, does not show up in Windows https://mcneel.myjetbrains.com/youtrack/issue/RH-60427
LeftJustifyNumericText | 8 |  This is mainly a issue on Windows, currently there are several different numeric controls scattered across the product and no consistent text alignment. This is an attempt to provide a way to control the preferred alignment style.
EnableWindowsGestures | 9 |  https://mcneel.myjetbrains.com/youtrack/issue/RH-62173 Disable gestures for Windows views for a customer who was complaining when upgrading.
MakeInteriorNgonVertexesSelectable | 10 |  Set this to false if you only want boundary vertexes selectable when you run PointsOn. https://mcneel.myjetbrains.com/youtrack/issue/RH-62140
See Also
Reference
Rhino.Runtime Namespace