RhinoCommon SDK
ShowMessageBoxResult Enumeration
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageBoxResult"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum ShowMessageBoxResult
Public Enumeration ShowMessageBoxResult
Members
Member name | Value | Description
None | 0
OK | 1
Cancel | 2
Abort | 3
Retry | 4
Ignore | 5
Yes | 6
No | 7
See Also
Reference
Rhino.UI Namespace