RhinoCommon SDK
LeaderContentAngleStyle Enumeration
 Angle of the text or other content in a leader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum LeaderContentAngleStyle
Public Enumeration LeaderContentAngleStyle
Members
Member name | Value | Description
Aligned | 0 |  Aligned with last leader direction
Horizontal | 1 |  Horizontal, Front-facing
Rotated | 2 |  Explicit angle
See Also
Reference
Rhino.Geometry Namespace