RhinoCommon API
SubDComponent Class
 A part of SubD geometry. Common base class for vertices, faces, and edges
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDComponent
 Rhino.Geometry.SubDEdge
 Rhino.Geometry.SubDFace
 Rhino.Geometry.SubDVertex
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class SubDComponent
Public MustInherit Class SubDComponent
The SubDComponent type exposes the following members.
Properties
Name | Description
Id
 Unique id within the parent SubD for this item
ParentSubD
 SubD that this component belonds to
Top
Methods
Name | Description
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Geometry Namespace