RhinoCommon API
RenderCustomEventArgs Class
 Used as Rhino.Render Custom Events args.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RenderCustomEventArgs
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderCustomEventArgs : EventArgs
Public Class RenderCustomEventArgs
	Inherits EventArgs
The RenderCustomEventArgs type exposes the following members.
Properties
Name | Description
Argument
 The pointer to the custom event args.
EventType
 The type of the event.
Top
Methods
Name | Description
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render Namespace