RhinoCommon API
Utilities.ContentChooserFlags Enumeration
[Missing <summary> documentation for "T:Rhino.Render.Utilities.ContentChooserFlags"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.9
Syntax
public enum ContentChooserFlags
Public Enumeration ContentChooserFlags
Members
Member name | Value | Description
None | 0 |  No flags; normal usage.
HideNewTab | 1 |  Hides the 'New' tab.
HideExistingTab | 2 |  Hides the 'Existing' tab.
MultipleSelection | 4 |  Enables multiple selection.
See Also
Reference
Rhino.Render Namespace