RhinoCommon API
RhinoPageView Class
 A window that contains a single layout 'page'
Inheritance Hierarchy
System.Object
 Rhino.Display.RhinoView
 Rhino.Display.RhinoPageView
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RhinoPageView : RhinoView
Public Class RhinoPageView
	Inherits RhinoView
The RhinoPageView type exposes the following members.
Properties
Name | Description
ActiveViewport
 The ActiveViewport is the same as the MainViewport for standard RhinoViews. In a RhinoPageView, the active viewport may be the RhinoViewport of a child detail object. Most of the time, you will use ActiveViewport unless you explicitly need to work with the main viewport.
 (Overrides RhinoView.ActiveViewport.)
ActiveViewportID
 Returns viewport ID for the active viewport. Faster than ActiveViewport function when working with page views.
 (Overrides RhinoView.ActiveViewportID.)
In Rhino for Windows 7.0, this member is inherited from .RhinoViewActiveViewportID.
PageHeight
 Height of the page in the document's PageUnitSystem
PageIsActive
 true if the page is active instead of any detail views. This occurs when the MainViewport.Id == ActiveViewportID.
PageName
Same as the MainViewport.Name.
PageNumber
 Gets or sets the runtime page number and updates the page number for all of the other pages. The first page has a value of 0.
PageWidth
 Width of the page in the document's PageUnitSystem
PaperName
 Returns the name of the layout's media, or paper (e.g. Letter, Legal, A1, etc.), used to determine the page width and page height.
PrinterName
 Returns the name of the layout's destination printer.
Top
Methods
Name | Description
AddDetailView
 Creates a detail view object that is displayed on this page and adds it to the doc.
Duplicate
 Copy a page view
GetDetailViews
 Gets a list of the detail view objects associated with this layout.
GetPreviewImage
 Creates a preview image of the page.
SetActiveDetail(Guid)
SetActiveDetail(String, Boolean)
SetPageAsActive
Top
Events
Name | Description
PageViewSpaceChange
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Display Namespace