RhinoCommon API
ClipboardState Enumeration
 Defines enumerated constant values for diferent behaviour that is related to clipboard data.
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ClipboardState
Public Enumeration ClipboardState
Members
Member name | Value | Description
KeepData | 0 | Always keep clipboard data, regardless of size and never prompt the user.
DeleteData | 1 | Always delete clipboard data, regardless of size and never prompt the user.
PromptWhenBig | 2 | Prompt user when clipboard memory is large.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.ApplicationSettings Namespace