RhinoCommon API
CommandAliasList Class
 Contains static methods and properties to access command aliases.
Inheritance Hierarchy
System.Object
 Rhino.ApplicationSettings.CommandAliasList
 Namespace: Rhino.ApplicationSettings
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public static class CommandAliasList
Public NotInheritable Class CommandAliasList
The CommandAliasList type exposes the following members.
Properties
Name | Description
Count
Returns the number of command alias in Rhino.
Top
Methods
Name | Description
Add
Adds a new command alias to Rhino.
Clear
Removes all aliases from the list.
Delete
Deletes an existing command alias from Rhino.
GetDefaults
 Constructs a dictionary containing as keys the default names and as value the default macro.
The returned dicionary contains a copy of the settings.
GetMacro
Returns the macro of a command alias.
GetNames
Returns a list of command alias names.
IsAlias
Verifies that a command alias exists in Rhino.
IsDefault
 Computes a value indicating if the current alias list is the same as the default alias list.
SetMacro
Modifies the macro of a command alias.
ToDictionary
 Constructs a new dictionary that contains: as keys all names and as values all macros.
Modifications to this dictionary do not affect any Rhino command alias.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.ApplicationSettings Namespace