RhinoCommon API
SafeFrame Class
 SafeFrame
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.SafeFrame
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SafeFrame : DocumentOrFreeFloatingBase
Public Class SafeFrame
	Inherits DocumentOrFreeFloatingBase
The SafeFrame type exposes the following members.
Constructors
Name | Description
SafeFrame()
 Create an utility object not associated with any document
SafeFrame(RhinoDoc)
 Create the SafeFrame object which is associated with the document
SafeFrame(SafeFrame)
 Create an utility object not associated with any document from another object
Top
Properties
Name | Description
ActionFrameLinked
 Action Frame Linked, On = Use the same scale for X and Y. Off = use different scales for X and Y.
ActionFrameOn
 Turn on the user specified action area, which shown with blue frames.
ActionFrameXScale
 Action Frame Scale X
ActionFrameYScale
 Action Frame Scale Y
Enabled
 Determines whether the safeframe is enabled.
FieldsOn
 Show a 4 by 3 grid in the safe-frame.
LiveFrameOn
 Turn on the live area, which shows the size of the rendered view as a yellow frame in the viewport.
PerspectiveOnly
 Show the safe-frame only in perspective views.
TitleFrameLinked
 Title Frame Linked, On = Use the same scale for X and Y. Off = use different scales for X and Y.
TitleFrameOn
 Show a user specified title area frame in orange.
TitleFrameXScale
 Title Frame Scale X
TitleFrameYScale
 Title Frame Scale Y
Top
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Top
Events
Name | Description
Changed
 This event is raised when a SafeFrame property value is changed.
Top
See Also
Reference
Rhino.Render Namespace