RhinoCommon API
RenderMaterial.PhysicallyBased.ParametersNames Class
[Missing <summary> documentation for "T:Rhino.Render.RenderMaterial.PhysicallyBased.ParametersNames"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderMaterial.PhysicallyBased.ParametersNames
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ParametersNames
Public Class ParametersNames
The RenderMaterial.PhysicallyBased.ParametersNames type exposes the following members.
Constructors
Name | Description
RenderMaterial.PhysicallyBased.ParametersNames
Initializes a new instance of the RenderMaterial.PhysicallyBased.ParametersNames class
Top
Properties
Name | Description
AmbientOcclusion
Anisotropic
AnisotropicRotation
BaseColor
BRDF
Bump
Clearcoat
ClearcoatBump
ClearcoatRoughness
Displacement
Emission
Metallic
Opacity
OpacityIor
OpacityRoughness
Roughness
Sheen
SheenTint
Specular
SpecularTint
Subsurface
SubsurfaceScatteringColor
SubsurfaceScatteringRadius
Top
Methods
Name | Description
Top
See Also
Reference
Rhino.Render Namespace