RhinoCommon API
EarlyPostEffectPlugInArray Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.EarlyPostEffectPlugInArray"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.EarlyPostEffectPlugInArray
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class EarlyPostEffectPlugInArray : IDisposable
Public NotInheritable Class EarlyPostEffectPlugInArray
	Implements IDisposable
The EarlyPostEffectPlugInArray type exposes the following members.
Constructors
Name | Description
EarlyPostEffectPlugInArray()
Initializes a new instance of the EarlyPostEffectPlugInArray class
EarlyPostEffectPlugInArray(IntPtr)
Initializes a new instance of the EarlyPostEffectPlugInArray class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Append
At
Count
Dispose
Releases all resources used by the EarlyPostEffectPlugInArray
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render.PostEffects Namespace