RhinoCommon API
CustomUndoEventArgs Class
 Argument package that is passed to a custom undo delegate
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Commands.CustomUndoEventArgs
 Namespace: Rhino.Commands
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class CustomUndoEventArgs : EventArgs
Public Class CustomUndoEventArgs
	Inherits EventArgs
The CustomUndoEventArgs type exposes the following members.
Properties
Name | Description
ActionDescription
CommandId
CreatedByRedo
Document
Tag
UndoSerialNumber
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Commands Namespace