RhinoCommon API
DetailViewObject.ScaleFormat Enumeration
 Detail view object scale formats.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ScaleFormat
Public Enumeration ScaleFormat
Members
Member name | Value | Description
None | 0 |  No formatting
PageLengthToOne | 1 |  #:1
OneToModelLength | 2 |  1:#
OneInchToModelLengthFeet | 3 |  1" = #'
ModelLengthInchToOneFoot | 4 |  #" = 1'
ModelLengthInchToOneFootInch | 5 |  #' = 1'-0"
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.DocObjects Namespace