RhinoCommon API
TextHorizontalAlignment Enumeration
 Horizontal location of text attach point relative to text
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum TextHorizontalAlignment
Public Enumeration TextHorizontalAlignment
Members
Member name | Value | Description
Left | 0 |  Attach at left of text lines (Independent of glyphs being displayed.)
Center | 1 |  Attach point at center of text horizontal advance (not glyph bounding box)
Right | 2 |  Attach point at right text horizontal advance (not glyph bounding box)
Auto | 3 |  Used for Leaders only Attach point adjusts to Right or Left depending on leader tail direction in view If tail direction is to the Left, alignment is Right If tail direction is to the Right, alignment is Left
See Also
Reference
Rhino.DocObjects Namespace