RhinoCommon API
ComponentOrder Enumeration
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.ComponentOrder"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ComponentOrder
Public Enumeration ComponentOrder
Members
Member name | Value | Description
Irrelevant | 0
RGBA | 1
ARGB | 2
RGB | 3
BGR | 4
ABGR | 5
BGRA | 6
XYZ | 7
ZYX | 8
See Also
Reference
Rhino.Render.PostEffects Namespace