RhinoCommon SDK
AnnotationArrowhead Class
 Arrowhead used by annotation
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationArrowhead
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
[SerializableAttribute]
public class AnnotationArrowhead : GeometryBase
<SerializableAttribute>
Public Class AnnotationArrowhead
	Inherits GeometryBase
The AnnotationArrowhead type exposes the following members.
Constructors
Name | Description
AnnotationArrowhead
 Constructotr
Top
Methods
Name | Description
Top
Properties
Name | Description
ArrowheadName
 Name of block used for user-defined arrowhead
ArrowheadType
 Type of arrowhead used by annotation
Top
See Also
Reference
Rhino.Geometry Namespace