RhinoCommon API
GetContextCallback Class
[Missing <summary> documentation for "T:Rhino.Input.Custom.GetContextCallback"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetContextCallback
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class GetContextCallback
Public MustInherit Class GetContextCallback
The GetContextCallback type exposes the following members.
Constructors
Name | Description
GetContextCallback
Initializes a new instance of the GetContextCallback class
Top
Methods
Name | Description
BeforeGetPoint
 Called before a GetPoint() operation. Setting the point or result on the input arguments will cause the default GetPoint operation to be skipped and results will immediately be returned to the caller of the initial GetPoint.
DisableForAllContexts
DisableForContext
EnableForContext
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Input.Custom Namespace