RhinoCommon API
EarlyPostEffectPlugIn Class
 class EarlyPostEffectPlugIn 3rd-party early PEPs should subclass this class.
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.PostEffectPlugIn
 Rhino.Render.PostEffects.ListablePostEffectPlugIn
 Rhino.Render.PostEffects.EarlyPostEffectPlugIn
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class EarlyPostEffectPlugIn : ListablePostEffectPlugIn,
	IDisposable
Public MustInherit Class EarlyPostEffectPlugIn
	Inherits ListablePostEffectPlugIn
	Implements IDisposable
The EarlyPostEffectPlugIn type exposes the following members.
Constructors
Name | Description
EarlyPostEffectPlugIn
Initializes a new instance of the EarlyPostEffectPlugIn class
Top
Properties
Name | Description
SerialNumber
Top
Methods
Name | Description
Dispose
Releases all resources used by the EarlyPostEffectPlugIn
Top
Fields
Name | Description
Top
See Also
Reference
Rhino.Render.PostEffects Namespace