RhinoCommon API
Utilities.UiFrameworks Enumeration
[Missing <summary> documentation for "T:Rhino.Render.Utilities.UiFrameworks"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum UiFrameworks
Public Enumeration UiFrameworks
Members
Member name | Value | Description
Win32 | 0 | Win32.
Cocoa | 1 | Cocoa.
Eto | 2 | Eto.
WinForms | 3 | WinForms.
WPF | 4 | WPF.
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render Namespace