RhinoCommon API
ChannelData Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.ChannelData"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.ChannelData
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ChannelData : IDisposable
Public Class ChannelData
	Implements IDisposable
The ChannelData type exposes the following members.
Constructors
Name | Description
ChannelData()
Initializes a new instance of the ChannelData class
ChannelData(IntPtr)
Initializes a new instance of the ChannelData class
ChannelData(ChannelData)
Initializes a new instance of the ChannelData class
ChannelData(Guid, ComponentOrder)
Initializes a new instance of the ChannelData class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
CO
Dispose
Releases all resources used by the ChannelData
Finalize |  (Overrides Object.Finalize().)
Id
Top
See Also
Reference
Rhino.Render.PostEffects Namespace