RhinoCommon SDK
NamedValue Class
[Missing <summary> documentation for "T:Rhino.Render.NamedValue"]
Inheritance Hierarchy
System.Object
 Rhino.Render.NamedValue
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public sealed class NamedValue
Public NotInheritable Class NamedValue
The NamedValue type exposes the following members.
Constructors
Name | Description
NamedValue
Initializes a new instance of the NamedValue class
Top
Methods
Name | Description
Top
Properties
Name | Description
Name
Value
Top
See Also
Reference
Rhino.Render Namespace