RhinoCommon SDK
BrepVertexList Class
 Provides access to all the Vertices in a Brep object
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.BrepVertexList
Namespace: Rhino.Geometry.Collections
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class BrepVertexList : IEnumerable<BrepVertex>,
	IEnumerable, IRhinoTable<BrepVertex>
Public Class BrepVertexList
	Implements IEnumerable(Of BrepVertex), IEnumerable,
	IRhinoTable(Of BrepVertex)
The BrepVertexList type exposes the following members.
Methods
Name | Description
Add()
 Create and add a new vertex to this list
Add(Point3d, Double)
 Create and add a new vertex to this list
AddPointOnFace
Adds a new point on face to the brep
GetEnumerator
 Gets an enumerator that visits all surfaces.
Top
Properties
Name | Description
Count
 Gets the number of brep vertices.
Item
 Gets the BrepVertex at the given index. The index must be valid or an IndexOutOfRangeException will be thrown.
Top
See Also
Reference
Rhino.Geometry.Collections Namespace