RhinoCommon API
RenderEnvironment.Usage Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderEnvironment.Usage"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[FlagsAttribute]
public enum Usage
<FlagsAttribute>
Public Enumeration Usage
Members
Member name | Value | Description
None | 0
Background | 1
ReflectionAndRefraction | 2
Skylighting | 4
AnyUsage | 7
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render Namespace