RhinoCommon API
LayerTable Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.LayerTable"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.LayerTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class LayerTable : IEnumerable<Layer>,
	IEnumerable
Public NotInheritable Class LayerTable
	Implements IEnumerable(Of Layer), IEnumerable
The LayerTable type exposes the following members.
Properties
Name | Description
ActiveCount
 Returns number of layers in the layer table, excluding deleted layers.
ComponentType |  (Overrides CommonComponentTable<T>.ComponentType.)
Count
 Returns number of layers in the layer table, including deleted layers.
CurrentLayer
 At all times, there is a "current" layer. Unless otherwise specified, new objects are assigned to the current layer. The current layer is never locked, hidden, or deleted. Returns reference to the current layer. Note that this reference may become invalid after a call to AddLayer().
CurrentLayerIndex
 At all times, there is a "current" layer. Unless otherwise specified, new objects are assigned to the current layer. The current layer is never locked, hidden, or deleted. Returns: Zero based layer table index of the current layer.
Document
Document that owns this table.
Item
 Conceptually, the layer table is an array of layers. The operator[] can be used to get individual layers. A layer is either active or deleted and this state is reported by Layer.IsDeleted.
Top
Methods
Name | Description
Add()
 Adds a new layer with default definition to the layer table.
Add(Layer)
 Adds a new layer with specified definition to the layer table.
Add(String, Color)
 Adds a new layer with specified definition to the layer table.
AddReferenceLayer()
 Adds a new reference layer with default definition to the layer table. Reference layers are not saved in files.
AddReferenceLayer(Layer)
 Adds a new reference layer with specified definition to the layer table Reference layers are not saved in files.
Delete(Layer)
Deletes layer.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32, Boolean)
Deletes layer.
Delete(Guid, Boolean)
Deletes layer.
Delete(Layer, Boolean)
Deletes layer.
Duplicate(IEnumerable<Int32>, Boolean, Boolean)
 Duplicates, or copies, one or more layers. Duplicated layers are added to the document.
Duplicate(Int32, Boolean, Boolean)
 Duplicates, or copies, a layer. Duplicated layers are added to the document.
Find(Guid, Boolean)
Finds a layer with a matching ID.
Find(String, Boolean)
 Finds the layer with a given name. If multiple layers exist that have the same name, the first match layer index will be returned.
Deleted layers have no name.
FindByFullPath(String, Boolean)
FindByFullPath(String, Int32)
 Searches for a layer using the fully qualified name, that includes ancestors.
Deleted layers have no name.
FindIndex
 Retrieves a Layer object based on Index. This search type of search is discouraged. We are moving towards using only IDs for all tables.
FindName(String)
 Finds the layer with a given name. If multiple layers exist that have the same name, the first match layer index will be returned.
Deleted layers have no name.
The default layer is NOT included in the search. If required, use the overload with startIndex input.
FindName(String, Int32)
 Finds the next layer that has an index equal or higher than the searched value.
Search in case-insensitive.
FindNameHash
 Finds a Layer given its name hash.
FindNext
ForceLayerVisible(Guid)
 Makes a layer and all of its parent layers visible.
ForceLayerVisible(Int32)
 Makes a layer and all of its parent layers visible.
GetEnumerator
GetSelected
 Returns the indices of layers that are selected on the Layer user interface.
GetUnusedLayerName()
 Gets the next unused layer name used as default when creating new layers.
GetUnusedLayerName(Boolean)
 Gets the next unused layer name used as default when creating new layers.
Modify(Layer, Int32, Boolean)
Modifies layer settings.
Modify(Layer, Guid, Boolean)
Modifies layer settings.
Purge(Int32, Boolean)
 Deletes a layer and all geometry objects on a layer
Purge(Guid, Boolean)
 Deletes a layer and all geometry objects on a layer.
Select
 Selects layers in the Layer user interface.
SetCurrentLayerIndex
 At all times, there is a "current" layer. Unless otherwise specified, new objects are assigned to the current layer. The current layer is never locked, hidden, or deleted.
Undelete
 Undeletes a layer that has been deleted by DeleteLayer().
UndoModify(Int32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
UndoModify(Guid)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
UndoModify(Int32, UInt32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
UndoModify(Guid, UInt32)
 Restores the layer to its previous state, if the layer has been modified and the modification can be undone.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.DocObjects.Tables Namespace