RhinoCommon API
SubDCreationOptions Class
 Options used for creating a SubD
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDCreationOptions
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SubDCreationOptions : IDisposable
Public Class SubDCreationOptions
	Implements IDisposable
The SubDCreationOptions type exposes the following members.
Constructors
Name | Description
SubDCreationOptions
 Create default options
Top
Properties
Name | Description
ConvexCornerAtMeshCorner
 Look for convex corners at sub-D vertices with 2 edges that have an included angle <= 90 degrees.
ConvexCornerTest
 how convex corners are treated
InteriorCreaseAtMeshCrease
 Create an interior sub-D crease along coincident input mesh edges where the vertex normal directions at one end differ by at least 30 degrees.
InteriorCreaseAtMeshEdge
 Create an interior sub-D crease along all coincident input mesh edges.
InteriorCreaseTest
 how interior creases are treated
InterpolateMeshVertices
 If false, input mesh vertex locations will be used to set subd vertex control net locations. If true, input mesh vertex locations will be used to set subd vertex limit surface locations.
MaximumConvexCornerAngleRadians
 If ConvexCornerTest is at_mesh_corner, then an input mesh boundary vertex becomes a sub-D corner when the number of edges that end at the vertex is <= MaximumConvexCornerEdgeCount edges and the corner angle is <= MaximumConvexCornerAngleRadians.
MaximumConvexCornerEdgeCount
 If ConvexCornerTest is at_mesh_corner, then an input mesh boundary vertex becomes a sub-D corner when the number of edges that end at the vertex is <= MaximumConvexCornerEdgeCount edges and the corner angle is <= MaximumConvexCornerAngleRadians.
MinimumCreaseAngleRadians
 When the interior crease option is AtMeshCreases the value of MinimumCreaseAngleRadians determines which coincident input mesh edges generate sub-D creases. If the input mesh has vertex normals, and the angle between vertex normals is > MinimumCreaseAngleRadians at an end of a coincident input mesh edge, the corresponding sub-D edge will be a crease.
Smooth
 No interior creases and no corners.
Top
Methods
Name | Description
Dispose
 Delete unmanaged pointer for this
Finalize
 Finalizer
 (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Geometry Namespace