RhinoCommon API
ProxyTypes Enumeration
 Defines the proxy type of the render content
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 6.0
Syntax
public enum ProxyTypes
Public Enumeration ProxyTypes
Members
Member name | Value | Description
None | 0
Single | 1
Multi | 2
Texture | 3
See Also
Reference
Rhino.Render Namespace