RhinoCommon API
ObjectClipParticipationSource Enumeration
 The source of clipping plane effects on an object.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ObjectClipParticipationSource
Public Enumeration ObjectClipParticipationSource
Members
Member name | Value | Description
FromLayer | 0 | Clip participation is defined by object's layer
FromObject | 1 | Clip participation is specific to the object
FromParent | 3 | Clip participation is defined by object's parent
See Also
Reference
Rhino.DocObjects Namespace