RhinoCommon SDK
RenderWindowClonedEventArgs Class
[Missing <summary> documentation for "T:Rhino.Render.RenderWindowClonedEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RenderWindowClonedEventArgs
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class RenderWindowClonedEventArgs : EventArgs
Public Class RenderWindowClonedEventArgs
	Inherits EventArgs
The RenderWindowClonedEventArgs type exposes the following members.
Methods
Name | Description
Top
Properties
Name | Description
NewRenderWindow
NewSessionId
OldRenderWindow
OldSessionId
Top
See Also
Reference
Rhino.Render Namespace