RhinoCommon SDK
TextStyle Class
 Description of the visual characteristics of text LOGFONT plus height linefeedratio color + colorsource width_scale tracking
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.DocObjects.TextStyle
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class TextStyle : CommonObject
Public Class TextStyle
	Inherits CommonObject
The TextStyle type exposes the following members.
Constructors
Name | Description
TextStyle
 Creates a new non-document control ON_Font
Top
Methods
Name | Description
ReleaseGlyphs
Top
Properties
Name | Description
Bold
 From the font used by this style
FaceName
 Font face name of the font used by this style
Id
 TextStyle Id
Italic
 From the font used by this style
LinefeedRatio
 Ratio of Height / distance from one line to the next lower line (default 1.6)
Strikeout
 From the font used by this style
Underline
 From the font used by this style
Top
See Also
Reference
Rhino.DocObjects Namespace