RhinoCommon SDK
TextureMode Enumeration
[Missing <summary> documentation for "T:Rhino.Render.TextureMode"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum TextureMode
Public Enumeration TextureMode
Members
Member name | Value | Description
PROJECTION_MODE | 0
MAPPING_CHANNEL_MODE | 1
WRAP_TYPE_MODE | 2
REPEAT_LOCKED_MODE | 3
OFFSET_LOCKED_MODE | 4
PREVIEW_IN_3D_MODE | 5
REPEAT_MODE | 6
OFFSET_MODE | 7
ROTATION_MODE | 8
ENVIRONMENT_MAPPING_MODE | 9
INTERNAL_ENVIRONMENT_MAPPING_MODE | 10
PREVIEW_LOCAL_MAPPING_MODE | 11
DISPLAY_IN_VIEWPORT_MODE | 12
IS_HDR_CAPABLE_MODE | 13
See Also
Reference
Rhino.Render Namespace