RhinoCommon API
SubDEdgeList Class
 All edges in a SubD
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.SubDEdgeList
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SubDEdgeList : IEnumerable<SubDEdge>,
	IEnumerable
Public Class SubDEdgeList
	Implements IEnumerable(Of SubDEdge), IEnumerable
The SubDEdgeList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of SubD edges.
Top
Methods
Name | Description
Add
 Add a new edge to the list.
Find(Int32)
 Find an edge in this SubD with a given id
Find(UInt32)
 Find an edge in this SubD with a given id
GetEnumerator
 Implementation of IEnumerable
Top
See Also
Reference
Rhino.Geometry.Collections Namespace