RhinoCommon API
PostEffectFactory Class
 To register a pep plugin create factory from PostEffectFactory. The factory should be public and have a public constructor in order for it to be able to register itself. Use Rhino.UI.Controls.FactoryBase.Register() to register it. This will register all rdk factories that are expoerted and have a public constructor.
Inheritance Hierarchy
System.Object
 Rhino.UI.Controls.FactoryBase
 Rhino.Render.PostEffects.PostEffectFactory
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class PostEffectFactory : FactoryBase
Public MustInherit Class PostEffectFactory
	Inherits FactoryBase
The PostEffectFactory type exposes the following members.
Constructors
Name | Description
PostEffectFactory
 This class allows you to provide a factory for generating a custom post-effect plug-in (PEP).
Top
Methods
Name | Description
NewPostEffect
 Create the new PEP instance.
PlugInId
 Plugin id
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render.PostEffects Namespace