RhinoCommon SDK
ObjectPropertiesPage.ProertyPageType Enumeration
 Standard page types, override PageType and return one of these types to replace a standard properties page with your page.
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum ProertyPageType
Public Enumeration ProertyPageType
Members
Member name | Value | Description
Material | 0
Light | 1
Custom | 2
Dimension | 4
Leader | 5
Text | 6
Hatch | 7
Dot | 8
TextureMapping | 9
Detail | 10
ClippingPlane | 11
NamedView | 12
Decal | 13
See Also
Reference
Rhino.UI Namespace