RhinoCommon SDK
Skylight Class
[Missing <summary> documentation for "T:Rhino.Render.Skylight"]
Inheritance Hierarchy
System.Object
 Rhino.Render.Skylight
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class Skylight
Public Class Skylight
The Skylight type exposes the following members.
Methods
Name | Description
Top
Properties
Name | Description
CustomEnvironment
CustomEnvironmentOn
Enabled
ShadowIntensity
Top
See Also
Reference
Rhino.Render Namespace