RhinoCommon SDK
SubDLimitMesh Class
[Missing <summary> documentation for "T:Rhino.Geometry.SubDLimitMesh"]
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDLimitMesh
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class SubDLimitMesh
Public Class SubDLimitMesh
The SubDLimitMesh type exposes the following members.
Methods
Name | Description
Create
Top
See Also
Reference
Rhino.Geometry Namespace