RhinoCommon API
MouseCallback Class
Used for intercepting mouse events in the Rhino views.
Inheritance Hierarchy
System.Object
 Rhino.UI.MouseCallback
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public abstract class MouseCallback
Public MustInherit Class MouseCallback
The MouseCallback type exposes the following members.
Constructors
Name | Description
MouseCallback
Initializes a new instance of the MouseCallback class
Top
Properties
Name | Description
Enabled
Top
Methods
Name | Description
OnEndMouseDown
 Called at the end of handling of a mouse down event in Rhino. All of the default Rhino mouse down functionality has already been executed unless a MouseCallback has set Cancel to true for the event args. You can tell if this is the case by inpecting the Cancel property in the event args parameter. Base class implementation of this function does nothing
OnEndMouseMove
 Called at the end of handling of a mouse move event in Rhino. All of the default Rhino mouse move functionality has already been executed unless a MouseCallback has set Cancel to true for the event args. You can tell if this is the case by inpecting the Cancel property in the event args parameter. Base class implementation of this function does nothing.
OnEndMouseUp
 Called at the end of handling of a mouse up event in Rhino. All of the default Rhino mouse down functionality has already been executed unless a MouseCallback has set Cancel to true for the event args. You can tell if this is the case by inpecting the Cancel property in the event args parameter. Base class implementation of this function does nothing
OnMouseDoubleClick
OnMouseDown
 Called at the beginning of handling of a mouse down event in Rhino. If you don't want the default Rhino functionality to be run, then set Cancel to true on the passed in event args Base class implementation of this function does nothing
OnMouseEnter(MouseCallbackEventArgs)
OnMouseEnter(RhinoView)
OnMouseHover(MouseCallbackEventArgs)
OnMouseHover(RhinoView)
OnMouseLeave(MouseCallbackEventArgs)
OnMouseLeave(RhinoView)
OnMouseMove
 Called at the beginning of handling of a mouse move event in Rhino. If you don't want the default Rhino functionality to be run, then set Cancel to true on the passed in event args. Base class implementation of this function does nothing.
OnMouseUp
 Called at the beginning of handling of a mouse up event in Rhino. If you don't want the default Rhino functionality to be run, then set Cancel to true on the passed in event args Base class implementation of this function does nothing
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.UI Namespace