RhinoCommon API
PostEffects Class
 This is the interface to PostEffects.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.PostEffects.PostEffects
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class PostEffects : DocumentOrFreeFloatingBase
Public NotInheritable Class PostEffects
	Inherits DocumentOrFreeFloatingBase
The PostEffects type exposes the following members.
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
GetEarlyPostEffects
GetLatePostEffects
GetToneMappingPostEffects
PostEffectFromId
Top
See Also
Reference
Rhino.Render.PostEffects Namespace