RhinoCommon API
ToolbarFile Class
[Missing <summary> documentation for "T:Rhino.UI.ToolbarFile"]
Inheritance Hierarchy
System.Object
 Rhino.UI.ToolbarFile
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class ToolbarFile
Public NotInheritable Class ToolbarFile
The ToolbarFile type exposes the following members.
Properties
Name | Description
GroupCount
Id
Name
Path
Full path to this file on disk
ToolbarCount
Top
Methods
Name | Description
Close
GetGroup(Int32)
GetGroup(String)
GetToolbar
Save
SaveAs
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.UI Namespace