RhinoCommon API
SubDVertexList Class
 Provides access to the vertices and vertex-related functionality of a SubD
Inheritance Hierarchy
System.Object
 Rhino.Geometry.Collections.SubDVertexList
 Namespace: Rhino.Geometry.Collections
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class SubDVertexList
Public Class SubDVertexList
The SubDVertexList type exposes the following members.
Properties
Name | Description
Count
 Gets the number of SubD vertices.
First
 First vertex in this linked list of vertices
Top
Methods
Name | Description
Add
 Add a new vertex to the end of the Vertex list.
Find(Int32)
 Find a vertex in this SubD with a given id
Find(UInt32)
 Find a vertex in this SubD with a given id
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Geometry.Collections Namespace