RhinoCommon API
Vector2f Structure
 Represents the two components of a vector in two-dimensional space, using Single-precision floating point numbers.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public struct Vector2f : IEquatable<Vector2f>,
	IComparable<Vector2f>, IComparable, IEpsilonFComparable<Vector2f>,
	IFormattable
<SerializableAttribute>
Public Structure Vector2f
	Implements IEquatable(Of Vector2f), IComparable(Of Vector2f),
	IComparable, IEpsilonFComparable(Of Vector2f), IFormattable
The Vector2f type exposes the following members.
Constructors
Name | Description
Vector2f
 Creates an instance.
Top
Properties
Name | Description
IsValid
 Returns an indication regarding the validity of this vector.
SquareLength
 Returns the square of the length of this vector. This method does not check for the validity of its inputs.
X
 Gets or sets the X (first) component of this vector.
Y
 Gets or sets the Y (second) component of this vector.
Top
Methods
Name | Description
CompareTo
 Compares this Vector2f with another Vector2f.
Components evaluation priority is first X, then Y.
EpsilonEquals
 Check that all values in other are withing epsilon of the values in this
Equals(Object)
 Determines whether the specified System.Object is a Vector2f and has the same values as the present vector.
 (Overrides ValueType.Equals(Object).)
Equals(Vector2f)
 Determines whether the specified vector has the same values as the present vector.
GetHashCode
 Computes a hash number that represents the current vector.
 (Overrides ValueType.GetHashCode().)
Multiply
 Multiplies two Vector2f together, returning the dot (internal) product of the two.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
ToString()
 Constructs the string representation of the current vector.
 (Overrides ValueType.ToString().)
ToString(String, IFormatProvider)
Formats the value of the current instance using the specified format.
Top
Operators
Name | Description
Addition
 Computes the sum between two vectors.
Equality
 Determines whether two vectors have equal values.
GreaterThan
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
GreaterThanOrEqual
 Determines whether the first specified vector comes after (has superior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
Inequality
 Determines whether two vectors have different values.
LessThan
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
LessThanOrEqual
 Determines whether the first specified vector comes before (has inferior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
Multiply
 Multiplies two Vector2f together, returning the dot (internal) product of the two.
Subtraction
 Computes the difference between two vectors.
Top
See Also
Reference
Rhino.Geometry Namespace