RhinoCommon API
OrdinateDimension Class
 Represents an ordinate dimension
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.AnnotationBase
 Rhino.Geometry.OrdinateDimension
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class OrdinateDimension : AnnotationBase
<SerializableAttribute>
Public Class OrdinateDimension
	Inherits AnnotationBase
The OrdinateDimension type exposes the following members.
Constructors
Name | Description
OrdinateDimension()
Initializes a new instance of the OrdinateDimension class
OrdinateDimension(SerializationInfo, StreamingContext)
 Protected constructor used in serialization.
Top
Properties
Name | Description
DefPoint
KinkOffset1
KinkOffset2
KinkPoint1
KinkPoint2
LeaderPoint
In Rhino for Windows 7.0, this member is inherited from .DimensionNumericValue.
In Rhino for Windows 7.0, this member is inherited from .DimensionTextFormula.
Top
Methods
Name | Description
AdjustFromPoints
 Update Dimension geometry from point locations
Create
 Initialize Dimension parameters
In Rhino for Windows, this member is overridden by Dispose(Boolean).
Get3dPoints
 Get locations of dimension's 3d points
In Rhino for Windows, this member is overridden by GetBoundingBox(Transform).
GetDisplayLines
GetDistanceDisplayText
GetTextRectangle
In Rhino for Windows, this member is overridden by NonConstOperation().
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Geometry Namespace