RhinoCommon API
SimulatedTexture.EnvironmentMappingModes Enumeration
[Missing <summary> documentation for "T:Rhino.Render.SimulatedTexture.EnvironmentMappingModes"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum EnvironmentMappingModes
Public Enumeration EnvironmentMappingModes
Members
Member name | Value | Description
Automatic | 0
Spherical | 1
Emap | 2
Box | 3
Lightprobe | 5
Cubemap | 6
VerticalCrossCubemap | 7
HorizontalCrossCubemap | 8
Hemispherical | 9
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render Namespace