RhinoCommon API
BasepointZero Enumeration
 Specifies enumerated constants used to indicate the zero level convention relating to a location on Earth.
This is used in conjunction with the EarthAnchorPoint class.
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum BasepointZero
Public Enumeration BasepointZero
Members
Member name | Value | Description
GroundLevel | 0 |  The ground level is the convention for 0.
MeanSeaLevel | 1 |  The mean sea level is the convention for 0.
CenterOfEarth | 2 |  The center of the planet is the convention for 0.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.DocObjects Namespace