RhinoCommon API
IHeaderButtonHandler Interface
[Missing <summary> documentation for "T:Rhino.UI.Controls.IHeaderButtonHandler"]
 Namespace: Rhino.UI.Controls
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IHeaderButtonHandler
Public Interface IHeaderButtonHandler
The IHeaderButtonHandler type exposes the following members.
Methods
Name | Description
ButtonDetails
ButtonRect
DeleteThis
OnButtonClicked
Top
See Also
Reference
Rhino.UI.Controls Namespace