RhinoCommon API
IStackedDialogPageService Interface
 For internal use, the IStackedDialogPageService service is implemented in RhinoWindows or RhinoMac as appropriate and handles the communication with core Rhino
 Namespace: Rhino.UI
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public interface IStackedDialogPageService
Public Interface IStackedDialogPageService
The IStackedDialogPageService type exposes the following members.
Methods
Name | Description
GetImageHandle(Icon, Boolean)
 Convert image to platform specific unmanaged pointer
GetImageHandle(Image, Boolean)
 Convert image to platform specific unmanaged pointer
GetNativePageWindow(Object, Object)
 Get the unmanaged pointer associated with the pages content control
GetNativePageWindow(Object, Object, Object)
 Get the unmanaged pointer associated with the pages content control
NewObjectPropertiesDialogPagePointer
RedrawPageControl
 Redraw the specified control.
SelectedObjects
TryGetControlMinimumSize
 Get the minimum size associated with a control object
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.UI Namespace