RhinoCommon API
LayerTableEventType Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.LayerTableEventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum LayerTableEventType
Public Enumeration LayerTableEventType
Members
Member name | Value | Description
Added | 0
Deleted | 1
Undeleted | 2
Modified | 3
Sorted | 4 | LayerTable.Sort() potentially changed sort order.
Current | 5 | Current layer change.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.DocObjects.Tables Namespace