RhinoCommon SDK
DecalProjection Enumeration
[Missing <summary> documentation for "T:Rhino.Render.DecalProjection"]
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum DecalProjection
Public Enumeration DecalProjection
Members
Member name | Value | Description
Forward | 0 | Project forward
Backward | 1 | Project backward
Both | 2 | Project forward and backward
See Also
Reference
Rhino.Render Namespace