RhinoCommon API
ToneMappingPostEffectPlugInArray Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.ToneMappingPostEffectPlugInArray"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.ToneMappingPostEffectPlugInArray
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class ToneMappingPostEffectPlugInArray : IDisposable
Public NotInheritable Class ToneMappingPostEffectPlugInArray
	Implements IDisposable
The ToneMappingPostEffectPlugInArray type exposes the following members.
Constructors
Name | Description
ToneMappingPostEffectPlugInArray()
Initializes a new instance of the ToneMappingPostEffectPlugInArray class
ToneMappingPostEffectPlugInArray(IntPtr)
Initializes a new instance of the ToneMappingPostEffectPlugInArray class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Append
At
Count
Dispose
Releases all resources used by the ToneMappingPostEffectPlugInArray
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render.PostEffects Namespace