RhinoCommon SDK
RenderContentDeleteEventArgs Class
[Missing <summary> documentation for "T:Rhino.Render.RenderContentDeleteEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RenderContentEventArgs
 Rhino.Render.RenderContentDeleteEventArgs
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class RenderContentDeleteEventArgs : RenderContentEventArgs
Public Class RenderContentDeleteEventArgs
	Inherits RenderContentEventArgs
The RenderContentDeleteEventArgs type exposes the following members.
Methods
Name | Description
Top
Properties
Name | Description
Reason
Top
See Also
Reference
Rhino.Render Namespace