RhinoCommon API
LatePostEffectPlugInArray Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.LatePostEffectPlugInArray"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.LatePostEffectPlugInArray
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class LatePostEffectPlugInArray : IDisposable
Public NotInheritable Class LatePostEffectPlugInArray
	Implements IDisposable
The LatePostEffectPlugInArray type exposes the following members.
Constructors
Name | Description
LatePostEffectPlugInArray()
Initializes a new instance of the LatePostEffectPlugInArray class
LatePostEffectPlugInArray(IntPtr)
Initializes a new instance of the LatePostEffectPlugInArray class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Append
At
Count
Dispose
Releases all resources used by the LatePostEffectPlugInArray
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render.PostEffects Namespace