RhinoCommon SDK
TextHorizontalAlignment Enumeration
[Missing <summary> documentation for "T:Rhino.Geometry.TextHorizontalAlignment"]
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum TextHorizontalAlignment
Public Enumeration TextHorizontalAlignment
Members
Member name | Value | Description
Left | 0
Center | 1
Right | 2
See Also
Reference
Rhino.Geometry Namespace