RhinoCommon SDK
RichTextObject Class
 A Rhino Object that represents rich text geometry and attributes
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.RichTextObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class RichTextObject : RhinoObject
Public Class RichTextObject
	Inherits RhinoObject
The RichTextObject type exposes the following members.
Methods
Name | Description
DuplicateTextGeometry
 Constructs a deep (full) copy of the RichText geometry.
Top
Properties
Name | Description
TextGeometry
 Get the RichText geometry for this object.
Top
See Also
Reference
Rhino.DocObjects Namespace