RhinoCommon SDK
CurveBlend Class
 Represents a blend between two curves or surface edges with specific continuity at each end
Inheritance Hierarchy
System.Object
 Rhino.Runtime.CommonObject
 Rhino.Geometry.GeometryBase
 Rhino.Geometry.CurveBlend
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class CurveBlend : GeometryBase
Public Class CurveBlend
	Inherits GeometryBase
The CurveBlend type exposes the following members.
Constructors
Name | Description
CurveBlend
 Makes a new uninitialized CurveBlend
Top
Methods
Name | Description
CalcBlend
 Calculate the shape of the blend and make a curve to represent it
DrawBlend
 Draw the blend
HandlePoint
 Returns the location of a handle point of the blend
SetHandlePoint
 Set the location of a handle point on the blend
Top
Properties
Name | Description
Top
See Also
Reference
Rhino.Geometry Namespace