RhinoCommon SDK
CurveBlend.BlendType Enumeration
 Describes the kind of connection to the target geometry that a CurveBlend has at its ends
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum BlendType
Public Enumeration BlendType
Members
Member name | Value | Description
curve_blend | 0
surface_blend | 1
See Also
Reference
Rhino.Geometry Namespace