RhinoCommon API
RenderMaterial.PhysicallyBased.ChildSlotNames Class
[Missing <summary> documentation for "T:Rhino.Render.RenderMaterial.PhysicallyBased.ChildSlotNames"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderMaterial.PhysicallyBased.ChildSlotNames
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ChildSlotNames
Public Class ChildSlotNames
The RenderMaterial.PhysicallyBased.ChildSlotNames type exposes the following members.
Constructors
Name | Description
RenderMaterial.PhysicallyBased.ChildSlotNames
Initializes a new instance of the RenderMaterial.PhysicallyBased.ChildSlotNames class
Top
Properties
Name | Description
AmbientOcclusion
Anisotropic
AnisotropicRotation
BaseColor
Bump
Clearcoat
ClearcoatBump
ClearcoatRoughness
Displacement
Emission
Metallic
Opacity
OpacityIor
OpacityRoughness
Roughness
Sheen
SheenTint
Specular
SpecularTint
Subsurface
SubsurfaceScatteringColor
SubsurfaceScatteringRadius
Top
Methods
Name | Description
FromTextureType
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render Namespace