RhinoCommon SDK
LeaderCurveType Enumeration
 Curve shape used by leader
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum LeaderCurveType
Public Enumeration LeaderCurveType
Members
Member name | Value | Description
None | 0 |  None
Polyline | 1 |  Polyline
Spline | 2 |  Spline
See Also
Reference
Rhino.Geometry Namespace