RhinoCommon API
RhinoDoc Class
 Represents an active model.
Inheritance Hierarchy
System.Object
 Rhino.RhinoDoc
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class RhinoDoc
Public NotInheritable Class RhinoDoc
The RhinoDoc type exposes the following members.
Properties
Name | Description
ActiveDoc
 WARNING!! Do not use the ActiveDoc if you don't have to. Under Mac Rhino the ActiveDoc can change while a command is running. Use the doc that is passed to you in your RunCommand function or continue to use the same doc after the first call to ActiveDoc.
AnimationProperties
Bitmaps
 bitmaps used in textures, backgrounds, wallpapers, ...
CurrentEnvironment
 Access to the current environment for various uses
CurrentUndoRecordSerialNumber
 >0: undo recording is active and being saved on the undo record with the specified serial number. 0: undo recording is not active. (Disabled or nothing is being recorded.)
CustomRenderSizes
DateCreated
DateLastEdited
DimStyles
DistanceDisplayPrecision
EarthAnchorPoint
Fonts
GroundPlane
Gets the ground plane of this document.
Groups
HatchPatterns
InstanceDefinitions
IsAvailable
IsClosing
IsCommandRunning
 Returns true if Rhino is currently running a command.
IsCreating
IsHeadless
IsInitializing
IsLocked
 Check to see if the file associated with this document is locked. If it is locked then this is the only document that will be able to write the file. Other instances of Rhino will fail to write this document.
IsOpening
IsReadOnly
 Current read-only mode for this document. true if the document can be viewed but NOT saved. false if document can be viewed and saved.
IsSendingMail
 true if Rhino is in the process of sending this document as an email attachment.
Layers
 Layers in the document.
LayoutSpaceAnnotationScalingEnabled
 If LayoutSpaceAnnotationScaling is on, sizes in dimstyles are multiplied by dimscale when the annotation is displayed in a detail viewport not in a detail
Lights
Linetypes
 Linetypes in the document.
Manifest
Materials
Materials in the document.
MeshingParameterStyle
 Type of MeshingParameters currently used by the document to mesh objects
ModelAbsoluteTolerance
Model space absolute tolerance.
ModelAngleToleranceDegrees
Model space angle tolerance.
ModelAngleToleranceRadians
Model space angle tolerance.
ModelBasepoint
 The base point in the model that is used when inserting the model into another as a block definition. By default the base point in any model is 0,0,0.
ModelDistanceDisplayPrecision
ModelRelativeTolerance
Model space relative tolerance.
ModelSpaceAnnotationScalingEnabled
 If ModelSpaceAnnotationScaling is on, sizes in dimstyles are multiplied by dimscale when the annotation is displayed in a model space viewport not in a detail
ModelSpaceHatchScale
 The scale factor for hatches in model space when Hatch Scaling is enabled
ModelSpaceHatchScalingEnabled
 True if hatch scaling is enabled, false if not.
ModelSpaceTextScale
 The scale factor for text in model space when Annotation Scaling is enabled
ModelUnitSystem
Modified
Returns or sets the document's modified flag.
Name
Returns the name of the currently loaded Rhino document (3DM file).
NamedConstructionPlanes
 Collection of named construction planes.
NamedLayerStates
 Collection of named layer states.
NamedPositions
 Collection of named positions.
NamedViews
 Collection of named views.
NextUndoRecordSerialNumber
 The serial number that will be assigned to the next undo record that is constructed.
Notes
Returns or sets the document's notes.
Objects
PageAbsoluteTolerance
Page space absolute tolerance.
PageAngleToleranceDegrees
Page space angle tolerance.
PageAngleToleranceRadians
Page space angle tolerance.
PageDistanceDisplayPrecision
PageRelativeTolerance
Page space relative tolerance.
PageUnitSystem
Path
Returns the path of the currently loaded Rhino document (3DM file).
RedoActive
 Returns true if Redo is currently active.
RenderEnvironments
RenderMaterials
RenderSettings
RenderTextures
RuntimeData
 Collection of document runtime data. This is a good place to put non-serializable, per document data, such as panel view models. Note well: This data will be dispose with the document and does not get serailzed.
RuntimeSerialNumber
 Unique serialNumber for the document while the application is running. This is not a persistent value.
Snapshots
 Collection of snapshots.
Strings
 Collection of document user data strings in this document
TemplateFileUsed
 name of the template file used to create this document. This is a runtime value only present if the document was newly created.
UndoActive
 Returns true if Undo is currently active.
UndoRecordingEnabled
UndoRecordingIsActive
 true if undo recording is actually happening now.
Views
Worksession
 Provides access to the document's worksession.
Top
Methods
Name | Description
AddCustomUndoEvent(String, EventHandler<CustomUndoEventArgs>)
AddCustomUndoEvent(String, EventHandler<CustomUndoEventArgs>, Object)
 Add a custom undo event so you can undo private plug-in data when the user performs an undo or redo
AdjustModelUnitSystem
AdjustPageUnitSystem
BeginUndoRecord
 Instructs Rhino to begin recording undo information when the document is changed outside of a command. We use this, e.g., to save changes caused by the modeless layer or object properties dialogs when commands are not running.
ClearRedoRecords
ClearUndoRecords(Boolean)
ClearUndoRecords(UInt32, Boolean)
Create
 Creates a new RhinoDoc
CreateDefaultAttributes
 Gets the default object attributes for this document. The attributes will be linked to the currently active layer and they will inherit the Document WireDensity setting.
CreateHeadless
 Create a new headless RhinoDoc from a template file
Dispose
Releases all resources used by the RhinoDoc
EndUndoRecord
 Ends the undo record.
Equals(Object) |  (Overrides Object.Equals(Object).)
Export
 Export the entire document to a file. All file formats that Rhino can export to are supported by this function.
ExportSelected
 Export selected geometry to a file. All file formats that Rhino can export to are supported by this function.
ExtractPreviewImage
Extracts the bitmap preview image from the specified model (3DM).
Finalize |  (Overrides Object.Finalize().)
FindFile
 Search for a file using Rhino's search path. Rhino will look in the following places: 1. Current model folder 2. Path specified in options dialog/File tab 3. Rhino system folders 4. Rhino executable folder
FromFilePath
 Search the open document list for a document with a Path equal to the specified file path.
FromId |  Obsolete.
FromRuntimeSerialNumber
GetAnalysisMeshingParameters
 Get analysis meshing parameters currently used by the document
GetCurrentMeshingParameters
 Get the custom meshing parameters that this document will use.
GetEmbeddedFilesList
GetGumballPlane
 Returns the active plane of Rhino's auto-gumball widget. Note, when calling from a Rhino command, make sure the command class has the Rhino.Commands.Style.Transparent command style attribute.
GetHashCode() |  (Overrides Object.GetHashCode().)
GetMeshingParameters
 Get MeshingParameters currently used by the document
GetRenderPrimitiveList
 Build custom render mesh(es) for this document (ie - GH meshes).
GetRenderPrimitives(Boolean, Boolean)
 Get a enumerable list of custom mesh primitives
GetRenderPrimitives(ViewportInfo, Boolean, Boolean)
 Get a enumerable list of custom mesh primitives
GetRenderPrimitives(Guid, ViewportInfo, Boolean, Boolean)
 Get a enumerable list of custom mesh primitives
GetUnitSystemName
Import
 Import geometry into a RhinoDoc from a file. This can be any file format that Rhino can import
Open
 Opens a 3dm file and makes it the active document. If called on windows the active document will be saved and closed and the new document will be opened and become the active document. If called on the Mac the file will be opened in a new document window.
OpenDocuments
 Returns a list of currently open Rhino documents
OpenFile |  Obsolete.
OpenHeadless
 Opens a 3DM file into a new headless RhinoDoc.
ReadFile
ReadFileVersion
 Returns the file version of the current document. Use this function to determine which version of Rhino last saved the document.
Redo
 Redo the last action that was "undone"
Save
 Save doc to disk using the document's Path
SaveAs(String)
 Save doc as a 3dm to a specified path using the current Rhino file version
SaveAs(String, Int32)
 Save doc as a 3dm to a specified path
SaveAsTemplate(String)
 Save this document as a template
SaveAsTemplate(String, Int32)
 Save this document as a template to a specific Rhino file version
SetCustomMeshingParameters
 Set the custom meshing parameters that this document will use. You must also modify the MeshingParameterStyle property on the document to Custom if you want these meshing parameters to be used
SupportsRenderPrimitiveList
 Determines if custom render meshes will be built for this document (ie - GH meshes).
TryGetRenderPrimitiveBoundingBox
 Get the bounding box for the custom render meshes associated with this document (ie - GH meshes).
Undo
 Undo the last action
Write3dmFile
 Write information in this document to a .3dm file. Note, the active document's name will not be changed.
WriteFile
 Write information in this document to a file. Note, the active document's name will be changed to that of the path provided.
Top
Events
Name | Description
ActiveDocumentChanged
 This event is raised when the active document used by modeless user interface changes. On Mac Rhino this will get raised before the NewDocument, BeginOpenDocument and EndOpenDocument events. Mac Rhino will also raise this event with 0 for the document Id and a null document pointer when the last document is closed. Windows Rhino will raise this event after the NewDocument, BeginOpenDocument and EndOpenDocument events when a new or existing model is opened.
AddRhinoObject
Called if a new object is added to the document.
BeforeTransformObjects
 Called before objects are being transformed
BeginOpenDocument
 This event is raised when the document open operation begins. NOTE: On Windows, this event will be fired when a clipboard paste operation occurs, as Rhino opens a .tmp file in the User's Local folder with the contents of the pasted document.
BeginSaveDocument
CloseDocument
DeleteRhinoObject
 Called if an object is deleted. At some later point the object can be un-deleted.
DeselectAllObjects
 Called when all objects are deselected.
DeselectObjects
 Called when object(s) are deselected.
DimensionStyleTableEvent
 Called when any modification happens to a document's dimension style table.
DocumentPropertiesChanged
EndOpenDocument
EndOpenDocumentInitialViewUpdate
 This event is raised after EndOpenDocument when the documents initial views have been created and initialized.
EndSaveDocument
GroupTableEvent
 Called when any modification happens to a document's group table.
InstanceDefinitionTableEvent
 Called when any modification happens to a document's light table.
LayerTableEvent
 Called when any modification happens to a document's layer table.
LightTableEvent
 Called when any modification happens to a document's light table.
MaterialTableEvent
 Called when any modification happens to a document's material table.
ModifyObjectAttributes
 Called when all object attributes are changed.
NewDocument
PurgeRhinoObject
 Called if an object is being purged from a document. The object will cease to exist forever.
RenderEnvironmentTableEvent
RenderMaterialsTableEvent
RenderTextureTableEvent
 Called when the RenderTextureTable has been loaded, is about to be cleared or has been cleared. See RhinoDoc.RenderContentTableEventType for more information.
ReplaceRhinoObject
 Called if an object is about to be replaced. If both RhinoDoc.UndoActive() and RhinoDoc.RedoActive() return false, then immediately after the ReplaceObject event, there will be a DeleteObject event followed by an AddObject event. If either RhinoDoc.UndoActive() or RhinoDoc::RedoActive() return true, then immediately after the ReplaceObject event, there will be a DeleteObject event followed by an UndeleteObject event.
SelectObjects
 Called when object(s) are selected.
TextureMappingEvent
 Called when any modification happens to a document objects texture mapping.
UndeleteRhinoObject
Called if an object is un-deleted.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino Namespace