RhinoCommon API
Channel Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.Channel"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.Channel
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Channel : IDisposable
Public Class Channel
	Implements IDisposable
The Channel type exposes the following members.
Constructors
Name | Description
Channel
Initializes a new instance of the Channel class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Clone
Commit
CPU
CPU_Const
Dispose
Releases all resources used by the Channel
Finalize |  (Overrides Object.Finalize().)
GPU
GPU_Const
Id
PixelSize
SetIsCommitable
WasCommit
Top
Fields
Name | Description
m_cpp
Top
See Also
Reference
Rhino.Render.PostEffects Namespace