RhinoCommon API
PostEffectPlugIn.ExecuteWhileRenderingOptionsValue Enumeration
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffectPlugIn.ExecuteWhileRenderingOptionsValue"]
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ExecuteWhileRenderingOptionsValue
Public Enumeration ExecuteWhileRenderingOptionsValue
Members
Member name | Value | Description
Never | 0
Always | 1
UseDelay | 2
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render.PostEffects Namespace