RhinoCommon SDK
TextureUvwWrapping Enumeration
 Defines Texture UVW wrapping modes
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum TextureUvwWrapping
Public Enumeration TextureUvwWrapping
Members
Member name | Value | Description
Repeat | 0 |  Repeat the texture
Clamp | 1 |  Clamp the texture
See Also
Reference
Rhino.DocObjects Namespace