RhinoCommon API
GetContextArgs Class
[Missing <summary> documentation for "T:Rhino.Input.Custom.GetContextArgs"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.GetContextArgs
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class GetContextArgs
Public Class GetContextArgs
The GetContextArgs type exposes the following members.
Properties
Name | Description
CallCount
 Number of times Get() has been called for a given getter
ContextName
 Name of the context that this get operation is happening under
ContextObject
 Optional object that may be associated with this get operation
Top
Methods
Name | Description
SetGetResult
SetPoint
Top
See Also
Reference
Rhino.Input.Custom Namespace