RhinoCommon API
GumballMode Enumeration
 Transformation modes for gumballs.
 Namespace: Rhino.UI.Gumball
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum GumballMode
Public Enumeration GumballMode
Members
Member name | Value | Description
None | 0
Menu | 1 | Gumball menu button was picked.
TranslateFree | 2 | Unconstrained translation.
TranslateX | 3 | Translation along a single axis.
TranslateY | 4 | Translation along a single axis.
TranslateZ | 5 | Translation along a single axis.
TranslateXY | 6 | Translation in a plane.
TranslateYZ | 7 | Translation in a plane.
TranslateZX | 8 | Translation in a plane.
ScaleX | 9 | Scale along a single axis.
ScaleY | 10 | Scale along a single axis.
ScaleZ | 11 | Scale along a single axis.
RotateX | 12 | Rotation around a single axis.
RotateY | 13 | Rotation around a single axis.
RotateZ | 14 | Rotation around a single axis.
ScaleXY | 12 | Scale in a plane.
ScaleYZ | 13 | Scale in a plane.
ScaleZX | 14 | Scale in a plane.
ExtrudeX | 18 | Extrusion along a single axis.
ExtrudeY | 19 | Extrusion along a single axis.
ExtrudeZ | 20 | Extrusion along a single axis.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.UI.Gumball Namespace