RhinoCommon API
SubDFace Class
 Single face of a SubD
Inheritance Hierarchy
System.Object
 Rhino.Geometry.SubDComponent
 Rhino.Geometry.SubDFace
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class SubDFace : SubDComponent
Public NotInheritable Class SubDFace
	Inherits SubDComponent
The SubDFace type exposes the following members.
Properties
Name | Description
EdgeCount
 Number of edges for this face. Note that EdgeCount is always the same as VertexCount. Two properties are provided simply for clarity.
LimitSurfaceCenterPoint
 Get the limit surface point location at the center of the face
PerFaceColor
 If per-face color is "Empty", then this face does not have a custom color
VertexCount
 Number of vertices for this face. Note that EdgeCount is always the same as VertexCount. Two properties are provided simply for clarity.
Top
Methods
Name | Description
EdgeAt
 Get an edge at a given index
EdgeDirectionMatchesFaceOrientation
 Check if a given edge in this face has the same direction as the face orientation
VertexAt
 Get a vertex that this face uses by index
Top
See Also
Reference
Rhino.Geometry Namespace