RhinoCommon API
RenderChannels Class
 Render Channels. This corresponds to the user's settings in the Rendering panel.
Inheritance Hierarchy
System.Object
 Rhino.Render.FreeFloatingBase
 Rhino.Render.DocumentOrFreeFloatingBase
 Rhino.Render.RenderChannels
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RenderChannels : DocumentOrFreeFloatingBase
Public Class RenderChannels
	Inherits DocumentOrFreeFloatingBase
The RenderChannels type exposes the following members.
Properties
Name | Description
CustomList
Mode
Top
Methods
Name | Description
CopyFrom |  (Overrides FreeFloatingBase.CopyFrom(FreeFloatingBase).)
Top
Events
Name | Description
Changed
 This event is raised when a Render Channels property value is changed.
Top
See Also
Reference
Rhino.Render Namespace