RhinoCommon API
RenderWindow.ChannelGPU.ApiTypes Enumeration
[Missing <summary> documentation for "T:Rhino.Render.RenderWindow.ChannelGPU.ApiTypes"]
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum ApiTypes
Public Enumeration ApiTypes
Members
Member name | Value | Description
OpenGL | 0
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render Namespace