RhinoCommon SDK
RhinoObjectEventArgs Class
[Missing <summary> documentation for "T:Rhino.DocObjects.RhinoObjectEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoObjectEventArgs
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class RhinoObjectEventArgs : EventArgs
Public Class RhinoObjectEventArgs
	Inherits EventArgs
The RhinoObjectEventArgs type exposes the following members.
Methods
Name | Description
Top
Properties
Name | Description
ObjectId
TheObject
Top
See Also
Reference
Rhino.DocObjects Namespace