RhinoCommon API
CommandLineOption Class
[Missing <summary> documentation for "T:Rhino.Input.Custom.CommandLineOption"]
Inheritance Hierarchy
System.Object
 Rhino.Input.Custom.CommandLineOption
 Namespace: Rhino.Input.Custom
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class CommandLineOption
Public NotInheritable Class CommandLineOption
The CommandLineOption type exposes the following members.
Properties
Name | Description
CurrentListOptionIndex
EnglishName
 The English command option name
Index
LocalName
 The localized command option name
StringOptionValue
 Assigned by RhinoGet.Get if an option value is specified in a script or by a command window control.
Top
Methods
Name | Description
IsValidOptionName
 Test a string to see if it can be used as an option name in any of the RhinoGet::AddCommandOption...() functions.
IsValidOptionValueName
 Test a string to see if it can be used as an option value in RhinoGet::AddCommandOption, RhinoGet::AddCommandOptionToggle, or RhinoGet::AddCommandOptionList.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Input.Custom Namespace