RhinoCommon API
RenderWindow.ChannelEx Class
[Missing <summary> documentation for "T:Rhino.Render.RenderWindow.ChannelEx"]
Inheritance Hierarchy
System.Object
 Rhino.Render.RenderWindow.Channel
 Rhino.Render.RenderWindow.ChannelEx
 Namespace: Rhino.Render
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ChannelEx : RenderWindow.Channel, IDisposable
Public Class ChannelEx
	Inherits RenderWindow.Channel
	Implements IDisposable
The RenderWindow.ChannelEx type exposes the following members.
Constructors
Name | Description
RenderWindow.ChannelEx
Initializes a new instance of the RenderWindow.ChannelEx class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Clone
Finalize |  (Overrides Object.Finalize().)
GetMinMaxValues
GetValueEx
GetValueRect
Height
Id
Width
Top
Fields
Name | Description
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render Namespace