RhinoCommon API
FileObjWriteOptions.SubDMeshing Enumeration
 Determines whether the surface or control net of a SubD object is used to generate a mesh
 Namespace: Rhino.FileIO
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum SubDMeshing
Public Enumeration SubDMeshing
Members
Member name | Value | Description
Surface | 0 |  The SubD surface is used
ControlNet | 1 |  The SubD control net is used
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.FileIO Namespace