RhinoCommon API
PlugInDescriptionAttribute Class
[Missing <summary> documentation for "T:Rhino.PlugIns.PlugInDescriptionAttribute"]
Inheritance Hierarchy
System.Object
 System.Attribute
 Rhino.PlugIns.PlugInDescriptionAttribute
 Namespace: Rhino.PlugIns
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class PlugInDescriptionAttribute : Attribute
Public NotInheritable Class PlugInDescriptionAttribute
	Inherits Attribute
The PlugInDescriptionAttribute type exposes the following members.
Constructors
Name | Description
PlugInDescriptionAttribute
Initializes a new instance of the PlugInDescriptionAttribute class
Top
Properties
Name | Description
DescriptionType
Value
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.PlugIns Namespace