RhinoCommon SDK
SubD.SubDFacetType2 Enumeration
 SubD::FacetType reports the default facet type for subdivision algorithms.
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum SubDFacetType2
Public Enumeration SubDFacetType2
Members
Member name | Value | Description
Unset | 0 |  Not a valid facet type.
Tri | 3 |  Triangle
Quad | 4 |  Quadrangle
See Also
Reference
Rhino.Geometry Namespace