RhinoCommon API
RhinoApp.KeyboardHookEvent Delegate
 KeyboardEvent delegate
 Namespace: Rhino
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public delegate void KeyboardHookEvent(
	int key
)
Public Delegate Sub KeyboardHookEvent (
	key As Integer
)
Parameters
key
Type: System.Int32
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino Namespace