RhinoCommon API
ChannelDataCollection Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.ChannelDataCollection"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.ChannelDataCollection
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class ChannelDataCollection : IDisposable
Public Class ChannelDataCollection
	Implements IDisposable
The ChannelDataCollection type exposes the following members.
Constructors
Name | Description
ChannelDataCollection
Initializes a new instance of the ChannelDataCollection class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Append
At
Count
Dispose
Releases all resources used by the ChannelDataCollection
Finalize |  (Overrides Object.Finalize().)
Top
See Also
Reference
Rhino.Render.PostEffects Namespace