RhinoCommon API
DisplayPen Class
 Pen used to define stroke applied to several DisplayPipeline draw functions
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayPen
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class DisplayPen
Public Class DisplayPen
The DisplayPen type exposes the following members.
Constructors
Name | Description
DisplayPen
Initializes a new instance of the DisplayPen class
Top
Properties
Name | Description
CapStyle
 How caps are drawn at the ends of open curves
Color
 Color applied to stroke
JoinStyle
 How corners of curves are joined
PatternBySegment
 Restart patterns at corners in a curve
PatternLengthInWorldUnits
 If true, lengths in pattern definition are interpreted to be in world units. If false, screen pixel distances are used.
PatternOffset
 Offset to apply to pattern. If RhinoMath.UnsetSingle, then pattern is centered to keep even dash lengths at ends
Thickness
 Thickness for stoke
Top
Methods
Name | Description
PatternAsArray
 Get the pattern for this pen as an array of dash,gap,dash,gap... values
SetPattern
 Set pattern to apply for a stroke.
Top
See Also
Reference
Rhino.Display Namespace