RhinoCommon SDK
CurveBlend.EndType Enumeration
 Describes the kind of connection to the target geometry that a CurveBlend has at its ends
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum EndType
Public Enumeration EndType
Members
Member name | Value | Description
unset | 0 |  No type has been set
point | 1 |  The blend connects to a 3d point location with position continuity
curve | 2 |  The blend connects to a curve. Continuity and location on the curve are described in m_continuity, m_curve_t and m_bFlip
face | 3 |  The curve connects to the edge of a surface. Continuity and location on the surface edge are described by m_continuity, m_trim_t and m_edge_angle
See Also
Reference
Rhino.Geometry Namespace