RhinoCommon SDK
DetailViewObject Class
[Missing <summary> documentation for "T:Rhino.DocObjects.DetailViewObject"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.DetailViewObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class DetailViewObject : RhinoObject
Public Class DetailViewObject
	Inherits RhinoObject
The DetailViewObject type exposes the following members.
Methods
Name | Description
CommitViewportChanges
Top
Properties
Name | Description
DetailGeometry
IsActive
Viewport
Top
See Also
Reference
Rhino.DocObjects Namespace