RhinoCommon API
DisplayPipelineAttributes Class
 Represents display pipeline settings, such as "show transparency" and "show grips".
Inheritance Hierarchy
System.Object
 Rhino.Display.DisplayPipelineAttributes
 Namespace: Rhino.Display
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
[SerializableAttribute]
public class DisplayPipelineAttributes : IDisposable,
	ISerializable
<SerializableAttribute>
Public Class DisplayPipelineAttributes
	Implements IDisposable, ISerializable
The DisplayPipelineAttributes type exposes the following members.
Constructors
Name | Description
DisplayPipelineAttributes
Initializes a new instance of the DisplayPipelineAttributes class
Top
Properties
Name | Description
AmbientLightingColor
BoundingBoxMode
CastShadows
Cast shadows.
ContextForDraw
CurveColor
Color used for drawing curves
CurveThickness
Pixel thickness for curves
DisableConduits
DisableTransparency
EnglishName
FillMode
 Get or set the frame buffer fill mode.
Id
IgnoreHighlights
LocalName
LockedObjectsDrawBehindOthers
Locked object are drawn behind other objects
MeshSpecificAttributes
ObjectColor
PointRadius
PointStyle
RealtimeDisplayId
 Get the ID of the real-time display engine attached to the view. This will be Guid.Empty if no real-time display engine is in use. This can be the case for instance when starting a _Render session for a real-time viewport integration. That still would cause this ID to be Guid.Empty.
RealtimeRenderPasses
 Get or set the real-time passes amount
ShadeVertexColors
Shade using vertex colors.
ShadingEnabled
Draw shaded meshes and surfaces. Set to false to use Flat Shading.
ShadowColor
ShowAnnotations
Show annotations.
ShowClippingPlanes
Show clipping planes.
ShowCurves
Draw curves
ShowGrips
ShowIsoCurves
Draw surface ISO curves.
ShowLights
Show light widgets.
ShowPointClouds
Show point clouds.
ShowPoints
Show points.
ShowRealtimeRenderProgressBar
 Get or set whether the display is used for preview rendering or not.
ShowSurfaceEdges
Show surface edges.
ShowTangentEdges
Show tangent edges.
ShowTangentSeams
Show tangent seams.
ShowText
Show text.
StereoContext
 Get or set the stereo render context.
SurfaceEdgeThickness
 Thickness for surface edges
UseAssignedObjectMaterial
 Gets whether objects ought to be drawn using their assigned rendering material.
UseCustomObjectColor
 Gets whether objects ought to be drawn using a custom color.
UseCustomObjectMaterial
 Gets whether objects ought to be drawn using a custom material.
UseSingleCurveColor
 Use a single color for drawing curves
ViewSpecificAttributes
XrayAllObjects
Top
Methods
Name | Description
Dispose()
Releases all resources used by the DisplayPipelineAttributes
Dispose(Boolean)
Releases the unmanaged resources used by the DisplayPipelineAttributes and optionally releases the managed resources
Finalize |  (Overrides Object.Finalize().)
GetFill
 Get fill colors used for clearing the frame buffer
GetObjectData
SetFill(Color)
 Set fill mode to solid color and set the fill color
SetFill(Color, Color)
 Set fill mode to two color and set the colors
SetFill(Color, Color, Color, Color)
 Set the fill mode to four color gradient and set the colors
Top
See Also
Reference
Rhino.Display Namespace