RhinoCommon API
PostEffectUI Class
 PostEffectUI class provides a way for pep plugins to add ui sections
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.PostEffectUI
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PostEffectUI : IDisposable
Public Class PostEffectUI
	Implements IDisposable
The PostEffectUI type exposes the following members.
Constructors
Name | Description
PostEffectUI
Initializes a new instance of the PostEffectUI class
Top
Methods
Name | Description
AddSection
 Add a section to the UI.
Dispose
Releases all resources used by the PostEffectUI
Finalize |  (Overrides Object.Finalize().)
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render.PostEffects Namespace