RhinoCommon SDK
RenderContentAddedEventArgs Class
[Missing <summary> documentation for "T:Rhino.Render.RenderContentAddedEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.Render.RenderContentEventArgs
 Rhino.Render.RenderContentAddedEventArgs
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class RenderContentAddedEventArgs : RenderContentEventArgs
Public Class RenderContentAddedEventArgs
	Inherits RenderContentEventArgs
The RenderContentAddedEventArgs type exposes the following members.
Methods
Name | Description
Top
Properties
Name | Description
Reason
Top
See Also
Reference
Rhino.Render Namespace