RhinoCommon API
DimStyleTable Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.DimStyleTable"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Tables.DimStyleTable
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public sealed class DimStyleTable : IEnumerable<DimensionStyle>,
	IEnumerable
Public NotInheritable Class DimStyleTable
	Implements IEnumerable(Of DimensionStyle), IEnumerable
The DimStyleTable type exposes the following members.
Properties
Name | Description
BuiltInStyles
 Creates an array of default AnnotationStyle objects
ComponentType
 Returns DimStyle.
 (Overrides CommonComponentTable<T>.ComponentType.)
Count
Number of dimstyles in the table.
In Rhino for Windows 7.0, this member is inherited from .CommonComponentTable<T>Count.
Current
 Returns an instance of the current DimensionStyle.
CurrentDimensionStyle
 Do not use. Use the Current property.
CurrentDimensionStyleIndex
CurrentId
CurrentIndex
Document
Document that owns this dimstyle table.
In Rhino for Windows 7.0, this member is inherited from .RhinoDocCommonTable<T>Document.
Item
Top
Methods
Name | Description
Add(String)
 Adds a new AnnotationStyle to the document. The new AnnotationStyle will be initialized with the current default AnnotationStyle properties.
Add(String, Boolean)
 Adds a new AnnotationStyle to the document. The new AnnotationStyle will be initialized with the current default AnnotationStyle properties.
Add(DimensionStyle, Boolean)
 Adds a new DimensionStyle to the document.
Delete(DimensionStyle)
 Removes an annotation style.
 (Overrides CommonComponentTable<T>.Delete(T).)
Delete(Int32, Boolean)
DeleteDimensionStyle
Find(String, Boolean)
Find(Guid, Boolean)
FindIndex
 Retrieves a DimensionStyle object based on Index. This seach type of search is discouraged. We are moving towards using only IDs for all tables.
FindName
 Finds the DimensionStyle with a given name and retuns it. None is returned if no DimensionStyle is found.
FindRoot
GetEnumerator
GetUnusedDimensionStyleName
GetUnusedStyleName()
 Get a unique name for a style that does not already exist in the DimStyle table
GetUnusedStyleName(String)
 Get a unique name for a dimension style that does not already exist in the DimStyle table
Modify(DimensionStyle, AnnotationBase)
Modify(DimensionStyle, Guid, Boolean)
Modifies dimension style settings.
Modify(DimensionStyle, Int32, Boolean)
Modifies dimension style settings.
SetCurrent
 Sets the Current property.
SetCurrentDimensionStyleIndex
 Do not use. Use the SetCurrent(Int32, Boolean) method.
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.DocObjects.Tables Namespace