RhinoCommon API
InstanceDefinitionTableEventType Enumeration
[Missing <summary> documentation for "T:Rhino.DocObjects.Tables.InstanceDefinitionTableEventType"]
 Namespace: Rhino.DocObjects.Tables
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum InstanceDefinitionTableEventType
Public Enumeration InstanceDefinitionTableEventType
Members
Member name | Value | Description
Added | 0
Deleted | 1
Undeleted | 2
Modified | 3
Sorted | 4 | InstanceDefinitionTable.Sort() potentially changed sort order.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.DocObjects.Tables Namespace