RhinoCommon SDK
Font Class
[Missing <summary> documentation for "T:Rhino.DocObjects.Font"]
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.Font
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class Font
Public Class Font
The Font type exposes the following members.
Methods
Name | Description
AvailableFontFaceNames
Top
Properties
Name | Description
Bold
FaceName
Italic
Top
See Also
Reference
Rhino.DocObjects Namespace