RhinoCommon API
PostEffectPlugIn Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.PostEffectPlugIn"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.PostEffectPlugIn
 Rhino.Render.PostEffects.ListablePostEffectPlugIn
 Rhino.Render.PostEffects.ToneMappingPostEffectPlugIn
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class PostEffectPlugIn
Public Class PostEffectPlugIn
The PostEffectPlugIn type exposes the following members.
Constructors
Name | Description
PostEffectPlugIn()
Initializes a new instance of the PostEffectPlugIn class
PostEffectPlugIn(IntPtr)
Initializes a new instance of the PostEffectPlugIn class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
CanExecute
 Return true if the PEP can execute, else false. The default implementation checks if the PEP is 'On' and 'Shown'. PEP authors can override this to include other criteria but please be sure to call the base class.
CRC
 A CRC of the state of this PEP.
ExecuteWhileRenderingDelayMS
 If GetExecuteWhileRenderingOption() returns UseDelay then this method returns the delay in milliseconds before the PEP should execute for the first time.After the first time, the PEP will execute every time the dib is updated during rendering. see enum ExecuteWhileRenderingOptions.
ReadFromDocumentDefaults
 Read the state from document defaults. This is implemented by RDK to call ReadState() so usually a PEP only has to implement ReadState(). However, a PEP can override this method to take complete control of how the document defaults are read.
RequiredChannels
 The RDK calls this method to determine which channels a PEP requires. If a required channel is not available, the RDK will hide the PEP's UI and display explanatory text instead. Note: As a convenience, the default implementation adds IRhRdkRenderWindow::chanRGBA to the output array. Most PEPs should be able to use this default with no need to override the method.
SupportsHDRData
 Return true if the PEP can operate on HDR data (meaning channels containing values greater than 1).
WriteToDocumentDefaults
 Write the state to document defaults. This is implemented by RDK to call WriteState() so usually a PEP only has to implement WriteState(). However, a PEP can override this method to take complete control of how the document defaults are written.
Top
Fields
Name | Description
m_cpp
uf_ProductionRendering
uf_RealtimeRendering
uf_ViewportDisplay
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render.PostEffects Namespace