RhinoCommon API
Pixels Class
[Missing <summary> documentation for "T:Rhino.Render.PostEffects.Pixels"]
Inheritance Hierarchy
System.Object
 Rhino.Render.PostEffects.Pixels
 Namespace: Rhino.Render.PostEffects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class Pixels : IDisposable
Public Class Pixels
	Implements IDisposable
The Pixels type exposes the following members.
Constructors
Name | Description
Pixels
Initializes a new instance of the Pixels class
Top
Properties
Name | Description
CppPointer
Top
Methods
Name | Description
Dispose
Releases all resources used by the Pixels
Finalize |  (Overrides Object.Finalize().)
Get
Top
Version Information
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Render.PostEffects Namespace