RhinoCommon SDK
LeaderTextAttachStyle Enumeration
 How text aligns vertically with leader arrow
Namespace: Rhino.Geometry
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum LeaderTextAttachStyle
Public Enumeration LeaderTextAttachStyle
Members
Member name | Value | Description
Top | 0 |  Top of text
FirstLine | 4 |  Middle of first text line
Middle | 3 |  Middle of text or content
LastLine | 4 |  Middle of last text line
Bottom | 5 |  Bottom of text
Underlined | 6 |  Bottom of text, text underlined
See Also
Reference
Rhino.Geometry Namespace