RhinoCommon API
RhinoObjectSelectionEventArgs Class
[Missing <summary> documentation for "T:Rhino.DocObjects.RhinoObjectSelectionEventArgs"]
Inheritance Hierarchy
System.Object
 System.EventArgs
 Rhino.DocObjects.RhinoObjectSelectionEventArgs
 Namespace: Rhino.DocObjects
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public class RhinoObjectSelectionEventArgs : EventArgs
Public Class RhinoObjectSelectionEventArgs
	Inherits EventArgs
The RhinoObjectSelectionEventArgs type exposes the following members.
Properties
Name | Description
Document
RhinoObjects
Selected
 Returns true if objects are being selected. Returns false if objects are being deselected.
Top
Methods
Name | Description
Top
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.DocObjects Namespace