RhinoCommon API
PipeCapMode Enumeration
Defines styles used for creating Brep pipes.
 Namespace: Rhino.Geometry
 Assembly: RhinoCommon (in RhinoCommon.dll)
Syntax
public enum PipeCapMode
Public Enumeration PipeCapMode
Members
Member name | Value | Description
None | 0 | No cap.
Flat | 1 | Caps with planar surface.
Round | 2 | Caps with hemispherical surface.
Version Information
Rhino for Mac
Supported in: 5.4
Rhino for Windows
Supported in: 7.0
See Also
Reference
Rhino.Geometry Namespace