RhinoCommon SDK
ShowMessageBoxDefaultButton Enumeration
[Missing <summary> documentation for "T:Rhino.UI.ShowMessageBoxDefaultButton"]
Namespace: Rhino.UI
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum ShowMessageBoxDefaultButton
Public Enumeration ShowMessageBoxDefaultButton
Members
Member name | Value | Description
Button1 | 0
Button2 | 256
Button3 | 512
See Also
Reference
Rhino.UI Namespace