RhinoCommon API
ProgressState Enumeration
 Describes the state of progress.
 Namespace: Rhino.Runtime.RhinoAccounts
 Assembly: RhinoCommon (in RhinoCommon.dll)
Since: 7.0
Syntax
public enum ProgressState
Public Enumeration ProgressState
Members
Member name | Value | Description
AwaitingLogin | 0 |  The task is awaiting for the user to login.
RetrievingTokens | 1 |  The task is now nogotiating with the remote server for auth tokens.
Other | 2 |  Other
See Also
Reference
Rhino.Runtime.RhinoAccounts Namespace