RhinoCommon SDK
LeaderObject Class
 Represents a Leader that is picked in a document
Inheritance Hierarchy
System.Object
 Rhino.DocObjects.RhinoObject
 Rhino.DocObjects.AnnotationObjectBase
 Rhino.DocObjects.LeaderObject
Namespace: Rhino.DocObjects
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class LeaderObject : AnnotationObjectBase
Public Class LeaderObject
	Inherits AnnotationObjectBase
The LeaderObject type exposes the following members.
Methods
Name | Description
Top
Properties
Name | Description
Top
See Also
Reference
Rhino.DocObjects Namespace