RhinoCommon SDK
MostRecentCommandDescription Class
 Stores the macro and display string of the most recent command.
Inheritance Hierarchy
System.Object
 Rhino.Commands.MostRecentCommandDescription
Namespace: Rhino.Commands
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public class MostRecentCommandDescription
Public Class MostRecentCommandDescription
The MostRecentCommandDescription type exposes the following members.
Constructors
Name | Description
MostRecentCommandDescription
Initializes a new instance of the MostRecentCommandDescription class
Top
Methods
Name | Description
Top
Properties
Name | Description
DisplayString
Macro
Top
See Also
Reference
Rhino.Commands Namespace