RhinoCommon SDK
RenderContentAddedReason Enumeration
 Reason content is being attached to a document. see ContentAttaching
Namespace: Rhino.Render
Assembly: RhinoCommon (in RhinoCommon.dll) Version: Rhino 6.0
Syntax
public enum RenderContentAddedReason
Public Enumeration RenderContentAddedReason
Members
Member name | Value | Description
Attach | 0 |  Content is being attached by the RhinoDoc.AttachContent() or RenderContent.AttachChild() methods.
Change | 1 |  Content is being attached while changing.
Undo | 2 |  Content is being attached during undo/redo.
Open | 4 |  Content is being attached during open document.
See Also
Reference
Rhino.Render Namespace